MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_i3c.c
  * @brief   I3C HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Improvement Inter Integrated Circuit (I3C) peripheral:
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral state and errors functions
  *
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  *********************************************************************************************************************/

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

/** @addtogroup I3C I3C
  * @{
  */
/** @defgroup I3C_Introduction I3C Introduction
  * @{
The STM32 Hardware Abstraction Layer for I3C provides a comprehensive software interface to support the I3C
communication protocol on STM32 microcontrollers. I3C (Improved Inter-Integrated Circuit) is an advanced, high-speed,
and energy-efficient serial bus protocol designed to enhance and replace traditional I2C, offering features such as
dynamic device management and higher data rates. While I3C maintains backward compatibility with many I2C devices,
certain I2C features such as stretch mode are not supported.
This HAL driver abstracts low-level hardware details, enabling configuration, data transfer, and interrupt handling,
thereby accelerating development and ensuring robust, scalable embedded applications that leverage the full
capabilities of the I3C bus.
  */
/**
  * @}
  */

/** @defgroup I3C_How_To_Use I3C How To Use
  * @{

# How to use the I3C HAL

Use the I3C HAL driver as follows:

## 1. Declare
  - A @ref hal_i3c_handle_t handle structure,
    for example: hal_i3c_handle_t hi3c;
  - A @ref hal_i3c_transfer_ctx_t transfer descriptor structure (controller only),
    for example: hal_i3c_transfer_ctx_t my_transfer_ctx;

## 2. Initialize
  - Initialize the I3Cx driver with an I3C HW instance by calling HAL_I3C_Init().
  - The I3Cx clock is enabled inside HAL_I3C_Init() if USE_HAL_I3C_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO.

## 3. Configure low-level hardware
  - Enable the I3Cx clock if USE_HAL_I3C_CLK_ENABLE_MODEL = HAL_CLK_ENABLE_NO.
  - I3Cx pin configuration:
    - Enable the clock for the I3Cx GPIOs.
    - Configure I3C pins as alternate function push-pull with no-pull.
  - NVIC configuration for interrupt processing:
    - Configure the I3Cx interrupt priority.
    - Enable the NVIC I3C IRQ Channel.
  - DMA configuration for DMA processing:
    - Declare a hal_dma_handle_t handle structure for the Control Register (CR) management channel.
    - Declare a hal_dma_handle_t handle structure for the transmit channel.
    - Declare a hal_dma_handle_t handle structure for the receive channel.
    - Enable the DMAx interface clock.
    - Configure the DMA handle parameters.
    - Configure the DMA Control Register (CR) channel.
    - Configure the DMA Tx channel.
    - Configure the DMA Rx channel.
    - Associate the initialized DMA handle with the hi3c DMA CR, Tx, or Rx as necessary.
    - Configure the priority and enable the NVIC for the transfer complete interrupt on the DMA CR, Tx or Rx instance.

## 4. Configure communication mode
  - Controller mode: HAL_I3C_CTRL_SetConfig()
  - Target mode: HAL_I3C_TGT_SetConfig()

## 5. Configure FIFOs (optional)
  - Controller: HAL_I3C_CTRL_SetConfigFifo()
  - Target: HAL_I3C_TGT_SetConfigFifo()
  - At the end of a transfer, all FIFOs can be flushed: HAL_I3C_FlushAllFifos(), or individually:
    HAL_I3C_FlushTxFifo(), HAL_I3C_FlushRxFifo(), HAL_I3C_CTRL_FlushControlFifo(), HAL_I3C_FlushstatusFifo().

## 6. Target advanced features

  - HAL_I3C_TGT_SetConfigGETMXDS()
  - HAL_I3C_TGT_EnableGroupAddrCapability()
  - HAL_I3C_TGT_SetConfigMaxDataSize()
  - HAL_I3C_TGT_SetConfigIBI()
  - HAL_I3C_TGT_EnableIBI()
  - HAL_I3C_TGT_EnableHotJoinRequest()
  - HAL_I3C_TGT_EnableCtrlRoleRequest()

### 6.1 ENTDAA payload configuration
  Before initiating any ENTDAA, the target must configure the target payload of the ENTDAA by using
  HAL_I3C_TGT_SetPayloadENTDAAConfig().

### 6.2 Target Hot-Join (interrupt mode)
  Request a Hot-Join in target mode: HAL_I3C_TGT_HotJoinReq_IT().
  At completion, HAL_I3C_TGT_HotJoinCallback() is executed, and user code can add custom handling by overriding this
  weak callback function or by registering a callback function.

### 6.3 Target In-Band Interrupt (interrupt mode)
  Request an In-Band Interrupt in target mode: HAL_I3C_TGT_IBIReq_IT()
  At completion, HAL_I3C_NotifyCallback() is executed, and user code can add custom handling by overriding this weak
  callback function or by registering a callback function.

### 6.4 Target Controller-Role request (interrupt mode)
  Request a Controller Role in target mode: HAL_I3C_TGT_ControlRoleReq_IT()
  At completion, HAL_I3C_NotifyCallback() is executed, and user code can add custom handling by overriding this weak
  callback function or by registering a callback function.

### 6.5 Target Wakeup capability
  To manage the wakeup capability, use HAL_I3C_TGT_ActivateNotification() or HAL_I3C_TGT_DeactivateNotification() to
  enable or disable the wakeup interrupt. At wakeup detection, the associated HAL_I3C_NotifyCallback() is executed.

## 7. Controller advanced features
  - HAL_I3C_CTRL_SetConfigOwnDynamicAddress()
  - HAL_I3C_CTRL_EnableHotJoinAllowed()
  - HAL_I3C_CTRL_EnableHighKeeperSDA()
  - HAL_I3C_CTRL_SetConfigStallTime()
  - HAL_I3C_CTRL_SetConfigBusDevices()
  - HAL_I3C_CTRL_EnableResetPattern()

