MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
### 7.1 Dynamic Address Assignment procedure
  - Before initiating any IO operation, launch an assignment of the different target dynamic addresses by using
    HAL_I3C_CTRL_DynAddrAssign() in polling mode or HAL_I3C_CTRL_DynAddrAssign_IT() in interrupt mode. This procedure
    is named Enter Dynamic Address Assignment (ENTDAA CCC command).
  - For the initiation of ENTDAA procedure, each target connected and powered on the I3C bus must respond to this
    particular Command Common Code (CCC) by sending its proper Payload (an amount of 48-bits which contain the target
    characteristics). Each time a target responds to ENTDAA sequence, the controller application is informed through
    HAL_I3C_CTRL_TgtReqDynAddrCallback() of the reception of the target payload.
  - Then send an associated dynamic address through HAL_I3C_CTRL_SetDynAddr().
    This procedure loops automatically in hardware side until a target responds to repeated ENTDAA sequence.
  - The controller application is informed of the end of the procedure at reception of HAL_I3C_CTRL_DAACpltCallback().
  - Then retrieve ENTDAA payload information through HAL_I3C_CTRL_Get_ENTDAA_Payload_Info().
  - At the end of the procedure, the function HAL_I3C_CTRL_SetConfigBusDevices() must be called to store the target
    capabilities in the hardware register, including dynamic address, IBI support with or without additional data byte,
    Controller-Role request support, or controller automatic stop transfer after IBI.

### 7.3 Device ready checks
  - To check if I3C target device is ready for communication, use the function HAL_I3C_CTRL_PoolForDeviceI3cReady().
  - To check if I2C target device is ready for communication, use the function HAL_I3C_CTRL_PoolForDeviceI2cReady().

### 7.4 Bus arbitration generation
  - To send a message header {S + 0x7E + W + STOP}, use the function HAL_I3C_CTRL_GenerateArbitration().

### 7.5 Reset pattern insertion
   The controller app must enable the reset pattern configuration using HAL_I3C_CTRL_EnableResetPattern()
   before calling HAL_I3C_CTRL_Transfer().
   To have a standard STOP emitted at the end of a frame containing a RSTACT CCC command, the application must
   disable the reset pattern configuration using HAL_I3C_CTRL_DisableResetPattern() before calling
   HAL_I3C_CTRL_Transfer().
   Use HAL_I3C_CTRL_IsEnabledResetPattern() to check Reset pattern configuration.

### 7.6 Pattern generation
   - To send a target reset pattern or HDR exit pattern, use the function HAL_I3C_CTRL_GeneratePatterns().

## 8. Controller IO operations
### 8.1 Prepare transfer context
  Before initiating any IO operation, prepare the frame descriptors in the transfer context with their associated
  buffer allocation. It is purely software; no I3C handle is needed.
  Respect the following steps:
  - Reset the transfer context: HAL_I3C_CTRL_ResetTransferCtx().
  - Provide the control buffer: HAL_I3C_CTRL_InitTransferCtxTc()
  - Provide the Tx buffer (if needed): HAL_I3C_CTRL_InitTransferCtxTc()
  - Provide the Rx buffer (if needed): HAL_I3C_CTRL_InitTransferCtxRx()
  - Build the transfer context. Private: HAL_I3C_CTRL_BuildTransferCtxPrivate() or
    CCC: HAL_I3C_CTRL_BuildTransferCtxCCC()
  - The built transfer context is ready for controller IO operation. The driver does not modify it during the
  operation. It can be reused or stored.

### 8.2 Controller polling IO operation (blocking)
  - Start a controller-mode transfer of a Common Command Code in a direct or direct receive CCC with defbyte or
    private data in an I2C or I3C communication: HAL_I3C_CTRL_Transfer().

### 8.3 Controller DMA and interrupt mode IO operation
  - Transmit and/or receive a quantity of private data in an I3C or an I2C or a broadcast or a direct communication
    in non-blocking mode: HAL_I3C_CTRL_Transfer_IT() or HAL_I3C_CTRL_Transfer_DMA().
  - At the end of the transfer, HAL_I3C_CTRL_TransferCpltCallback() is executed, and user code can add custom handling
    by overriding this weak callback function or by registering a callback function.

## 9. Target IO operations
### 9.1 Target polling IO operation (blocking)
  - Transmit private data in target mode: HAL_I3C_TGT_Transmit()
  - Receive private data in target mode: HAL_I3C_TGT_Receive()
  - At the end of a transfer, flush FIFOs if needed by using HAL_I3C_FlushAllFifos() to flush all FIFOs, or flush
    individual FIFOs by using HAL_I3C_FlushTxFifo(), HAL_I3C_FlushRxFifo().
  - Request a Hot-Join in target mode: HAL_I3C_TGT_HotJoinReq()
  - Request an In-Band Interrupt in target mode: HAL_I3C_TGT_IBIReq()
  - Request a Controller-Role in target mode: HAL_I3C_TGT_ControlRoleReq()

### 9.2 Target DMA and Interrupt mode IO operation
  - Transmit private data in target mode in an I3C communication by using HAL_I3C_TGT_Transmit_IT() or
    HAL_I3C_TGT_Transmit_DMA().
  - At the end of the transfer, HAL_I3C_TGT_TxCpltCallback() is executed, and user code can add custom handling by
    overriding this weak callback function or by registering a callback function.
  - Receive private data in target mode in an I3C communication: HAL_I3C_TGT_Receive_IT() or
    HAL_I3C_TGT_Receive_DMA().
  - At the end of the transfer, HAL_I3C_TGT_RxCpltCallback() is executed, and user code can add custom handling by
    overriding this weak callback function or by registering a callback function.

## 10. Notifications and asynchronous events
  To get asynchronous events, use HAL_I3C_CTRL_ActivateNotification() or HAL_I3C_TGT_ActivateNotification().
  Each time one or more events are detected by hardware, HAL_I3C_NotifyCallback() is executed, and user code can add
  custom handling by overriding this weak callback function or by registering a callback function.
  Then retrieve specific associated event data through HAL_I3C_GetCCCInfo().

## 11. Error management
  In case of transfer error, HAL_I3C_ErrorCallback() is executed, and user code can add custom handling by overriding
  this weak callback function or by registering a callback function.

