MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
## 12. Abort operation
  Abort an I3C communication process with interrupt using HAL_I3C_Abort_IT().
  At the end of the abort process, HAL_I3C_AbortCpltCallback() is executed, and user code can add custom handling by
  overriding this weak callback function or by registering a callback function.

## 13. Callback registration
  The compilation flag USE_HAL_I3C_REGISTER_CALLBACKS allows dynamic configuration of
  the driver callbacks via dedicated registration APIs, instead of relying on weak default functions.

  Pointer in hal_i3c_handle_t  | weak default functions               | Callback registration function
  ---------------------------- | ------------------------------------ | --------------------------------------------
  DAACpltCallback              | HAL_I3C_CTRL_DAACpltCallback()       | HAL_I3C_CTRL_RegisterDAACpltCallback()
  TransferCpltCallback         | HAL_I3C_CTRL_TransferCpltCallback()  | HAL_I3C_CTRL_RegisterTransferCpltCallback()
  TgtReqDynAddrCallback        | HAL_I3C_CTRL_TgtReqDynAddrCallback() | HAL_I3C_CTRL_RegisterTgtReqDynAddrCallback()
  TgtTxCpltCallback            | HAL_I3C_TGT_TxCpltCallback()         | HAL_I3C_TGT_RegisterTxCpltCallback()
  TgtRxCpltCallback            | HAL_I3C_TGT_RxCpltCallback()         | HAL_I3C_TGT_RegisterRxCpltCallback()
  TgtHotJoinCallback           | HAL_I3C_TGT_HotJoinCallback()        | HAL_I3C_TGT_RegisterHotJoinCallback()
  NotifyCallback               | HAL_I3C_NotifyCallback()             | HAL_I3C_RegisterNotifyCallback()
  AbortCpltCallback            | HAL_I3C_AbortCpltCallback()          | HAL_I3C_RegisterAbortCpltCallback()
  ErrorCallback                | HAL_I3C_ErrorCallback()              | HAL_I3C_RegisterErrorCallback()

  Notes:
  - To unregister and restore the default weak callback, re-register the corresponding default function.
  - By default, after HAL_I3C_Init() and when the state is HAL_I3C_STATE_INIT, all callbacks are set to their
    default weak implementations.
  - Register callbacks when handle global_state is HAL_I3C_STATE_INIT or HAL_I3C_STATE_IDLE.
  - When USE_HAL_I3C_REGISTER_CALLBACKS is set to 0 or not defined, the callback registration feature is not
    available and weak callbacks are used.

## 14. Acquire/Release the I3C bus
  - When the compilation flag USE_HAL_MUTEX is set to 1, it allows the user to acquire/reserve the whole I3C bus for
    executing a process.
    The HAL Acquire/Release are based on the HAL OS abstraction layer (stm32_hal_os.c/.h osal):
      - HAL_I3C_AcquireBus() to acquire the bus or wait for it.
      - HAL_I3C_ReleaseBus() to release the bus.

  - When the compilation flag USE_HAL_MUTEX is set to 0 or not defined, HAL_I3C_AcquireBus() and HAL_I3C_ReleaseBus()
    are not available.
  */
/**
  * @}
  */

/** @defgroup I3C_Configuration_Table I3C Configuration Table
  * @{

## 15. Software configuration

### 15.1 Software configuration defined in stm32c5xx_hal_conf.h:
Preprocessor flags               |   Default value   | Comment
-------------------------------- | ----------------- | ------------------------------------------------
USE_HAL_I3C_MODULE               |         1         | Enable HAL I3C driver module
USE_HAL_I3C_REGISTER_CALLBACKS   |         0         | Allow user-defined callbacks
USE_HAL_I3C_DMA                  |         1         | Enable DMA code inside I3C
USE_HAL_CHECK_PARAM              |         0         | Enable runtime parameter check
USE_HAL_I3C_CLK_ENABLE_MODEL     | HAL_CLK_ENABLE_NO | Enable the gating of the peripheral clock
USE_HAL_CHECK_PROCESS_STATE      |         0         | Enable atomicity of process state check
USE_HAL_MUTEX                    |         0         | Enable semaphore creation for OS
USE_HAL_I3C_USER_DATA            |         0         | Add user data inside HAL I3C handle
USE_HAL_I3C_GET_LAST_ERRORS      |         0         | Enable retrieval of last process error codes

### 15.2 Software configuration defined in preprocessor environment:
Preprocessor flags               |   Default value   | Comment
-------------------------------- | ----------------- | ------------------------------------------------
USE_ASSERT_DBG_PARAM             |    Not defined    | Enable check param for HAL and LL
USE_ASSERT_DBG_STATE             |    Not defined    | Enable check state for HAL

  */
/**
  * @}
  */
#if defined (I3C1)
#if defined(USE_HAL_I3C_MODULE) && (USE_HAL_I3C_MODULE == 1)

/* Private typedef ---------------------------------------------------------------------------------------------------*/
/** @defgroup I3C_Private_Types I3C Private Types
  * @{
  */

/**
  * @brief Structure containing address device and message type used for
  *        the private function I3C_Ctrl_PoolForDeviceReady()
  */
typedef struct
{
  uint8_t address; /*!< Dynamic or Static target Address */
  uint32_t message_type; /*!< Message Type */
} i3c_device_t;

/**
  * @}
  */

/* Private define ----------------------------------------------------------------------------------------------------*/
/** @defgroup I3C_Private_Constants I3C Private Constants
  * @{
  */

/* Private defines for control buffer prior preparation */
#define I3C_OPERATION_TYPE_MASK     I3C_CR_MTYPE         /*!< Mask can be combined with hal_i3c_transfer_mode_t */
#define I3C_RESTART_STOP_MASK       LL_I3C_GENERATE_STOP /*!< Mask can be combined with hal_i3c_transfer_mode_t */
#define I3C_ARBITRATION_HEADER_MASK I3C_CFGR_NOARBH      /*!< Mask can be combined with hal_i3c_transfer_mode_t */
#define I3C_DEFINE_BYTE_MASK        LL_I3C_DEFINE_BYTE   /*!< Mask can be combined with hal_i3c_transfer_mode_t */

/* Private defines for listen mode control */
#define I3C_LISTEN_DISABLED  (0U) /*!< Listen mode disabled */
#define I3C_LISTEN_ENABLED   (1U) /*!< Listen mode enabled */

/* Private defines for Transfer max size in interrupt mode */
#define I3C_TRANSFER_MAX_BYTE   (16U) /*!< 2 * FIFO size in byte */
#define I3C_TRANSFER_MAX_WORD   (4U)  /*!< 2 * FIFO size in word */

#define I3C_DEFAULT_TIMEOUT_MS  (25U) /*!< 25 ms */

/**
  * @brief I3C timing register 1 (I3C_TIMINGR1) valid bit mask
  */
#define I3C_TIMINGR1_VALID_MSK (I3C_TIMINGR1_AVAL_Msk |\
                                I3C_TIMINGR1_ASNCR_Msk | I3C_TIMINGR1_FREE_Msk | I3C_TIMINGR1_SDA_HD_Msk)

/**
  * @}
  */

/* Private macro -----------------------------------------------------------------------------------------------------*/
/** @defgroup I3C_Private_Macros I3C Private Macros
  * @{
  */

/**
  * @brief Validate ENTDAA option.
  * @param OPTION Value to test (HAL_I3C_DYN_ADDR_RSTDAA_THEN_ENTDAA or HAL_I3C_DYN_ADDR_ONLY_ENTDAA).
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_ENTDAA_OPTION(OPTION) (((OPTION) == HAL_I3C_DYN_ADDR_RSTDAA_THEN_ENTDAA) \
                                      || ((OPTION) == HAL_I3C_DYN_ADDR_ONLY_ENTDAA))

/**
  * @brief Validate TX FIFO threshold selection.
  * @param VALUE Threshold enum (HAL_I3C_TX_FIFO_THRESHOLD_1_8 or HAL_I3C_TX_FIFO_THRESHOLD_1_2).
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_TX_FIFO_THRESHOLD(VALUE) (((VALUE) == HAL_I3C_TX_FIFO_THRESHOLD_1_8)\
                                         || ((VALUE) == HAL_I3C_TX_FIFO_THRESHOLD_1_2))

/**
  * @brief Validate RX FIFO threshold selection.
  * @param VALUE Threshold enum (HAL_I3C_RX_FIFO_THRESHOLD_1_8 or HAL_I3C_RX_FIFO_THRESHOLD_1_2).
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_RX_FIFO_THRESHOLD(VALUE) (((VALUE) == HAL_I3C_RX_FIFO_THRESHOLD_1_8) \
                                         || ((VALUE) == HAL_I3C_RX_FIFO_THRESHOLD_1_2))

/**
  * @brief Validate controller FIFO mode mask.
  * @param CONTROLFIFO One of HAL_I3C_CTRL_FIFO_* values.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_CTRL_FIFO(CONTROLFIFO) (((CONTROLFIFO) == HAL_I3C_CTRL_FIFO_NONE) \
                                       || ((CONTROLFIFO) == HAL_I3C_CTRL_FIFO_CONTROL_ONLY) \
                                       || ((CONTROLFIFO) == HAL_I3C_CTRL_FIFO_STATUS_ONLY) \
                                       || ((CONTROLFIFO) == HAL_I3C_CTRL_FIFO_ALL))

/**
  * @brief Validate number of devices to configure.
  * @param VALUE Device count (1..4).
  * @retval 1 if in range, 0 otherwise.
  */
#define IS_I3C_DEVICE(VALUE) (((VALUE) >= 1U) && ((VALUE) <= 4U))

/**
  * @brief Validate device index.
  * @param VALUE Index (0..3).
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_DEVICE_INDEX(VALUE) ((VALUE) <= 3U)

/**
  * @brief Validate dynamic address value.
  * @param VALUE 7-bit dynamic address (0x00..0x7F).
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_DYNAMIC_ADDRESS(VALUE) ((VALUE) <= 0x7FU)

/**
  * @brief Validate handoff activity state.
  * @param VALUE One of HAL_I3C_HANDOFF_ACTIVITY_STATE_{0..3}.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_HANDOFF_ACTIVITY_STATE(VALUE) (((VALUE) == HAL_I3C_HANDOFF_ACTIVITY_STATE_0) \
                                              || ((VALUE) == HAL_I3C_HANDOFF_ACTIVITY_STATE_1) \
                                              || ((VALUE) == HAL_I3C_HANDOFF_ACTIVITY_STATE_2) \
                                              || ((VALUE) == HAL_I3C_HANDOFF_ACTIVITY_STATE_3))

/**
  * @brief Validate TSCO turnaround time selection.
  * @param VALUE HAL_I3C_TURNAROUND_TIME_TSCO_* value.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_TSCO_TIME(VALUE) (((VALUE) == HAL_I3C_TURNAROUND_TIME_TSCO_LESS_12NS) \
                                 || ((VALUE) == HAL_I3C_TURNAROUND_TIME_TSCO_GREATER_12NS))

/**
  * @brief Validate GETMXDS format value.
  * @param VALUE Format enum HAL_I3C_GETMXDS_FORMAT_*.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_MAX_SPEED_DATA(VALUE) (((VALUE) == HAL_I3C_GETMXDS_FORMAT_1    ) \
                                      || ((VALUE) == HAL_I3C_GETMXDS_FORMAT_2_LSB) \
                                      || ((VALUE) == HAL_I3C_GETMXDS_FORMAT_2_MID) \
                                      || ((VALUE) == HAL_I3C_GETMXDS_FORMAT_2_MSB))

/**
  * @brief Validate IBI payload size.
  * @param VALUE HAL_I3C_TGT_PAYLOAD_* size selection.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_IBI_PAYLOAD_SIZE(VALUE) (((VALUE) == HAL_I3C_TGT_PAYLOAD_EMPTY  ) \
                                        || ((VALUE) == HAL_I3C_TGT_PAYLOAD_1_BYTE ) \
                                        || ((VALUE) == HAL_I3C_TGT_PAYLOAD_2_BYTE) \
                                        || ((VALUE) == HAL_I3C_TGT_PAYLOAD_3_BYTE) \
                                        || ((VALUE) == HAL_I3C_TGT_PAYLOAD_4_BYTE))

/**
  * @brief Validate MIPI identifier nibble.
  * @param VALUE 0x0..0xF.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_MIPI_IDENTIFIER(VALUE) ((VALUE) <= 0x0FU)

/**
  * @brief Test if interrupt source bit(s) are set.
  * @param IER Interrupt enable register value.
  * @param IT Mask to test.
  * @retval 1 if all bits set, 0 otherwise.
  */
#define I3C_CHECK_IT_SOURCE(IER, IT)  ((((IER) & (IT)) == (IT)) ? 1U : 0U)

/**
  * @brief Test if flag bit(s) are set.
  * @param ISR Flag/status register value.
  * @param FLAG Mask to test.
  * @retval 1 if all bits set, 0 otherwise.
  */
#define I3C_CHECK_FLAG(ISR, FLAG) ((((ISR) & (FLAG)) == (FLAG)) ? 1U : 0U)

/**
  * @brief Validate DMA source width is byte.
  * @param VALUE Expected HAL_DMA_SRC_DATA_WIDTH_BYTE.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_DMA_SOURCE_BYTE(VALUE) ((VALUE) == HAL_DMA_SRC_DATA_WIDTH_BYTE)

/**
  * @brief Validate DMA source width is word.
  * @param VALUE Expected HAL_DMA_SRC_DATA_WIDTH_WORD.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_DMA_SOURCE_WORD(VALUE) ((VALUE) == HAL_DMA_SRC_DATA_WIDTH_WORD)

/**
  * @brief Validate DMA destination width is byte.
  * @param VALUE Expected HAL_DMA_DEST_DATA_WIDTH_BYTE.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_DMA_DESTINATION_BYTE(VALUE) ((VALUE) == HAL_DMA_DEST_DATA_WIDTH_BYTE)

/**
  * @brief Validate DMA destination width is word.
  * @param VALUE Expected HAL_DMA_DEST_DATA_WIDTH_WORD.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_DMA_DESTINATION_WORD(VALUE) ((VALUE) == HAL_DMA_DEST_DATA_WIDTH_WORD)

/**
  * @brief Validate generated pattern type.
  * @param PATTERN HAL_I3C_PATTERN_TGT_RESET or HAL_I3C_PATTERN_HDR_EXIT.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_PATTERN(PATTERN) (((PATTERN) == HAL_I3C_PATTERN_TGT_RESET) \
                                 || ((PATTERN) == HAL_I3C_PATTERN_HDR_EXIT))


/**
  * @brief Validate controller-role request status.
  * @param CTRLROLE HAL_I3C_CTRL_ROLE_DISABLED or HAL_I3C_CTRL_ROLE_ENABLED.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_CTRL_ROLE(CTRLROLE) (((CTRLROLE) == HAL_I3C_CTRL_ROLE_DISABLED) \
                                    || ((CTRLROLE) == HAL_I3C_CTRL_ROLE_ENABLED))

/**
  * @brief Validate controller-role acknowledgment configuration.
  * @param CTRLROLEACK HAL_I3C_CTRL_ROLE_ACK_DISABLED or HAL_I3C_CTRL_ROLE_ACK_ENABLED.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_CTRL_ROLE_ACK(CTRLROLEACK) (((CTRLROLEACK) == HAL_I3C_CTRL_ROLE_ACK_DISABLED) \
                                           || ((CTRLROLEACK) == HAL_I3C_CTRL_ROLE_ACK_ENABLED))

/**
  * @brief Validate IBI payload enable status.
  * @param IBIPAYLOAD HAL_I3C_IBI_PAYLOAD_DISABLED or HAL_I3C_IBI_PAYLOAD_ENABLED.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_IBI_PAYLOAD(IBIPAYLOAD) (((IBIPAYLOAD) == HAL_I3C_IBI_PAYLOAD_DISABLED) \
                                        || ((IBIPAYLOAD) == HAL_I3C_IBI_PAYLOAD_ENABLED))
/**
  * @brief Validate IBI payload enable status.
  * @param IBIPAYLOAD HAL_I3C_CTRL_IBI_PAYLOAD_DISABLED or HAL_I3C_CTRL_IBI_PAYLOAD_ENABLED.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_CTRL_IBI_PAYLOAD(IBIPAYLOAD) (((IBIPAYLOAD) == HAL_I3C_CTRL_IBI_PAYLOAD_DISABLED) \
                                             || ((IBIPAYLOAD) == HAL_I3C_CTRL_IBI_PAYLOAD_ENABLED))
/**
  * @brief Validate max speed limitation status.
  * @param MAX_SPEED HAL_I3C_MAX_SPEED_LIMITATION_DISABLED or HAL_I3C_MAX_SPEED_LIMITATION_ENABLED.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_MAX_SPEED_LIMIT(MAX_SPEED) (((MAX_SPEED) == HAL_I3C_MAX_SPEED_LIMITATION_DISABLED) \
                                           || ((MAX_SPEED) == HAL_I3C_MAX_SPEED_LIMITATION_ENABLED))

/**
  * @brief Validate stop transfer configuration.
  * @param VALUE HAL_I3C_CTRL_STOP_TRANSFER_DISABLED or HAL_I3C_CTRL_STOP_TRANSFER_ENABLED.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_CTRL_STOP_XFER(VALUE) (((VALUE) == HAL_I3C_CTRL_STOP_TRANSFER_DISABLED) \
                                      || ((VALUE) == HAL_I3C_CTRL_STOP_TRANSFER_ENABLED))

/**
  * @brief Validate IBI ACK enable status.
  * @param IBI HAL_I3C_CTRL_IBI_ACK_DISABLED or HAL_I3C_CTRL_IBI_ACK_ENABLED.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_CTRL_IBI_ACK(IBI) (((IBI) == HAL_I3C_CTRL_IBI_ACK_DISABLED) \
                                  || ((IBI) == HAL_I3C_CTRL_IBI_ACK_ENABLED))

/**
  * @brief Validate pending read MDB enable status.
  * @param PENDING_READ HAL_I3C_PENDING_READ_MDB_DISABLED or HAL_I3C_PENDING_READ_MDB_ENABLED.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_PENDING_READ(PENDING_READ) (((PENDING_READ) == HAL_I3C_PENDING_READ_MDB_DISABLED) \
                                           || ((PENDING_READ) == HAL_I3C_PENDING_READ_MDB_ENABLED))

/**
  * @brief Validate private transfer mode selection.
  * @param MODE One HAL_I3C_PRIVATE / HAL_I2C_PRIVATE mode enum.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_PRIVATE_MODE(MODE) (((MODE) == HAL_I3C_PRIVATE_WITH_ARB_STOP)                 \
                                   || ((MODE) == HAL_I3C_PRIVATE_WITHOUT_ARB_RESTART)        \
                                   || ((MODE) == HAL_I3C_PRIVATE_WITHOUT_ARB_STOP)           \
                                   || ((MODE) == HAL_I2C_PRIVATE_WITH_ARB_RESTART)           \
                                   || ((MODE) == HAL_I2C_PRIVATE_WITH_ARB_STOP)              \
                                   || ((MODE) == HAL_I2C_PRIVATE_WITHOUT_ARB_RESTART)        \
                                   || ((MODE) == HAL_I2C_PRIVATE_WITHOUT_ARB_STOP))

/**
  * @brief Validate CCC transfer mode selection.
  * @param MODE One HAL_I3C_CCC_* mode enum.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_CCC_MODE(MODE) (((MODE) == HAL_I3C_CCC_DIRECT_WITH_DEFBYTE_RESTART)           \
                               || ((MODE) == HAL_I3C_CCC_DIRECT_WITH_DEFBYTE_STOP)           \
                               || ((MODE) == HAL_I3C_CCC_DIRECT_WITHOUT_DEFBYTE_RESTART)     \
                               || ((MODE) == HAL_I3C_CCC_DIRECT_WITHOUT_DEFBYTE_STOP)        \
                               || ((MODE) == HAL_I3C_CCC_BROADCAST_WITH_DEFBYTE_RESTART)     \
                               || ((MODE) == HAL_I3C_CCC_BROADCAST_WITH_DEFBYTE_STOP)        \
                               || ((MODE) == HAL_I3C_CCC_BROADCAST_WITHOUT_DEFBYTE_RESTART)  \
                               || ((MODE) == HAL_I3C_CCC_BROADCAST_WITHOUT_DEFBYTE_STOP))


/**
  * @brief Validate transfer direction for private/direct CCC.
  * @param DIRECTION HAL_I3C_DIRECTION_WRITE or HAL_I3C_DIRECTION_READ.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_DIRECTION(DIRECTION) (((DIRECTION) == HAL_I3C_DIRECTION_WRITE) \
                                     || ((DIRECTION) == HAL_I3C_DIRECTION_READ))


/**
  * @brief Validate direction for broadcast CCC (must be write).
  * @param DIRECTION Expected HAL_I3C_DIRECTION_WRITE.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_DIRECTION_CCC_BROADCAST(DIRECTION) ((DIRECTION) == HAL_I3C_DIRECTION_WRITE)

/**
  * @brief Validate controller notification mask.
  * @param VALUE Combination of I3C_CTRL_NOTIFICATION.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_CTRL_NOTIFICATIONS(VALUE) (((VALUE) & ~HAL_I3C_CTRL_NOTIFICATION_ALL) == 0U)

/**
  * @brief Validate target notification mask.
  * @param VALUE Combination of I3C_TGT_NOTIFICATION.
  * @retval 1 if valid, 0 otherwise.
  */
#define IS_I3C_TGT_NOTIFICATIONS(VALUE) (((VALUE) & ~HAL_I3C_TGT_NOTIFICATION_ALL) == 0U)


/**
  * @brief Get CMSIS peripheral instance from HAL handle.
  * @param handle Pointer to @ref hal_i3c_handle_t.
  * @retval I3C_TypeDef* Peripheral base address.
  */
#define I3C_GET_INSTANCE(handle) ((I3C_TypeDef *)((uint32_t)((handle)->instance)))
/**
  * @}
  */

/* Private function prototypes ---------------------------------------------------------------------------------------*/
/** @defgroup I3C_Private_Functions I3C Private Functions
  * @{
  */
static hal_status_t I3C_Tgt_Event_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks);
static hal_status_t I3C_Ctrl_Event_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks);
static hal_status_t I3C_Tgt_Tx_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks);
static hal_status_t I3C_Tgt_Rx_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks);
#if defined(USE_HAL_I3C_DMA) && (USE_HAL_I3C_DMA == 1)
static hal_status_t I3C_Tgt_Tx_DMA_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks);
static hal_status_t I3C_Tgt_Rx_DMA_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks);
#endif /* USE_HAL_I3C_DMA */
static hal_status_t I3C_Tgt_HotJoin_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks);
static hal_status_t I3C_Tgt_CtrlRole_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks);
static hal_status_t I3C_Tgt_IBI_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks);
static hal_status_t I3C_Ctrl_Multiple_Xfer_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks);
static hal_status_t I3C_Ctrl_Multiple_Xfer_Listen_Event_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks);
#if defined(USE_HAL_I3C_DMA) && (USE_HAL_I3C_DMA == 1)
static hal_status_t I3C_Ctrl_Multiple_Xfer_DMA_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks);
#endif /* USE_HAL_I3C_DMA */
static hal_status_t I3C_Ctrl_DAA_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks);
static hal_status_t I3C_Abort_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks);
static hal_status_t I3C_WaitForFlagSet(hal_i3c_handle_t *hi3c, uint32_t flag, uint32_t timeout_ms);
static void I3C_TransmitByteTreatment(hal_i3c_handle_t *hi3c);
static void I3C_TransmitByteTreatment_IT(hal_i3c_handle_t *hi3c);
static void I3C_TransmitWordTreatment(hal_i3c_handle_t *hi3c);
static void I3C_TransmitWordTreatment_IT(hal_i3c_handle_t *hi3c);
static void I3C_ReceiveByteTreatment(hal_i3c_handle_t *hi3c);
static void I3C_ReceiveByteTreatment_IT(hal_i3c_handle_t *hi3c);
static void I3C_ReceiveWordTreatment(hal_i3c_handle_t *hi3c);
static void I3C_ReceiveWordTreatment_IT(hal_i3c_handle_t *hi3c);
static void I3C_ControlDataTreatment(hal_i3c_handle_t *hi3c);
static void I3C_ErrorTreatment(hal_i3c_handle_t *hi3c);
#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
static void I3C_GetErrorSources(hal_i3c_handle_t *hi3c);
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */

static void I3C_StateIdle(hal_i3c_handle_t *hi3c);
#if defined(USE_HAL_I3C_DMA) && (USE_HAL_I3C_DMA == 1)
static void I3C_DMAAbort(hal_dma_handle_t *hdma);
static void I3C_DMAControlTransmitCplt(hal_dma_handle_t *hdma);
static void I3C_DMADataTransmitCplt(hal_dma_handle_t *hdma);
static void I3C_DMADataReceiveCplt(hal_dma_handle_t *hdma);
static void I3C_DMAError(hal_dma_handle_t *hdma);
static uint32_t I3C_RoundUp4(uint32_t size_byte);
#endif /* USE_HAL_I3C_DMA */
static hal_status_t I3C_Ctrl_PoolForDeviceReady(hal_i3c_handle_t *hi3c, const i3c_device_t *p_device,
                                                uint32_t timeout_ms);
static void I3C_TreatErrorCallback(hal_i3c_handle_t *hi3c);

/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup I3C_Exported_Functions
  * @{
  */

/** @addtogroup I3C_Exported_Functions_Group1 Initialization and de-initialization functions
  * @{
A set of functions that allow initialization and deinitialization of the I3Cx peripheral:
 - HAL_I3C_Init(): initialize the selected device with the I3C instance.
 - HAL_I3C_DeInit(): disable the peripheral.
  */

/**
  * @brief  Initialize the I3C according to the associated handle.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  instance  HAL I3C instance
  * @retval HAL_OK  HAL I3C instance has been correctly initialized.
  * @retval HAL_INVALID_PARAM  HAL I3C instance is NULL
  * @retval HAL_ERROR  HAL I3C semaphore creation is failed (USE_HAL_MUTEX is Set to 1)
  */
hal_status_t HAL_I3C_Init(hal_i3c_handle_t *hi3c, hal_i3c_t instance)
{

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(IS_I3C_ALL_INSTANCE((I3C_TypeDef *)((uint32_t)instance)));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hi3c == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi3c->instance = instance;

#if defined(USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
  /* Set I3C Callbacks to the weak function */
  hi3c->p_ctrl_transfer_cplt_cb = HAL_I3C_CTRL_TransferCpltCallback;
  hi3c->p_ctrl_daa_cplt_cb = HAL_I3C_CTRL_DAACpltCallback;
  hi3c->p_ctrl_tgt_req_dyn_addr_cb = HAL_I3C_CTRL_TgtReqDynAddrCallback;
  hi3c->p_tgt_tx_cplt_cb = HAL_I3C_TGT_TxCpltCallback;
  hi3c->p_tgt_rx_cplt_cb = HAL_I3C_TGT_RxCpltCallback;
  hi3c->p_tgt_hot_join_cb = HAL_I3C_TGT_HotJoinCallback;
  hi3c->p_notify_cb = HAL_I3C_NotifyCallback;
  hi3c->p_error_cb = HAL_I3C_ErrorCallback;
  hi3c->p_abort_cplt_cb = HAL_I3C_AbortCpltCallback;
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */

  hi3c->mode = HAL_I3C_MODE_NONE;
  hi3c->listen = I3C_LISTEN_DISABLED;

#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
  hi3c->last_error_codes = HAL_I3C_ERROR_NONE;
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */

