MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
#if defined(USE_HAL_I3C_DMA) && (USE_HAL_I3C_DMA == 1)
  hi3c->hdma_tx = (hal_dma_handle_t *) NULL;
  hi3c->hdma_rx = (hal_dma_handle_t *) NULL;
  hi3c->hdma_tc = (hal_dma_handle_t *) NULL;
#endif /* USE_HAL_I3C_DMA */

#if defined(USE_HAL_I3C_USER_DATA) && (USE_HAL_I3C_USER_DATA == 1)
  hi3c->p_user_data = (void *) NULL;
#endif /* USE_HAL_I3C_USER_DATA */

#if defined(USE_HAL_I3C_CLK_ENABLE_MODEL) && (USE_HAL_I3C_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  /* Enable I3C1 Clock */
  HAL_RCC_I3C1_EnableClock();
#endif /* USE_HAL_I3C_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  if (HAL_OS_SemaphoreCreate(&hi3c->semaphore) != HAL_OS_OK)
  {
    return HAL_ERROR;
  }
#endif /* USE_HAL_MUTEX */

  /* Update I3C state */
  hi3c->global_state = HAL_I3C_STATE_INIT;

  return HAL_OK;
}

/**
  * @brief  Deinitialize the HAL I3C driver for the given handle and disable the peripheral.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t structure
  */
void HAL_I3C_DeInit(hal_i3c_handle_t *hi3c)
{
  I3C_TypeDef *p_i3cx;

  ASSERT_DBG_PARAM(hi3c != NULL);
  p_i3cx = I3C_GET_INSTANCE(hi3c);
  ASSERT_DBG_PARAM(IS_I3C_ALL_INSTANCE(p_i3cx));

  LL_I3C_Disable(p_i3cx);

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  (void) HAL_OS_SemaphoreDelete(&hi3c->semaphore);
#endif /* USE_HAL_MUTEX */

  hi3c->global_state = HAL_I3C_STATE_RESET;
}

/**
  * @}
  */

/** @addtogroup I3C_Exported_Functions_Group2 Configuration functions
  * @{
A set of functions that allow configuration of the I3Cx peripheral:

- Global configuration (controller):
  - HAL_I3C_CTRL_SetConfig()
  - HAL_I3C_CTRL_GetConfig()

- Global configuration (target):
  - HAL_I3C_TGT_SetConfig()
  - HAL_I3C_TGT_GetConfig()

- Payload ENTDAA configuration (target):
  - HAL_I3C_TGT_SetPayloadENTDAAConfig()
  - HAL_I3C_TGT_GetPayloadENTDAAConfig()

- FIFO configuration (target):
  - HAL_I3C_TGT_SetConfigFifo()
  - HAL_I3C_TGT_GetConfigFifo()

- FIFO configuration (controller):
  - HAL_I3C_CTRL_SetConfigFifo()
  - HAL_I3C_CTRL_GetConfigFifo()

- FIFO configuration unitary functions:
  - HAL_I3C_SetRxFifoThreshold()
  - HAL_I3C_GetRxFifoThreshold()
  - HAL_I3C_SetTxFifoThreshold()
  - HAL_I3C_GetTxFifoThreshold()
  - HAL_I3C_CTRL_EnableControlFifo()
  - HAL_I3C_CTRL_DisableControlFifo()
  - HAL_I3C_CTRL_IsEnabledControlFifo()
  - HAL_I3C_CTRL_EnableStatusFifo()
  - HAL_I3C_CTRL_DisableStatusFifo()
  - HAL_I3C_CTRL_IsEnabledStatusFifo()

- Own dynamic address (controller):
  - HAL_I3C_CTRL_SetConfigOwnDynamicAddress()
  - HAL_I3C_CTRL_GetConfigOwnDynamicAddress()

- Hot-Join allowed (controller):
  - HAL_I3C_CTRL_EnableHotJoinAllowed()
  - HAL_I3C_CTRL_DisableHotJoinAllowed()
  - HAL_I3C_CTRL_IsEnabledHotJoinAllowed()

- High keeper SDA configuration (controller):
  - HAL_I3C_CTRL_EnableHighKeeperSDA()
  - HAL_I3C_CTRL_DisableHighKeeperSDA()
  - HAL_I3C_CTRL_IsEnabledHighKeeperSDA()

- Stall time configuration (controller):
  - HAL_I3C_CTRL_SetConfigStallTime()
  - HAL_I3C_CTRL_GetConfigStallTime()

- Controller-Role request configuration (target):
  - HAL_I3C_TGT_EnableCtrlRoleRequest()
  - HAL_I3C_TGT_DisableCtrlRoleRequest()
  - HAL_I3C_TGT_IsEnabledCtrlRoleRequest()

- Group management support configuration (target):
  - HAL_I3C_TGT_EnableGroupAddrCapability()
  - HAL_I3C_TGT_DisableGroupAddrCapability()
  - HAL_I3C_TGT_IsEnabledGroupAddrCapability()

- Hot-Join configuration (target):
  - HAL_I3C_TGT_EnableHotJoinRequest()
  - HAL_I3C_TGT_DisableHotJoinRequest()
  - HAL_I3C_TGT_IsEnabledHotJoinRequest()

- In-Band Interrupt configuration (target):
  - HAL_I3C_TGT_SetConfigIBI()
  - HAL_I3C_TGT_GetConfigIBI()
  - HAL_I3C_TGT_EnableIBI()
  - HAL_I3C_TGT_DisableIBI()
  - HAL_I3C_TGT_IsEnabledIBI()

- Max data size configuration (target):
  - HAL_I3C_TGT_SetConfigMaxDataSize()
  - HAL_I3C_TGT_GetConfigMaxDataSize()

- GET MaX Data Speed (GETMXDS) configuration (target):
  - HAL_I3C_TGT_SetConfigGETMXDS()
  - HAL_I3C_TGT_GetConfigGETMXDS()
  - HAL_I3C_TGT_SetConfigGETMXDS_Format()
  - HAL_I3C_TGT_GetConfigGETMXDS_Format()
  - HAL_I3C_TGT_SetConfigCtrlHandOffActivity()
  - HAL_I3C_TGT_GetConfigCtrlHandOffActivity()

- Bus device configuration in DEVRX[] (controller):
  - HAL_I3C_CTRL_SetConfigBusDevices()
  - HAL_I3C_CTRL_GetConfigBusDevices()

- Reset pattern configuration (Controller):
  - HAL_I3C_CTRL_EnableResetPattern()
  - HAL_I3C_CTRL_DisableResetPattern()
  - HAL_I3C_CTRL_IsEnabledResetPattern()
  */

/**
  * @brief  Configure the I3C as controller.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_config  Pointer to the configuration structure
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_CTRL_SetConfig(hal_i3c_handle_t *hi3c, const hal_i3c_ctrl_config_t *p_config)
{
  I3C_TypeDef *p_i3cx;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM((p_config->timing_reg1 & ~I3C_TIMINGR1_VALID_MSK) == 0);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_INIT | HAL_I3C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_i3cx = I3C_GET_INSTANCE(hi3c);
  LL_I3C_Disable(p_i3cx);
  LL_I3C_SetMode(p_i3cx, LL_I3C_MODE_CONTROLLER);
  hi3c->mode = HAL_I3C_MODE_CTRL;

  /* SCL signal waveform configuration: I3C timing register 0 (I3C_TIMINGR0) */
  LL_I3C_ConfigClockWaveForm(p_i3cx, p_config->timing_reg0);

  /* Timing configuration: I3C timing register 1 (I3C_TIMINGR1) */
  LL_I3C_SetBusCharacteristic(p_i3cx, p_config->timing_reg1);

  LL_I3C_Enable(p_i3cx);
  hi3c->global_state = HAL_I3C_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Retrieve the I3C controller configuration.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_config  Pointer to the configuration structure
  */
void HAL_I3C_CTRL_GetConfig(const hal_i3c_handle_t *hi3c, hal_i3c_ctrl_config_t *p_config)
{
  I3C_TypeDef *p_i3cx;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

