MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
  p_i3cx = I3C_GET_INSTANCE(hi3c);
  p_config->timing_reg0 = LL_I3C_GetClockWaveForm(p_i3cx);
  p_config->timing_reg1 = LL_I3C_GetBusCharacteristic(p_i3cx);
}

/**
  * @brief  Configure the I3C as target.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_config  Pointer to the configuration structure
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_TGT_SetConfig(hal_i3c_handle_t *hi3c, const hal_i3c_tgt_config_t *p_config)
{
  I3C_TypeDef *p_i3cx;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM((p_config->timing_reg1 & ~I3C_TIMINGR1_VALID_MSK) == 0);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_INIT | HAL_I3C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_i3cx = I3C_GET_INSTANCE(hi3c);
  LL_I3C_Disable(p_i3cx);
  LL_I3C_SetMode(p_i3cx, LL_I3C_MODE_TARGET);
  hi3c->mode = HAL_I3C_MODE_TGT;

  /* Timing configuration: I3C timing register 1 (I3C_TIMINGR1) */
  LL_I3C_SetBusCharacteristic(p_i3cx, p_config->timing_reg1);

  LL_I3C_Enable(p_i3cx);
  hi3c->global_state = HAL_I3C_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Retrieve the I3C target configuration.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_config  Pointer to the configuration structure
  */
void HAL_I3C_TGT_GetConfig(const hal_i3c_handle_t *hi3c, hal_i3c_tgt_config_t *p_config)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  p_config->timing_reg1 = LL_I3C_GetBusCharacteristic(I3C_GET_INSTANCE(hi3c));
}

/**
  * @brief  Set payload ENTDAA configuration.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_config  Pointer to the configuration structure
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_TGT_SetPayloadENTDAAConfig(const hal_i3c_handle_t *hi3c,
                                                const hal_i3c_tgt_config_payload_entdaa_t *p_config)
{
  I3C_TypeDef *p_i3cx;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_I3C_MIPI_IDENTIFIER(p_config->mipi_identifier));
  ASSERT_DBG_PARAM(IS_I3C_CTRL_ROLE(p_config->ctrl_role));
  ASSERT_DBG_PARAM(IS_I3C_IBI_PAYLOAD(p_config->ibi_payload));
  ASSERT_DBG_PARAM(IS_I3C_MAX_SPEED_LIMIT(p_config->max_data_speed_limitation));
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_i3cx = I3C_GET_INSTANCE(hi3c);
  LL_I3C_Disable(p_i3cx);
  /* Set identifier value in DCR register */
  LL_I3C_SetDeviceCharacteristics(p_i3cx, p_config->identifier);
  /* Set MIPI identifier value in EPIDR register */
  LL_I3C_SetMIPIInstanceID(p_i3cx, p_config->mipi_identifier);
  /* Set control capability, IBI payload support and max speed limitation in BCR register */
  LL_I3C_ConfigPayloadEntDAA(p_i3cx, (uint32_t) p_config->max_data_speed_limitation, (uint32_t) p_config->ibi_payload,
                             (uint32_t) p_config->ctrl_role);
  LL_I3C_Enable(p_i3cx);

  return HAL_OK;
}

/**
  * @brief  Retrieve payload ENTDAA configuration.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_config  Pointer to the configuration structure
  */
void HAL_I3C_TGT_GetPayloadENTDAAConfig(const hal_i3c_handle_t *hi3c, hal_i3c_tgt_config_payload_entdaa_t *p_config)
{
  uint32_t bcr_value;
  I3C_TypeDef *p_i3cx;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);
  /* Get identifier value in DCR register */
  p_i3cx = I3C_GET_INSTANCE(hi3c);
  p_config->identifier = (uint8_t) LL_I3C_GetDeviceCharacteristics(p_i3cx);
  /* Get MIPI identifier value in EPIDR register */
  p_config->mipi_identifier = (uint8_t) LL_I3C_GetMIPIInstanceID(p_i3cx);

  bcr_value = LL_I3C_GetRegister_BCR(I3C_GET_INSTANCE(hi3c));
  p_config->max_data_speed_limitation = HAL_I3C_GET_MAX_DATA_SPEED_LIMIT(bcr_value);
  p_config->ibi_payload = HAL_I3C_GET_IBI_PAYLOAD(bcr_value);
  p_config->ctrl_role = HAL_I3C_GET_CTRL_ROLE_CAPABLE(bcr_value);
}

/**
  * @brief  Set FIFO configuration when the I3C is acting as controller.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_config  Pointer to the configuration structure
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_CTRL_SetConfigFifo(const hal_i3c_handle_t *hi3c, const hal_i3c_ctrl_fifo_config_t *p_config)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_I3C_RX_FIFO_THRESHOLD(p_config->rx_fifo_threshold));
  ASSERT_DBG_PARAM(IS_I3C_TX_FIFO_THRESHOLD(p_config->tx_fifo_threshold));
  ASSERT_DBG_PARAM(IS_I3C_CTRL_FIFO(p_config->ctrl_fifo));
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  LL_I3C_ConfigCtrlFifo(I3C_GET_INSTANCE(hi3c), (uint32_t)p_config->tx_fifo_threshold,
                        (uint32_t)p_config->rx_fifo_threshold, (uint32_t)p_config->ctrl_fifo);

  return HAL_OK;
}

/**
  * @brief  Set FIFO configuration when the I3C is acting as target.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_config  Pointer to the configuration structure
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_TGT_SetConfigFifo(const hal_i3c_handle_t *hi3c, const hal_i3c_tgt_fifo_config_t *p_config)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_I3C_RX_FIFO_THRESHOLD(p_config->rx_fifo_threshold));
  ASSERT_DBG_PARAM(IS_I3C_TX_FIFO_THRESHOLD(p_config->tx_fifo_threshold));
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  LL_I3C_ConfigTgtFifo(I3C_GET_INSTANCE(hi3c), (uint32_t)p_config->tx_fifo_threshold,
                       (uint32_t)p_config->rx_fifo_threshold);

  return HAL_OK;
}

/**
  * @brief  Retrieve FIFO configuration when the I3C is acting as controller.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_config  Pointer to the configuration structure
  */
void HAL_I3C_CTRL_GetConfigFifo(const hal_i3c_handle_t *hi3c, hal_i3c_ctrl_fifo_config_t *p_config)
{
  I3C_TypeDef *p_i3cx;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

