MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
  p_i3cx = I3C_GET_INSTANCE(hi3c);
  p_config->ctrl_fifo = (hal_i3c_ctrl_fifo_t) LL_I3C_GetCtrlFifo(p_i3cx);
  p_config->tx_fifo_threshold = (hal_i3c_tx_fifo_threshold_t) LL_I3C_GetTxFIFOThreshold(p_i3cx);
  p_config->rx_fifo_threshold = (hal_i3c_rx_fifo_threshold_t) LL_I3C_GetRxFIFOThreshold(p_i3cx);
}

/**
  * @brief  Retrieve FIFO configuration when the I3C is acting as target.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_config  Pointer to the configuration structure
  */
void HAL_I3C_TGT_GetConfigFifo(const hal_i3c_handle_t *hi3c, hal_i3c_tgt_fifo_config_t *p_config)
{
  I3C_TypeDef *p_i3cx;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  p_i3cx = I3C_GET_INSTANCE(hi3c);
  p_config->tx_fifo_threshold = (hal_i3c_tx_fifo_threshold_t) LL_I3C_GetTxFIFOThreshold(p_i3cx);
  p_config->rx_fifo_threshold = (hal_i3c_rx_fifo_threshold_t) LL_I3C_GetRxFIFOThreshold(p_i3cx);
}

/**
  * @brief  Set the Receive FIFO Threshold level configuration.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  threshold the Rx FIFO threshold
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_SetRxFifoThreshold(const hal_i3c_handle_t *hi3c, const hal_i3c_rx_fifo_threshold_t threshold)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(IS_I3C_RX_FIFO_THRESHOLD(threshold));
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  LL_I3C_SetRxFIFOThreshold(I3C_GET_INSTANCE(hi3c), (uint32_t)threshold);

  return HAL_OK;
}

/**
  * @brief  Get the receive FIFO threshold level configuration.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_I3C_RX_FIFO_THRESHOLD_1_8  Rx Fifo Threshold is 1 byte.
  * @retval HAL_I3C_RX_FIFO_THRESHOLD_1_2  Rx Fifo Threshold is 4 bytes.
  */
hal_i3c_rx_fifo_threshold_t HAL_I3C_GetRxFifoThreshold(const hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  return (hal_i3c_rx_fifo_threshold_t) LL_I3C_GetRxFIFOThreshold(I3C_GET_INSTANCE(hi3c));
}

/**
  * @brief  Set the TX FIFO Threshold level configuration.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  threshold the Tx FIFO threshold
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_SetTxFifoThreshold(const hal_i3c_handle_t *hi3c, const hal_i3c_tx_fifo_threshold_t threshold)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(IS_I3C_TX_FIFO_THRESHOLD(threshold));
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  LL_I3C_SetTxFIFOThreshold(I3C_GET_INSTANCE(hi3c), (uint32_t)threshold);

  return HAL_OK;
}

/**
  * @brief  Get the TX FIFO Threshold level configuration.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_I3C_TX_FIFO_THRESHOLD_1_8  Tx Fifo Threshold is 1 byte
  * @retval HAL_I3C_TX_FIFO_THRESHOLD_1_2  Tx Fifo Threshold is 4 bytes
  */
hal_i3c_tx_fifo_threshold_t HAL_I3C_GetTxFifoThreshold(const hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  return (hal_i3c_tx_fifo_threshold_t)LL_I3C_GetTxFIFOThreshold(I3C_GET_INSTANCE(hi3c));
}

/**
  * @brief  Enable the Control FIFO.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_CTRL_EnableControlFifo(hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  LL_I3C_EnableControlFIFO(I3C_GET_INSTANCE(hi3c));

  return HAL_OK;
}

/**
  * @brief  Disable the Control FIFO.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_CTRL_DisableControlFifo(hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  LL_I3C_DisableControlFIFO(I3C_GET_INSTANCE(hi3c));

  return HAL_OK;
}

/**
  * @brief  Check if the Control FIFO is enabled.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_I3C_CONTROL_FIFO_DISABLED  Control FIFO mode disabled
  * @retval HAL_I3C_CONTROL_FIFO_ENABLED   Control FIFO mode enabled
  */
hal_i3c_control_fifo_status_t HAL_I3C_CTRL_IsEnabledControlFifo(const hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  return (hal_i3c_control_fifo_status_t) LL_I3C_IsEnabledControlFIFO(I3C_GET_INSTANCE(hi3c));
}

/**
  * @brief  Enable the Status FIFO.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_CTRL_EnableStatusFifo(hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  LL_I3C_EnableStatusFIFO(I3C_GET_INSTANCE(hi3c));

  return HAL_OK;
}

/**
  * @brief  Disable the Status FIFO.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_CTRL_DisableStatusFifo(hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  LL_I3C_DisableStatusFIFO(I3C_GET_INSTANCE(hi3c));

  return HAL_OK;
}

/**
  * @brief  Check if the Status FIFO is enabled.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_I3C_STATUS_FIFO_DISABLED  Status FIFO mode disabled
  * @retval HAL_I3C_STATUS_FIFO_ENABLED   Status FIFO mode enabled
  */
hal_i3c_status_fifo_status_t HAL_I3C_CTRL_IsEnabledStatusFifo(const hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  return (hal_i3c_status_fifo_status_t) LL_I3C_IsEnabledStatusFIFO(I3C_GET_INSTANCE(hi3c));
}

/**
  * @brief  Set dynamic address value.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  dynamic_address  Dynamic address
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_CTRL_SetConfigOwnDynamicAddress(hal_i3c_handle_t *hi3c, uint32_t dynamic_address)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(IS_I3C_DYNAMIC_ADDRESS(dynamic_address));
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  LL_I3C_SetAndEnableOwnDynamicAddress(I3C_GET_INSTANCE(hi3c), dynamic_address);

  return HAL_OK;
}

/**
  * @brief  Get dynamic address value.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval The dynamic address
  */
uint32_t HAL_I3C_CTRL_GetConfigOwnDynamicAddress(const hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  return (LL_I3C_GetOwnDynamicAddress(I3C_GET_INSTANCE(hi3c)));
}

/**
  * @brief  Enable Hot-Join request acknowledgement allowed.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_CTRL_EnableHotJoinAllowed(hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

