MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
  LL_I3C_EnableHJAck(I3C_GET_INSTANCE(hi3c));

  return HAL_OK;
}

/**
  * @brief  Disable Hot-Join request acknowledgement allowed.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_CTRL_DisableHotJoinAllowed(hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  LL_I3C_DisableHJAck(I3C_GET_INSTANCE(hi3c));

  return HAL_OK;
}

/**
  * @brief  Check if the Hot-Join request acknowledgement is enabled.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_I3C_HOT_JOIN_DISABLED  Hot-Join disable
  * @retval HAL_I3C_HOT_JOIN_ENABLED   Hot-Join enable
  */
hal_i3c_hot_join_status_t HAL_I3C_CTRL_IsEnabledHotJoinAllowed(const hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  return (hal_i3c_hot_join_status_t) LL_I3C_IsEnabledHJAck(I3C_GET_INSTANCE(hi3c));
}

/**
  * @brief  Enable the high keeper SDA.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @note   This configuration will be used in place of standard Open drain Pull Up device
  *         during handoff procedures
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_CTRL_EnableHighKeeperSDA(const hal_i3c_handle_t *hi3c)
{
  I3C_TypeDef *p_i3cx;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  p_i3cx = I3C_GET_INSTANCE(hi3c);
  LL_I3C_Disable(p_i3cx);
  LL_I3C_EnableHighKeeperSDA(p_i3cx);
  LL_I3C_Enable(p_i3cx);

  return HAL_OK;
}

/**
  * @brief  Disable the high keeper SDA.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_CTRL_DisableHighKeeperSDA(const hal_i3c_handle_t *hi3c)
{
  I3C_TypeDef *p_i3cx;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  p_i3cx = I3C_GET_INSTANCE(hi3c);
  LL_I3C_Disable(p_i3cx);
  LL_I3C_DisableHighKeeperSDA(p_i3cx);
  LL_I3C_Enable(p_i3cx);

  return HAL_OK;
}

/**
  * @brief  Check if high keeper SDA is enabled.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_I3C_HIGH_KEEPER_SDA_DISABLED  The controller SDA high keeper disable
  * @retval HAL_I3C_HIGH_KEEPER_SDA_ENABLED   The controller SDA high keeper enable
  */
hal_i3c_high_keeper_sda_status_t HAL_I3C_CTRL_IsEnabledHighKeeperSDA(const hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  return (hal_i3c_high_keeper_sda_status_t) LL_I3C_IsEnabledHighKeeperSDA(I3C_GET_INSTANCE(hi3c));
}

/**
  * @brief  Set the SCL clock stalling configuration. All stall features not selected are disabled.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  stall_time_cycle Controller clock stall time in number of kernel clock cycles.
            This parameter must be a number between Min_Data=0x00 and Max_Data=0xFF.
  * @param  stall_features Features of the I3C controller to which the stall time will be applied.
            See @ref I3C_CTRL_STALL_FEATURE_DEFINITION, this parameter is a combination of the following values:
              @ref HAL_I3C_CTRL_STALL_ACK
              @ref HAL_I3C_CTRL_STALL_CCC
              @ref HAL_I3C_CTRL_STALL_TX
              @ref HAL_I3C_CTRL_STALL_RX
              @ref HAL_I3C_CTRL_STALL_I2C_ACK
              @ref HAL_I3C_CTRL_STALL_I2C_TX
              @ref HAL_I3C_CTRL_STALL_I2C_RX
              @ref HAL_I3C_CTRL_STALL_ALL
              @ref HAL_I3C_CTRL_STALL_NONE
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_CTRL_SetConfigStallTime(const hal_i3c_handle_t *hi3c, uint32_t stall_time_cycle,
                                             uint32_t stall_features)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(stall_time_cycle <= 0xFF);
  ASSERT_DBG_PARAM((stall_features & HAL_I3C_CTRL_STALL_ALL) == stall_features);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  LL_I3C_ConfigStallTime(I3C_GET_INSTANCE(hi3c), stall_time_cycle, stall_features);

  return HAL_OK;
}

/**
  * @brief  Retrieve the SCL clock stalling configuration.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  stall_time_cycle  Controller clock stall time in number of kernel clock cycles.
  *                           This parameter must be a number between Min_Data=0x00 and Max_Data=0xFF.
  * @param  stall_features  Features of the I3C controller to which the stall time is applied.
                            See @ref I3C_CTRL_STALL_FEATURE_DEFINITION,
                            this parameter is a combination of the following values:
                              @ref HAL_I3C_CTRL_STALL_ACK
                              @ref HAL_I3C_CTRL_STALL_CCC
                              @ref HAL_I3C_CTRL_STALL_TX
                              @ref HAL_I3C_CTRL_STALL_RX
                              @ref HAL_I3C_CTRL_STALL_I2C_ACK
                              @ref HAL_I3C_CTRL_STALL_I2C_TX
                              @ref HAL_I3C_CTRL_STALL_I2C_RX
                              @ref HAL_I3C_CTRL_STALL_ALL
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_CTRL_GetConfigStallTime(const hal_i3c_handle_t *hi3c, uint32_t *stall_time_cycle,
                                             uint32_t *stall_features)
{
  uint32_t timing2_value;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(stall_time_cycle != NULL);
  ASSERT_DBG_PARAM(stall_features != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((stall_time_cycle == NULL) || (stall_features == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
  /* Get value from timing 2 register */
  timing2_value = LL_I3C_GetRegister_TIMINGR2(I3C_GET_INSTANCE(hi3c));
  *stall_time_cycle = (uint32_t)(timing2_value >> I3C_TIMINGR2_STALL_Pos);
  *stall_features = timing2_value & (uint32_t) HAL_I3C_CTRL_STALL_ALL;

  return HAL_OK;
}

/**
  * @brief  Set Controller-Role Request allowed.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_TGT_EnableCtrlRoleRequest(const hal_i3c_handle_t *hi3c)
{
  I3C_TypeDef *p_i3cx;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

