MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
  p_i3cx = I3C_GET_INSTANCE(hi3c);
  p_config->ibi_payload_size_byte = (hal_i3c_tgt_payload_size_t)LL_I3C_GetConfigNbIBIAddData(p_i3cx);
  p_config->pending_read_mdb = (hal_i3c_tgt_read_mdb_status_t) LL_I3C_GetPendingReadMDB(p_i3cx);
}

/**
  * @brief  Enable IBI request.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_TGT_EnableIBI(const hal_i3c_handle_t *hi3c)
{
  I3C_TypeDef *p_i3cx;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  p_i3cx = I3C_GET_INSTANCE(hi3c);
  LL_I3C_Disable(p_i3cx);
  LL_I3C_EnableIBI(p_i3cx);
  LL_I3C_Enable(p_i3cx);

  return HAL_OK;
}

/**
  * @brief  Disable IBI request.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_TGT_DisableIBI(const hal_i3c_handle_t *hi3c)
{
  I3C_TypeDef *p_i3cx;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  p_i3cx = I3C_GET_INSTANCE(hi3c);
  LL_I3C_Disable(p_i3cx);
  LL_I3C_DisableIBI(p_i3cx);
  LL_I3C_Enable(p_i3cx);

  return HAL_OK;
}

/**
  * @brief  Check if IBI procedure is allowed or not allowed.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_I3C_TGT_IBI_DISABLED  IBI request disable
  * @retval HAL_I3C_TGT_IBI_ENABLED   IBI request enable
  */
hal_i3c_tgt_ibi_status_t HAL_I3C_TGT_IsEnabledIBI(const hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  return (hal_i3c_tgt_ibi_status_t) LL_I3C_IsEnabledIBI(I3C_GET_INSTANCE(hi3c));
}

/**
  * @brief  Set the max data size configuration.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  max_read_data_size_byte  Maximum read length the target advertises.
  *                                  This parameter must be a number between Min_Data=0x0 and Max_Data=0xFFFF.
  * @param  max_write_data_size_byte  Maximum read length the target advertises.
  *                                   This parameter must be a number between Min_Data=0x0 and Max_Data=0xFFFF.
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_TGT_SetConfigMaxDataSize(const hal_i3c_handle_t *hi3c, uint32_t  max_read_data_size_byte,
                                              uint32_t  max_write_data_size_byte)
{
  I3C_TypeDef *p_i3cx;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(max_read_data_size_byte <= 0xFFFF);
  ASSERT_DBG_PARAM(max_write_data_size_byte <= 0xFFFF);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  p_i3cx = I3C_GET_INSTANCE(hi3c);
  LL_I3C_Disable(p_i3cx);
  LL_I3C_SetMaxWriteLength(p_i3cx, max_write_data_size_byte);
  LL_I3C_SetMaxReadLength(p_i3cx, max_read_data_size_byte);
  LL_I3C_Enable(p_i3cx);

  return HAL_OK;
}

/**
  * @brief  Retrieve max data size configuration.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_max_read_data_size_byte  Pointer to maximum read length the target advertises.
  * @param  p_max_write_data_size_byte  Pointer to maximum write length the target advertises.
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_TGT_GetConfigMaxDataSize(const hal_i3c_handle_t *hi3c, uint32_t *p_max_read_data_size_byte,
                                              uint32_t *p_max_write_data_size_byte)
{
  I3C_TypeDef *p_i3cx;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_max_read_data_size_byte != NULL);
  ASSERT_DBG_PARAM(p_max_write_data_size_byte != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_max_read_data_size_byte == NULL) || (p_max_write_data_size_byte == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_i3cx = I3C_GET_INSTANCE(hi3c);
  *p_max_write_data_size_byte = LL_I3C_GetMaxWriteLength(p_i3cx);
  *p_max_read_data_size_byte = LL_I3C_GetMaxReadLength(p_i3cx);

  return HAL_OK;
}

/**
  * @brief  Set the Max Data Speed configuration response for GETMXDS CCC.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_config  Pointer to the configuration structure
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_TGT_SetConfigGETMXDS(const hal_i3c_handle_t *hi3c,
                                          const hal_i3c_tgt_getmxds_config_t *p_config)
{
  I3C_TypeDef *p_i3cx;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_I3C_MAX_SPEED_DATA(p_config->getmxds_format));
  ASSERT_DBG_PARAM(IS_I3C_HANDOFF_ACTIVITY_STATE(p_config->ctrl_handoff_activity));
  ASSERT_DBG_PARAM(IS_I3C_TSCO_TIME(p_config->data_turnaround_duration));
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_i3cx = I3C_GET_INSTANCE(hi3c);
  LL_I3C_Disable(p_i3cx);
  LL_I3C_SetConfigGETMXDS(p_i3cx,
                          (uint32_t)p_config->ctrl_handoff_activity,
                          (uint32_t)p_config->getmxds_format,
                          (uint32_t)p_config->data_turnaround_duration,
                          (uint32_t)p_config->max_read_turnaround);
  LL_I3C_Enable(p_i3cx);

  return HAL_OK;
}

/**
  * @brief  Retrieve the Max Data Speed configuration response for GETMXDS CCC.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_config  Pointer to the configuration structure
  */
void HAL_I3C_TGT_GetConfigGETMXDS(const hal_i3c_handle_t *hi3c, hal_i3c_tgt_getmxds_config_t *p_config)
{
  uint32_t getmxdsr_value;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  getmxdsr_value = LL_I3C_GetRegister_GETMXDSR(I3C_GET_INSTANCE(hi3c));

  p_config->ctrl_handoff_activity = (hal_i3c_handoff_activity_state_t)(uint32_t)(getmxdsr_value & I3C_GETMXDSR_HOFFAS);
  p_config->getmxds_format = (hal_i3c_getmxds_format_t)(uint32_t)(getmxdsr_value & I3C_GETMXDSR_FMT);
  p_config->data_turnaround_duration = (hal_i3c_turnaround_time_tsco_t)(uint32_t)(getmxdsr_value & I3C_GETMXDSR_TSCO);
  p_config->max_read_turnaround = (uint8_t)((getmxdsr_value & I3C_GETMXDSR_RDTURN) >> I3C_GETMXDSR_RDTURN_Pos);
}

/**
  * @brief  Set the format of the response for GETMXDS CCC.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  format  GETMXDS format
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_TGT_SetConfigGETMXDS_Format(const hal_i3c_handle_t *hi3c, hal_i3c_getmxds_format_t format)
{
  I3C_TypeDef *p_i3cx;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(IS_I3C_MAX_SPEED_DATA(format));
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

