MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
  p_i3cx = I3C_GET_INSTANCE(hi3c);
  LL_I3C_Disable(p_i3cx);
  LL_I3C_SetMaxDataSpeedFormat(p_i3cx, (uint32_t)format);
  LL_I3C_Enable(p_i3cx);

  return HAL_OK;
}

/**
  * @brief  Get the format of the response for GETMXDS CCC.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_I3C_GETMXDS_FORMAT_1
  * @retval HAL_I3C_GETMXDS_FORMAT_2_LSB
  * @retval HAL_I3C_GETMXDS_FORMAT_2_MID
  * @retval HAL_I3C_GETMXDS_FORMAT_2_MSB
  */
hal_i3c_getmxds_format_t HAL_I3C_TGT_GetConfigGETMXDS_Format(const hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  return (hal_i3c_getmxds_format_t) LL_I3C_GetMaxDataSpeedFormat(I3C_GET_INSTANCE(hi3c));
}

/**
  * @brief  Set the activity state after Controller-Role handoff configuration.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  state Handoff activity state
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_TGT_SetConfigCtrlHandOffActivity(const hal_i3c_handle_t *hi3c,
                                                      hal_i3c_handoff_activity_state_t state)
{
  I3C_TypeDef *p_i3cx;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(IS_I3C_HANDOFF_ACTIVITY_STATE(state));
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  p_i3cx = I3C_GET_INSTANCE(hi3c);
  LL_I3C_Disable(p_i3cx);
  LL_I3C_SetHandoffActivityState(p_i3cx, (uint32_t)state);
  LL_I3C_Enable(p_i3cx);

  return HAL_OK;
}

/**
  * @brief  Get the Activity State after Controller-Role handoff.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_I3C_HANDOFF_ACTIVITY_STATE_0  Activity state 0 after handoff
  * @retval HAL_I3C_HANDOFF_ACTIVITY_STATE_1  Activity state 1 after handoff
  * @retval HAL_I3C_HANDOFF_ACTIVITY_STATE_2  Activity state 2 after handoff
  * @retval HAL_I3C_HANDOFF_ACTIVITY_STATE_3  Activity state 3 after handoff
  */
hal_i3c_handoff_activity_state_t HAL_I3C_TGT_GetConfigCtrlHandOffActivity(const hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  return (hal_i3c_handoff_activity_state_t) LL_I3C_GetHandoffActivityState(I3C_GET_INSTANCE(hi3c));
}

/**
  * @brief  Set I3C bus devices configuration in DEVRX[].
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_desc Pointer to the configuration structure
  * @param  nb_device Number of devices to configure
  *         This parameter must be a value between Min_Data=1 and Max_Data=4
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_CTRL_SetConfigBusDevices(const hal_i3c_handle_t *hi3c,
                                              const hal_i3c_ctrl_device_config_t *p_desc,
                                              uint32_t nb_device)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_desc != NULL);
  ASSERT_DBG_PARAM(IS_I3C_DEVICE(nb_device));
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_desc == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Loop on the nb_device to be treated */
  for (uint32_t i = 0U; i < nb_device; i++)
  {
    ASSERT_DBG_PARAM(IS_I3C_DEVICE_INDEX(p_desc[i].device_index));
    ASSERT_DBG_PARAM(IS_I3C_DYNAMIC_ADDRESS(p_desc[i].tgt_dynamic_addr));
    ASSERT_DBG_PARAM(IS_I3C_CTRL_IBI_ACK(p_desc[i].ibi_ack));
    ASSERT_DBG_PARAM(IS_I3C_CTRL_ROLE_ACK(p_desc[i].ctrl_role_req_ack));
    ASSERT_DBG_PARAM(IS_I3C_CTRL_STOP_XFER(p_desc[i].ctrl_stop_transfer));
    ASSERT_DBG_PARAM(IS_I3C_CTRL_IBI_PAYLOAD(p_desc[i].ibi_payload));

    LL_I3C_SetDevrx(I3C_GET_INSTANCE(hi3c),
                    p_desc[i].device_index,
                    (uint32_t)p_desc[i].tgt_dynamic_addr,
                    (uint32_t)p_desc[i].ibi_ack,
                    (uint32_t)p_desc[i].ibi_payload,
                    (uint32_t)p_desc[i].ctrl_stop_transfer,
                    (uint32_t)p_desc[i].ctrl_role_req_ack);
  }

  return HAL_OK;
}

/**
  * @brief  Retrieve I3C bus devices configuration from DEVRX[].
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_desc  Pointer to the configuration structure
  * @param  nb_device  Number of devices to retrieve the configuration
  *         This parameter must be a value between Min_Data=1 and Max_Data=4
  */
void HAL_I3C_CTRL_GetConfigBusDevices(const hal_i3c_handle_t *hi3c,
                                      hal_i3c_ctrl_device_config_t *p_desc,
                                      uint32_t nb_device)
{
  uint32_t read_value;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(IS_I3C_DEVICE(nb_device));
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  /* Loop on the nb_device to be treated */
  for (uint32_t i = 0U; i < nb_device; i++)
  {
    ASSERT_DBG_PARAM((&p_desc[i]) != NULL);
    read_value = LL_I3C_GetDevrx(I3C_GET_INSTANCE(hi3c), i);
    p_desc[i].device_index       = (uint8_t)i;
    p_desc[i].tgt_dynamic_addr   = (uint8_t)(uint32_t)((read_value & I3C_DEVRX_DA) >> I3C_DEVRX_DA_Pos);
    p_desc[i].ibi_ack            = (hal_i3c_ctrl_ibi_ack_status_t)(uint32_t)(read_value & I3C_DEVRX_IBIACK);
    p_desc[i].ctrl_role_req_ack  = (hal_i3c_ctrl_role_ack_status_t)(uint32_t)(read_value & I3C_DEVRX_CRACK);
    p_desc[i].ctrl_stop_transfer = (hal_i3c_ctrl_stop_transfer_status_t)(uint32_t)(read_value & I3C_DEVRX_SUSP);
    p_desc[i].ibi_payload        = (hal_i3c_ctrl_ibi_payload_status_t)(uint32_t)(read_value & I3C_DEVRX_IBIDEN);
  }
}

/**
  * @brief  Enable the inserted reset pattern at the end of a frame.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_CTRL_EnableResetPattern(hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  LL_I3C_EnableResetPattern(I3C_GET_INSTANCE(hi3c));

  return HAL_OK;
}

/**
  * @brief  Disable the inserted reset pattern at the end of a frame.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_CTRL_DisableResetPattern(hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  LL_I3C_DisableResetPattern(I3C_GET_INSTANCE(hi3c));

  return HAL_OK;
}

/**
  * @brief  Check if the inserted reset pattern at the end of a frame is enabled or disabled.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_I3C_RESET_PATTERN_DISABLED  Standard STOP condition emitted at the end of a frame
  * @retval HAL_I3C_RESET_PATTERN_ENABLED  Reset pattern is inserted before the STOP condition of any emitted frame
  */
hal_i3c_reset_pattern_status_t HAL_I3C_CTRL_IsEnabledResetPattern(const hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  return (hal_i3c_reset_pattern_status_t) LL_I3C_IsEnabledResetPattern(I3C_GET_INSTANCE(hi3c));
}

#if defined(USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register the controller transfer complete callback.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_callback  Pointer to the controller transfer complete callback function
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_CTRL_RegisterTransferCpltCallback(hal_i3c_handle_t *hi3c, hal_i3c_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_INIT | HAL_I3C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi3c->p_ctrl_transfer_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the controller dynamic address assignment complete callback.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_callback  Pointer to the controller dynamic address assignment complete callback function
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_CTRL_RegisterDAACpltCallback(hal_i3c_handle_t *hi3c, hal_i3c_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_INIT | HAL_I3C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi3c->p_ctrl_daa_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the target request dynamic address callback.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_callback  Pointer to the target request dynamic address callback function
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_CTRL_RegisterTgtReqDynAddrCallback(hal_i3c_handle_t *hi3c,
                                                        hal_i3c_req_dyn_addr_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_INIT | HAL_I3C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

