MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
  hi3c->p_ctrl_tgt_req_dyn_addr_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the target transmission complete callback.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_callback  Pointer to the target transmission complete callback function
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_TGT_RegisterTxCpltCallback(hal_i3c_handle_t *hi3c, hal_i3c_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_INIT | HAL_I3C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi3c->p_tgt_tx_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the target Reception complete callback.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_callback  Pointer to the target reception complete callback function
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_TGT_RegisterRxCpltCallback(hal_i3c_handle_t *hi3c, hal_i3c_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_INIT | HAL_I3C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi3c->p_tgt_rx_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the target Hot-Join process complete callback.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_callback  Pointer to the target Hot-Join process complete callback function
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_TGT_RegisterHotJoinCallback(hal_i3c_handle_t *hi3c, hal_i3c_tgt_hot_join_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_INIT | HAL_I3C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi3c->p_tgt_hot_join_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the target/controller Notification event callback.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_callback  Pointer to the target/controller Notification event callback function
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_RegisterNotifyCallback(hal_i3c_handle_t *hi3c, hal_i3c_notify_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_INIT | HAL_I3C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi3c->p_notify_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the abort complete callback.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_callback  Pointer to the abort complete callback function
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_RegisterAbortCpltCallback(hal_i3c_handle_t *hi3c, hal_i3c_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_INIT | HAL_I3C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi3c->p_abort_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the error callback.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_callback  Pointer to the error callback function
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_RegisterErrorCallback(hal_i3c_handle_t *hi3c, hal_i3c_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_INIT | HAL_I3C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi3c->p_error_cb = p_callback;

  return HAL_OK;
}
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */

#if defined(USE_HAL_I3C_DMA) && (USE_HAL_I3C_DMA == 1)
/**
  * @brief  Link the transmit DMA handle to the I3C handle.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  hdma  Pointer to a hal_dma_handle_t structure
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_SetTxDMA(hal_i3c_handle_t *hi3c, hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_INIT | HAL_I3C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi3c->hdma_tx = hdma;
  hdma->p_parent = hi3c;

  return HAL_OK;
}

/**
  * @brief  Link the receive DMA handle to the I3C handle.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  hdma  Pointer to a hal_dma_handle_t structure
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_SetRxDMA(hal_i3c_handle_t *hi3c, hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_INIT | HAL_I3C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

