MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
  hi3c->hdma_rx = hdma;
  hdma->p_parent = hi3c;

  return HAL_OK;
}

/**
  * @brief  Link the CR DMA handle to the I3C handle.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  hdma  Pointer to a hal_dma_handle_t structure
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_SetTcDMA(hal_i3c_handle_t *hi3c, hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_INIT | HAL_I3C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi3c->hdma_tc = hdma;
  hdma->p_parent = hi3c;

  return HAL_OK;
}
#endif /* USE_HAL_I3C_DMA */
/**
  * @}
  */

/** @addtogroup I3C_Exported_Functions_Group3 Interrupt and callback functions

A set of functions allowing the management of the notification feature of the I3Cx peripheral:
 - HAL_I3C_CTRL_ActivateNotification() to activate the I3C notifications in controller mode.
 - HAL_I3C_CTRL_DeactivateNotification() to deactivate the I3C notifications in controller mode.
 - HAL_I3C_TGT_ActivateNotification() to activate the I3C notifications in target mode.
 - HAL_I3C_TGT_DeactivateNotification() to deactivate the I3C notifications in target mode.
  * @{
  */

/**
  * @brief  Activate the I3C notifications in controller mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  notifications  Notification. It can be a combination value of @ref I3C_CTRL_NOTIFICATION
  * @warning This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_CTRL_ActivateNotification(hal_i3c_handle_t *hi3c, uint32_t notifications)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(IS_I3C_CTRL_NOTIFICATIONS(notifications));
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  hi3c->listen = I3C_LISTEN_ENABLED;
  hi3c->p_isr_func = I3C_Ctrl_Event_ISR;
  LL_I3C_EnableIT(I3C_GET_INSTANCE(hi3c), (notifications | LL_I3C_IER_ERRIE));

  return HAL_OK;
}

/**
  * @brief  Deactivate the I3C notifications.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  notifications  Notification. It can be a combination value of @ref I3C_CTRL_NOTIFICATION
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_CTRL_DeactivateNotification(hal_i3c_handle_t *hi3c, uint32_t notifications)
{
  I3C_TypeDef *p_i3cx;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(IS_I3C_CTRL_NOTIFICATIONS(notifications));
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  p_i3cx = I3C_GET_INSTANCE(hi3c);
  LL_I3C_DisableIT(p_i3cx, (notifications | LL_I3C_IER_ERRIE));

  if (LL_I3C_GetEnabledIT(p_i3cx) == 0U)
  {
    hi3c->p_isr_func = NULL;
    hi3c->listen = I3C_LISTEN_DISABLED;
  }

  return HAL_OK;
}

/**
  * @brief  Activate the I3C notifications in target mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_data  Pointer to the retrieve data during broadcast CCC DEFTGTS and DEFGRPA.
  * @param  size_byte  Size of retrieved data.
  * @param  notifications  Notification. It can be a combination value of @ref I3C_TGT_NOTIFICATION
  * @note   If HAL_I3C_TGT_NOTIFICATION_DEFTGTS or HAL_I3C_TGT_NOTIFICATION_DEFGRPA is requested,
  *         p_data must be non-NULL and size_byte non-zero to capture the broadcast payload bytes.
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_TGT_ActivateNotification(hal_i3c_handle_t *hi3c, uint8_t *p_data, uint32_t size_byte,
                                              uint32_t notifications)
{
  I3C_TypeDef *p_i3cx;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(IS_I3C_TGT_NOTIFICATIONS(notifications));
  ASSERT_DBG_PARAM((notifications & (HAL_I3C_TGT_NOTIFICATION_DEFTGTS | HAL_I3C_TGT_NOTIFICATION_DEFGRPA)) == 0U \
                   || (p_data != NULL && size_byte != 0U));
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (((notifications & (HAL_I3C_TGT_NOTIFICATION_DEFTGTS | HAL_I3C_TGT_NOTIFICATION_DEFGRPA)) != 0U)
      && ((p_data == NULL) || (size_byte == 0U)))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_i3cx = I3C_GET_INSTANCE(hi3c);
  hi3c->p_isr_func = I3C_Tgt_Event_ISR;
  hi3c->listen = I3C_LISTEN_ENABLED;

  if ((notifications & (HAL_I3C_TGT_NOTIFICATION_DEFTGTS | HAL_I3C_TGT_NOTIFICATION_DEFGRPA)) != 0U)
  {
    hi3c->p_rx_data = p_data;
    hi3c->rx_count_byte = size_byte;

    if (LL_I3C_GetRxFIFOThreshold(p_i3cx) == LL_I3C_RXFIFO_THRESHOLD_1_8)
    {
      hi3c->p_rx_func = &I3C_ReceiveByteTreatment_IT;
    }
    else
    {
      hi3c->p_rx_func = &I3C_ReceiveWordTreatment_IT;
    }
  }

  LL_I3C_EnableIT(p_i3cx, (notifications | LL_I3C_IER_ERRIE));

  return HAL_OK;
}


/**
  * @brief  Deactivate the I3C notifications.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  notifications  Notification. It can be a combination value of @ref I3C_TGT_NOTIFICATION
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_TGT_DeactivateNotification(hal_i3c_handle_t *hi3c, uint32_t notifications)
{
  I3C_TypeDef *p_i3cx;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(IS_I3C_TGT_NOTIFICATIONS(notifications));
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  p_i3cx = I3C_GET_INSTANCE(hi3c);
  LL_I3C_DisableIT(p_i3cx, (notifications | LL_I3C_IER_ERRIE));

  if (LL_I3C_GetEnabledIT(p_i3cx) == 0U)
  {
    hi3c->p_isr_func = NULL;
    hi3c->listen = I3C_LISTEN_DISABLED;
    hi3c->global_state = HAL_I3C_STATE_IDLE;
  }

  return HAL_OK;
}
/**
  * @}
  */

/** @addtogroup I3C_Exported_Functions_Group4 IRQ Handlers
  * @{
A set of functions to handle the I3C interruptions:
  - I3C Event IRQ Handler: HAL_I3C_EV_IRQHandler()
  - I3C Error IRQ Handler: HAL_I3C_ERR_IRQHandler()

