MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
Depending on the process function used, different callbacks might be triggered:

| Process API \ Callbacks                      | HAL_I3C_CTRL_DynAddrAssign_IT() |
|----------------------------------------------|:-------------------------------:|
| HAL_I3C_CTRL_DAACpltCallback()               |               x                 |
| HAL_I3C_CTRL_TgtReqDynAddrCallback()         |               x                 |
| HAL_I3C_ErrorCallback()                      |               x                 |

| Process API \ Callbacks                      | HAL_I3C_CTRL_Transfer_IT()      | HAL_I3C_CTRL_Transfer_DMA()     |
|----------------------------------------------|:-------------------------------:|:-------------------------------:|
| HAL_I3C_CTRL_TransferCpltCallback()          |               x                 |               x                 |
| HAL_I3C_NotifyCallback()*                    |               x                 |               x                 |
| HAL_I3C_ErrorCallback()                      |               x                 |               x                 |

| Process API \ Callbacks                      | HAL_I3C_TGT_Transmit_IT()       | HAL_I3C_TGT_Transmit_DMA()      |
|----------------------------------------------|:-------------------------------:|:-------------------------------:|
| HAL_I3C_TGT_TxCpltCallback()                 |               x                 |               x                 |
| HAL_I3C_NotifyCallback()*                    |               x                 |               x                 |
| HAL_I3C_ErrorCallback()                      |               x                 |               x                 |

| Process API \ Callbacks                      | HAL_I3C_TGT_Receive_IT()        | HAL_I3C_TGT_Receive_DMA()       |
|----------------------------------------------|:-------------------------------:|:-------------------------------:|
| HAL_I3C_TGT_RxCpltCallback()                 |               x                 |               x                 |
| HAL_I3C_NotifyCallback()*                    |               x                 |               x                 |
| HAL_I3C_ErrorCallback()                      |               x                 |               x                 |

| Process API \ Callbacks                      | HAL_I3C_TGT_HotJoinReq_IT()     |
|----------------------------------------------|:-------------------------------:|
| HAL_I3C_TGT_HotJoinCallback()                |               x                 |
| HAL_I3C_ErrorCallback()                      |               x                 |

| Process API \ Callbacks                                  |  HAL_I3C_TGT_ControlRoleReq_IT()  |
|----------------------------------------------------------|:---------------------------------:|
| HAL_I3C_NotifyCallback(HAL_I3C_TGT_NOTIFICATION_GETACCCR)|                 x                 |
| HAL_I3C_ErrorCallback()                                  |                 x                 |

| Process API \ Callbacks                                  |  HAL_I3C_TGT_IBIReq_IT()          |
|----------------------------------------------------------|:---------------------------------:|
| HAL_I3C_NotifyCallback(HAL_I3C_TGT_NOTIFICATION_IBIEND)  |                 x                 |
| HAL_I3C_ErrorCallback()                                  |                 x                 |

| Process API \ Callbacks                                  | HAL_I3C_Abort_IT()                |
|----------------------------------------------------------|:---------------------------------:|
| HAL_I3C_AbortCpltCallback()                              |                 x                 |

@note * HAL_I3C_NotifyCallback() is triggered if HAL_I3C_CTRL_ActivateNotification or HAL_I3C_TGT_ActivateNotification
        have been previously called in state HAL_I3C_STATE_IDLE
  */

/**
  * @brief  Handle I3C error interrupt request.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  */
void HAL_I3C_ERR_IRQHandler(hal_i3c_handle_t *hi3c)
{
  I3C_TypeDef *p_i3cx = I3C_GET_INSTANCE(hi3c);

  /* Check on the error interrupt flag and source */
  if (LL_I3C_IsActiveMaskFlag_ERR(p_i3cx) != 0U)
  {
    LL_I3C_ClearFlag_ERR(p_i3cx);

#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
    if (hi3c->global_state != HAL_I3C_STATE_ABORT)
    {
      I3C_GetErrorSources(hi3c);
    }
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */

    I3C_ErrorTreatment(hi3c);
  }
}

/**
  * @brief  Handle I3C event interrupt request.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  */
void HAL_I3C_EV_IRQHandler(hal_i3c_handle_t *hi3c)
{
  const I3C_TypeDef *p_i3cx = I3C_GET_INSTANCE(hi3c);

  uint32_t it_masks = LL_I3C_GetRegister_MISR(p_i3cx);

  /* I3C events treatment */
  if (hi3c->p_isr_func != NULL)
  {
    hi3c->p_isr_func(hi3c, it_masks);
  }
}

/**
  * @}
  */

/** @addtogroup I3C_Exported_Functions_Group5 FIFO flush functions
  * @{
A set of functions to flush FIFOs :
  - HAL_I3C_FlushAllFifos() to flush the content of all used FIFOs (Control, Status, Tx and Rx FIFO).
  - HAL_I3C_FlushTxFifo() to flush only the content of Tx FIFO.
  - HAL_I3C_FlushRxFifo() to flush only the content of Rx FIFO.
  - HAL_I3C_CTRL_FlushControlFifo() to flush only the content of Control FIFO.
  - HAL_I3C_CTRL_FlushStatusFifo() to flush only the content of Status FIFO.
  */

/**
  * @brief  Flush all I3C FIFOs content.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_FlushAllFifos(const hal_i3c_handle_t *hi3c)
{
  uint32_t cfgr_value;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  /* Flush the content of Tx and Rx Fifo */
  cfgr_value = (I3C_CFGR_TXFLUSH | I3C_CFGR_RXFLUSH);

  /* Check on the I3C mode: Control and status FIFOs available only with controller mode */
  if (hi3c->mode == HAL_I3C_MODE_CTRL)
  {
    /* Flush the content of control and status Fifo */
    cfgr_value |= (I3C_CFGR_SFLUSH | I3C_CFGR_CFLUSH);
  }

  LL_I3C_RequestFifosFlush(I3C_GET_INSTANCE(hi3c), cfgr_value);

  return HAL_OK;
}

/**
  * @brief  Flush I3C Tx FIFO content.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_FlushTxFifo(const hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  LL_I3C_RequestTxFIFOFlush(I3C_GET_INSTANCE(hi3c));

  return HAL_OK;
}

/**
  * @brief  Flush I3C Rx FIFO content.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_FlushRxFifo(const hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  LL_I3C_RequestRxFIFOFlush(I3C_GET_INSTANCE(hi3c));

  return HAL_OK;
}

/**
  * @brief  Flush I3C control FIFO content.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_CTRL_FlushControlFifo(const hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  LL_I3C_RequestControlFIFOFlush(I3C_GET_INSTANCE(hi3c));

  return HAL_OK;
}

/**
  * @brief  Flush I3C status FIFO content.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_CTRL_FlushStatusFifo(const hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

