MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
  LL_I3C_RequestStatusFIFOFlush(I3C_GET_INSTANCE(hi3c));

  return HAL_OK;
}

/**
  * @}
  */


/** @addtogroup I3C_Exported_Functions_Group6 Controller transfer operation functions
  * @{
 A set of functions that manage controller I3C transfer operations:
  - HAL_I3C_CTRL_ResetTransferCtx() to reset a transfer context.
  - HAL_I3C_CTRL_InitTransferCtxTc() to provide a ctrl buffer. It will be filled by
    HAL_I3C_CTRL_BuildTransferCtxPrivate() or HAL_I3C_CTRL_BuildTransferCtxCCC().
  - HAL_I3C_CTRL_InitTransferCtxTx() to provide the Tx buffer. It must be filled by application
    with concatenated Tx data.
  - HAL_I3C_CTRL_InitTransferCtxRx() to provide the Rx buffer.
  - HAL_I3C_CTRL_BuildTransferCtxPrivate() or HAL_I3C_CTRL_BuildTransferCtxCCC() to build transfer context
  - HAL_I3C_CTRL_Transfer() to start transfer I3C or I2C private data or CCC command in multiple direction
    in polling mode.
  - HAL_I3C_CTRL_Transfer_IT() to start transfer I3C or I2C private data or CCC command in multiple direction
    in interrupt mode.
  - HAL_I3C_CTRL_Transfer_DMA() to start transfer I3C or I2C private data or CCC command in multiple direction
    in DMA mode.
  - HAL_I3C_CTRL_DynAddrAssign() to send a broadcast ENTDAA CCC command in polling mode.
  - HAL_I3C_CTRL_DynAddrAssign_IT() to send a broadcast ENTDAA CCC command in interrupt mode.
  - HAL_I3C_CTRL_SetDynAddr() to set, associate the target dynamic address during the Dynamic Address Assignment
    process.
  - HAL_I3C_CTRL_PoolForDeviceI3cReady() to check if I3C target device is ready.
  - HAL_I3C_CTRL_PoolForDeviceI2cReady() to check if I2C target device is ready.
  - HAL_I3C_CTRL_GeneratePatterns() to send HDR exit pattern or target reset pattern.
  - HAL_I3C_CTRL_GenerateArbitration() to send arbitration (message header {S + 0x7E + W + STOP}) in polling mode.
  - HAL_I3C_CTRL_RecoverSCLToIDLE() to force the stop of the SCL clock.
  */


/**
  * @brief  Reset a controller transfer context.
  * @param  p_ctx  Pointer to the transfer context
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid  parameter
  */
hal_status_t HAL_I3C_CTRL_ResetTransferCtx(hal_i3c_transfer_ctx_t *p_ctx)
{
  ASSERT_DBG_PARAM(p_ctx != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_ctx == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_ctx->p_tc_data = NULL;
  p_ctx->tc_size_word = 0U;
  p_ctx->p_tc_data = NULL;
  p_ctx->tc_size_word = 0U;
  p_ctx->p_tx_data = NULL;
  p_ctx->tx_size_byte = 0U;
  p_ctx->p_rx_data = NULL;
  p_ctx->rx_size_byte = 0U;
  p_ctx->transfer_mode = (hal_i3c_transfer_mode_t) 0U;
  p_ctx->nb_tx_frame = 0U;

  return HAL_OK;
}


/**
  * @brief  Initialize the transfer context with pointer to Transmit Control (TC) descriptor words buffer.
  * @param  p_ctx  Pointer to the transfer context
  * @param  p_ctrl_buf Pointer to the Transmit Control (TC) buffer.
  * @param  size_word  Size in word of the Transmit Control (TC) buffer.
  *                    size word = 2* number of description in case of direct CCC transfers
  *                    size word = number of description for all other transfers
  *                    Use helper macro @ref HAL_I3C_GET_CTRL_BUFFER_SIZE_WORD
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_CTRL_InitTransferCtxTc(hal_i3c_transfer_ctx_t *p_ctx, uint32_t *p_ctrl_buf, uint32_t size_word)
{
  hal_status_t hal_status = HAL_OK;

  ASSERT_DBG_PARAM(p_ctx != NULL);
  ASSERT_DBG_PARAM(p_ctrl_buf != NULL);
  ASSERT_DBG_PARAM(size_word != 0U);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_ctx == NULL) || (p_ctrl_buf == NULL) || (size_word == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_ctx->p_tc_data = p_ctrl_buf;
  p_ctx->tc_size_word = size_word;

  return hal_status;
}

/**
  * @brief  Initialize the transfer context with Tx data.
  * @param  p_ctx  Pointer to the transfer context
  * @param  p_tx_data  Pointer to the cumulated Tx buffer (@ref HAL_I3C_DIRECTION_WRITE)
  * @param  size_byte  Size in byte of the cumulated Tx data
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_CTRL_InitTransferCtxTx(hal_i3c_transfer_ctx_t *p_ctx, const uint8_t *p_tx_data,
                                            uint32_t size_byte)
{
  hal_status_t hal_status = HAL_OK;

  ASSERT_DBG_PARAM(p_ctx != NULL);
  ASSERT_DBG_PARAM(p_tx_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0U);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_ctx == NULL) || (p_tx_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_ctx->p_tx_data = p_tx_data;
  p_ctx->tx_size_byte = size_byte;

  return hal_status;
}

/**
  * @brief  Initialize the transfer context with Rx data.
  * @param  p_ctx  Pointer to the transfer context
  * @param  p_rx_data  Pointer to the cumulated Rx buffer (@ref HAL_I3C_DIRECTION_READ)
  * @param  size_byte  Size in byte of the cumulated Rx data
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_CTRL_InitTransferCtxRx(hal_i3c_transfer_ctx_t *p_ctx, uint8_t *p_rx_data, uint32_t size_byte)
{
  hal_status_t hal_status = HAL_OK;

  ASSERT_DBG_PARAM(p_ctx != NULL);
  ASSERT_DBG_PARAM(p_rx_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0U);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_ctx == NULL) || (p_rx_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_ctx->p_rx_data = p_rx_data;
  p_ctx->rx_size_byte = size_byte;

  return hal_status;
}

/**
  * @brief  Build a transfer context from private transfer descriptors.
  * @param  p_ctx  Pointer to the transfer context
  * @param  p_desc  Pointer to the private transfer descriptor table.
  * @param  nb_desc  The number private transfer descriptor.
  * @param  mode  Transfer mode. It must be one of PRIVATE mode from @ref hal_i3c_transfer_mode_t
  * @note   Preconditions on p_ctx (all must be satisfied before calling this function):
  *         1. HAL_I3C_CTRL_ResetTransferCtx() was called (context cleared).
  *         2. Control buffer provided via HAL_I3C_CTRL_InitTransferCtxTc():
  *              - p_ctx->p_tc_data != NULL
  *              - p_ctx->tc_size_word == nb_desc (exactly one control word per private descriptor)
  *         3. If any descriptor has direction HAL_I3C_DIRECTION_WRITE:
  *              - HAL_I3C_CTRL_InitTransferCtxTx() was called
  *              - p_ctx->p_tx_data != NULL
  *              - p_ctx->tx_size_byte == sum of data_size_byte for all WRITE descriptors
  *         4. If any descriptor has direction HAL_I3C_DIRECTION_READ:
  *              - HAL_I3C_CTRL_InitTransferCtxRx() was called
  *              - p_ctx->p_rx_data != NULL
  *              - p_ctx->rx_size_byte == sum of data_size_byte for all READ descriptors
  *         5. If total write size or read size is zero, the corresponding pointer can be NULL.
  *         6. mode must satisfy IS_I3C_PRIVATE_MODE(mode).
  *         7. Function neither allocates nor modifies user data buffers; it only fills control words.
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_CTRL_BuildTransferCtxPrivate(hal_i3c_transfer_ctx_t *p_ctx, const hal_i3c_private_desc_t *p_desc,
                                                  uint32_t nb_desc, hal_i3c_transfer_mode_t mode)
{
  hal_status_t hal_status = HAL_OK;
  uint32_t stop_condition;
#if defined(USE_ASSERT_DBG_PARAM) || (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1))
  uint32_t tx_cumul_size_byte = 0U;
  uint32_t rx_cumul_size_byte = 0U;
#endif /* USE_ASSERT_DBG_PARAM | USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(p_ctx != NULL);
  ASSERT_DBG_PARAM(p_desc != NULL);
  ASSERT_DBG_PARAM(nb_desc != 0U);
  ASSERT_DBG_PARAM(IS_I3C_PRIVATE_MODE(mode));
  ASSERT_DBG_PARAM(p_ctx->p_tc_data != NULL);
  ASSERT_DBG_PARAM(p_ctx->tc_size_word == nb_desc);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_desc == NULL) || (nb_desc == 0U) || (p_ctx == NULL) || (p_ctx->p_tc_data == NULL)
      || (p_ctx->tc_size_word != nb_desc))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_ctx->transfer_mode = mode;
  stop_condition = (uint32_t)mode & (uint32_t)I3C_RESTART_STOP_MASK;
  /*-------------------------------------------- Private -------------------------------------------------------------*/
  for (uint32_t i = 0U; i < nb_desc; i++)
  {
    uint32_t data_size_byte = p_desc[i].data_size_byte;
    uint32_t direction = (uint32_t) p_desc[i].direction;

    /* At the end, generate a stop condition */
    if (i == (nb_desc - 1U))
    {
      stop_condition = LL_I3C_GENERATE_STOP;
    }

    /* Update control buffer value */
    p_ctx->p_tc_data[i] = (data_size_byte | direction | ((uint32_t)p_desc[i].tgt_addr << I3C_CR_ADD_Pos)
                           | ((uint32_t)mode & (uint32_t)I3C_OPERATION_TYPE_MASK) | stop_condition);

#if defined(USE_ASSERT_DBG_PARAM) || (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1))
    if (direction == (uint32_t) HAL_I3C_DIRECTION_WRITE)
    {
      tx_cumul_size_byte += data_size_byte;
    }
    else
    {
      rx_cumul_size_byte += data_size_byte;
    }
#endif /* USE_ASSERT_DBG_PARAM | USE_HAL_CHECK_PARAM */
  }

  ASSERT_DBG_PARAM(p_ctx->tx_size_byte == tx_cumul_size_byte);
  ASSERT_DBG_PARAM(p_ctx->rx_size_byte == rx_cumul_size_byte);
  ASSERT_DBG_PARAM((tx_cumul_size_byte == 0U) || (p_ctx->p_tx_data != NULL));
  ASSERT_DBG_PARAM((rx_cumul_size_byte == 0U) || (p_ctx->p_rx_data != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_ctx->tx_size_byte != tx_cumul_size_byte)
      || (p_ctx->rx_size_byte != rx_cumul_size_byte)
      || ((tx_cumul_size_byte != 0U) && (p_ctx->p_tx_data == NULL))
      || ((rx_cumul_size_byte != 0U) && (p_ctx->p_rx_data == NULL)))
  {
    hal_status = HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  return hal_status;
}

/**
  * @brief  Build a transfer context from CCC transfer descriptor.
  * @param  p_desc  Pointer to the CCC transfer descriptor table
  * @param  nb_desc  The number CCC transfer descriptor
  * @param  p_ctx  Pointer to the transfer context
  * @param  mode  Transfer mode. It must be one of CCC mode from @ref hal_i3c_transfer_mode_t
  * @note   Preconditions on p_ctx (all must be satisfied before calling this function):
  *         1. HAL_I3C_CTRL_ResetTransferCtx() was called (context cleared).
  *         2. Control buffer provided via HAL_I3C_CTRL_InitTransferCtxTc():
  *              - p_ctx->p_tc_data != NULL
  *              - For broadcast CCC: p_ctx->tc_size_word >= nb_desc (1 word per descriptor)
  *              - For direct CCC: p_ctx->tc_size_word >= (2 * nb_desc) (2 words per descriptor: CCC + target)
  *            After build, driver overwrites p_ctx->tc_size_word with the exact used size (nb_desc or 2*nb_desc).
  *         3. Tx buffer requirements:
  *              - If any descriptor has direction HAL_I3C_DIRECTION_WRITE (broadcast or direct write):
  *                  HAL_I3C_CTRL_InitTransferCtxTx() was called
  *                  p_ctx->p_tx_data != NULL
  *                  p_ctx->tx_size_byte ==
  *                     (sum of data_size_byte for all WRITE descriptors) +
  *                     (sum of nb_define_bytes for all READ descriptors using a define byte)
  *         4. Rx buffer requirements:
  *              - If any descriptor has direction HAL_I3C_DIRECTION_READ (direct read CCC only):
  *                  HAL_I3C_CTRL_InitTransferCtxRx() was called
  *                  p_ctx->p_rx_data != NULL
  *                  p_ctx->rx_size_byte ==
  *                     sum over READ descriptors of (data_size_byte - nb_define_bytes)
  *         5. If total computed tx_size_byte or rx_size_byte is zero, the corresponding pointer can be NULL.
  *         6. mode must satisfy IS_I3C_CCC_MODE(mode).
  *         7. Function only fills control words; it does not allocate or modify user data buffers.
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_CTRL_BuildTransferCtxCCC(hal_i3c_transfer_ctx_t *p_ctx, const hal_i3c_ccc_desc_t *p_desc,
                                              uint32_t nb_desc, hal_i3c_transfer_mode_t mode)
{
  hal_status_t hal_status = HAL_OK;
  uint32_t stop_condition;
#if defined(USE_ASSERT_DBG_PARAM) || (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1))
  uint32_t tx_cumul_size_byte = 0U;
  uint32_t rx_cumul_size_byte = 0U;
#endif /* USE_ASSERT_DBG_PARAM | USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(p_desc != NULL);
  ASSERT_DBG_PARAM(nb_desc != 0U);
  ASSERT_DBG_PARAM(p_ctx != NULL);
  ASSERT_DBG_PARAM(p_ctx->p_tc_data != NULL);
  ASSERT_DBG_PARAM(IS_I3C_CCC_MODE(mode));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_desc == NULL) || (nb_desc == 0U) || (p_ctx == NULL) || (p_ctx->p_tc_data == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_ctx->nb_tx_frame = 0U;
  stop_condition = (uint32_t)mode & (uint32_t)I3C_RESTART_STOP_MASK;
  p_ctx->transfer_mode = mode;

  if (((uint32_t)mode & (uint32_t)I3C_OPERATION_TYPE_MASK) == LL_I3C_CONTROLLER_MTYPE_CCC)
  {
    /*------------------------------------------ Broadcast CCC -------------------------------------------------------*/
    ASSERT_DBG_PARAM(p_ctx->tc_size_word >= nb_desc);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
    if (p_ctx->tc_size_word !=  nb_desc)
    {
      return HAL_INVALID_PARAM;
    }
#endif /* USE_HAL_CHECK_PARAM */

    p_ctx->tc_size_word = nb_desc;

