MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
    for (uint32_t i = 0U; i < nb_desc; i++)
    {
      ASSERT_DBG_PARAM(IS_I3C_DIRECTION_CCC_BROADCAST(p_desc[i].direction));
      uint32_t data_size_byte = p_desc[i].data_size_byte;

      /* Only HAL_I3C_DIRECTION_WRITE is allowed */
#if defined(USE_ASSERT_DBG_PARAM) || (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1))
      tx_cumul_size_byte += data_size_byte;
#endif /* USE_ASSERT_DBG_PARAM | USE_HAL_CHECK_PARAM */
      p_ctx->nb_tx_frame++;

      /* Generate a stop condition at the end */
      if (i == (nb_desc - 1U))
      {
        stop_condition = LL_I3C_GENERATE_STOP;
      }

      /* Update control buffer value */
      p_ctx->p_tc_data[i] = data_size_byte | ((uint32_t)p_desc[i].ccc << I3C_CR_CCC_Pos)
                            | LL_I3C_CONTROLLER_MTYPE_CCC | stop_condition;
    }
  }
  else if (((uint32_t)mode & (uint32_t)I3C_OPERATION_TYPE_MASK) == LL_I3C_CONTROLLER_MTYPE_DIRECT)
  {
    /*------------------------------------------ Direct CCC ----------------------------------------------------------*/
    ASSERT_DBG_PARAM(p_ctx->tc_size_word >= (2U * nb_desc));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
    if (p_ctx->tc_size_word != (2U * nb_desc))
    {
      return HAL_INVALID_PARAM;
    }
#endif /* USE_HAL_CHECK_PARAM */

    uint32_t nb_define_bytes = ((uint32_t)mode & (uint32_t)I3C_DEFINE_BYTE_MASK);  /* 0 or 1 */
    p_ctx->tc_size_word = 2U * nb_desc;

    uint32_t i = 0U;
    uint32_t double_i = 0U;
    while (i < nb_desc)
    {
      uint32_t direction = (uint32_t)p_desc[i].direction;
      uint32_t data_size_byte = p_desc[i].data_size_byte;
      ASSERT_DBG_PARAM(IS_I3C_DIRECTION(direction));

      if (direction == (uint32_t) HAL_I3C_DIRECTION_WRITE)
      {
#if defined(USE_ASSERT_DBG_PARAM) || (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1))
        tx_cumul_size_byte += data_size_byte;
#endif /* USE_ASSERT_DBG_PARAM | USE_HAL_CHECK_PARAM */
        p_ctx->nb_tx_frame++;
      }
      else  /* direction == HAL_I3C_DIRECTION_READ */
      {
#if defined(USE_ASSERT_DBG_PARAM) || (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1))
        tx_cumul_size_byte += nb_define_bytes;
        rx_cumul_size_byte += (data_size_byte - nb_define_bytes);
#endif /* USE_ASSERT_DBG_PARAM | USE_HAL_CHECK_PARAM */
      }

      /* Generate a stop condition at the end */
      if (i == (nb_desc - 1U))
      {
        stop_condition = LL_I3C_GENERATE_STOP;
      }

      /* Update control buffer value for the CCC command */
      p_ctx->p_tc_data[double_i] = nb_define_bytes | ((uint32_t)p_desc[i].ccc << I3C_CR_CCC_Pos)
                                   | LL_I3C_CONTROLLER_MTYPE_CCC | LL_I3C_GENERATE_RESTART;

      /* Update control buffer value for target address */
      p_ctx->p_tc_data[double_i + 1U] = (data_size_byte - nb_define_bytes) | direction |
                                        ((uint32_t)p_desc[i].tgt_addr << I3C_CR_ADD_Pos)
                                        | LL_I3C_CONTROLLER_MTYPE_DIRECT | stop_condition;
      i++;
      double_i += 2U;
    }
  }

  ASSERT_DBG_PARAM(p_ctx->tx_size_byte == tx_cumul_size_byte);
  ASSERT_DBG_PARAM(p_ctx->rx_size_byte == rx_cumul_size_byte);
  ASSERT_DBG_PARAM((tx_cumul_size_byte == 0U) || (p_ctx->p_tx_data != NULL));
  ASSERT_DBG_PARAM((rx_cumul_size_byte == 0U) || (p_ctx->p_rx_data != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_ctx->tx_size_byte != tx_cumul_size_byte)
      || (p_ctx->rx_size_byte != rx_cumul_size_byte)
      || ((tx_cumul_size_byte != 0U) && (p_ctx->p_tx_data == NULL))
      || ((rx_cumul_size_byte != 0U) && (p_ctx->p_rx_data == NULL)))
  {
    hal_status = HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  return hal_status;
}

/**
  * @brief  Start transfer Direct CCC Command, I3C private or I2C transfer in polling mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_ctx  Pointer to a hal_i3c_transfer_ctx_t structure. It can be reused to start again the
                   same transfer. This transfer context is built by @ref HAL_I3C_CTRL_BuildTransferCtxPrivate() or
  *                @ref HAL_I3C_CTRL_BuildTransferCtxCCC().
  * @param  timeout_ms  Timeout duration in milliseconds
  * @note   The function @ref HAL_I3C_CTRL_BuildTransferCtxPrivate() must be called before initiating a private
  *         transfer or the function @ref HAL_I3C_CTRL_BuildTransferCtxCCC() must be called before initiating a
  *         CCC transfer.
  * @note   The Tx FIFO threshold @ref HAL_I3C_TX_FIFO_THRESHOLD_1_2 is not allowed when the transfer descriptor
  *         contains multiple CCC direct frames.
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_BUSY  Concurrent process ongoing
  * @retval HAL_TIMEOUT  Operation exceeds user timeout
  * @retval HAL_ERROR  Operation completed with error
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_CTRL_Transfer(hal_i3c_handle_t *hi3c, const hal_i3c_transfer_ctx_t *p_ctx, uint32_t timeout_ms)
{
  I3C_TypeDef *p_i3cx;
  hal_status_t hal_status = HAL_OK;
  uint32_t tickstart;
  uint32_t exit_condition;
  uint32_t it_source;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_ctx != NULL);
  ASSERT_DBG_PARAM((p_ctx->rx_size_byte == 0U) || (p_ctx->p_rx_data != NULL));
  ASSERT_DBG_PARAM((p_ctx->tx_size_byte == 0U) || (p_ctx->p_tx_data != NULL));
  ASSERT_DBG_PARAM(p_ctx->p_tc_data != NULL);
  ASSERT_DBG_PARAM(p_ctx->tc_size_word != 0U);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_ctx == NULL)
      || ((p_ctx->p_rx_data == NULL) && (p_ctx->rx_size_byte != 0U))
      || ((p_ctx->p_tx_data == NULL) && (p_ctx->tx_size_byte != 0U))
      || (p_ctx->p_tc_data == NULL)
      || (p_ctx->tc_size_word == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_i3cx = I3C_GET_INSTANCE(hi3c);

  if ((LL_I3C_GetTxFIFOThreshold(p_i3cx) == LL_I3C_TXFIFO_THRESHOLD_1_2)
      && (p_ctx->nb_tx_frame > 1U)
      && (((uint32_t)p_ctx->transfer_mode & I3C_OPERATION_TYPE_MASK) == LL_I3C_CONTROLLER_MTYPE_DIRECT))
  {
    return HAL_ERROR;
  }

  HAL_CHECK_UPDATE_STATE(hi3c, global_state, HAL_I3C_STATE_IDLE, HAL_I3C_STATE_TX_RX);

  /* Disable notification IT */
  it_source =  LL_I3C_GetEnabledIT(p_i3cx);
  LL_I3C_DisableIT(p_i3cx, it_source);

#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
  hi3c->last_error_codes = HAL_I3C_ERROR_NONE;
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */
  hi3c->p_tc_data = p_ctx->p_tc_data;
  hi3c->p_tx_data = p_ctx->p_tx_data;
  hi3c->p_rx_data = p_ctx->p_rx_data;
  hi3c->tc_count_word = p_ctx->tc_size_word;
  hi3c->tx_count_byte = p_ctx->tx_size_byte;
  hi3c->rx_count_byte = p_ctx->rx_size_byte;

  /* Check on the deactivation of the arbitration */
  if (((uint32_t)p_ctx->transfer_mode & I3C_ARBITRATION_HEADER_MASK) == I3C_ARBITRATION_HEADER_MASK)
  {
    LL_I3C_DisableArbitrationHeader(p_i3cx);
  }
  else
  {
    LL_I3C_EnableArbitrationHeader(p_i3cx);
  }

  /* Check on the Tx threshold to know the Tx treatment process: byte or word */
  if (LL_I3C_GetTxFIFOThreshold(p_i3cx) == LL_I3C_TXFIFO_THRESHOLD_1_8)
  {
    hi3c->p_tx_func = &I3C_TransmitByteTreatment;
  }
  else
  {
    hi3c->p_tx_func = &I3C_TransmitWordTreatment;
  }

  /* Check on the Rx threshold to know the Rx treatment process: byte or word */
  if (LL_I3C_GetRxFIFOThreshold(p_i3cx) == LL_I3C_RXFIFO_THRESHOLD_1_8)
  {
    hi3c->p_rx_func = &I3C_ReceiveByteTreatment;
  }
  else
  {
    hi3c->p_rx_func = &I3C_ReceiveWordTreatment;
  }

  tickstart = HAL_GetTick();

  if (LL_I3C_IsEnabledControlFIFO(p_i3cx) != 0U)
  {
    /* Initiate a Start condition */
    LL_I3C_RequestTransfer(p_i3cx);
  }
  else
  {
    LL_I3C_WriteControlWord(p_i3cx, *hi3c->p_tc_data);
    hi3c->p_tc_data++;
    hi3c->tc_count_word--;
  }

