MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
  /* Do while until FC (Frame Complete) is 1U or timeout */
  do
  {
    I3C_ControlDataTreatment(hi3c);
    hi3c->p_tx_func(hi3c);
    hi3c->p_rx_func(hi3c);

    /* Check for the timeout */
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
      {
        hal_status = HAL_TIMEOUT;
        break;
      }
    }

    if ((LL_I3C_IsActiveFlag_FC(p_i3cx) != 0U) && (hi3c->tc_count_word > 0U))
    {
      LL_I3C_ClearFlag_FC(p_i3cx);
      /* Then Initiate a Start condition */
      LL_I3C_RequestTransfer(p_i3cx);
    }

    /* Calculate exit_condition value based on frame complete or error flags */
    exit_condition = LL_I3C_IsActiveFlag(p_i3cx, LL_I3C_EVR_FCF | LL_I3C_EVR_ERRF);
  } while ((exit_condition  == 0U) || ((exit_condition != 0U) && (hi3c->tc_count_word > 0U)));

  LL_I3C_ClearFlag_FC(p_i3cx);

  if (hal_status == HAL_OK)
  {
    if ((hi3c->tx_count_byte != 0U) && (hi3c->rx_count_byte != 0U))
    {
      hal_status = HAL_ERROR;
    }

    if (LL_I3C_IsActiveFlag_ERR(p_i3cx) != 0U)
    {
      LL_I3C_ClearFlag_ERR(p_i3cx);

#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
      I3C_GetErrorSources(hi3c);
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */

      hal_status = HAL_ERROR;
    }
  }

  I3C_StateIdle(hi3c);

  /* Enable notification IT */
  LL_I3C_EnableIT(p_i3cx, it_source);

  return hal_status;
}

/**
  * @brief  Start transfer Direct CCC Command, I3C private or I2C transfer in interrupt mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_ctx  Pointer to a hal_i3c_transfer_ctx_t structure. It can be reused to start again the
                   same transfer. This transfer context is filled by @ref HAL_I3C_CTRL_BuildTransferCtxPrivate() or
  *                @ref HAL_I3C_CTRL_BuildTransferCtxCCC().
  * @note   The function @ref HAL_I3C_CTRL_BuildTransferCtxPrivate() must be called before initiate a private transfer
  *         or the function @ref HAL_I3C_CTRL_BuildTransferCtxCCC() must be called before initiate a CCC transfer.
  * @note   The Tx FIFO threshold @ref HAL_I3C_TX_FIFO_THRESHOLD_1_2 is not allowed when the transfer descriptor
  *         contains multiple CCC direct frames.
  * @note   This function must be called to transfer read/write I3C or I2C private data or a direct read/write CCC.
  * @note   The tx_buf.size_byte must be equal to the sum of all tx_buf.size_byte exist in the descriptor.
  * @note   The rx_buf.size_byte must be equal to the sum of all rx_buf.size_byte exist in the descriptor.
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_BUSY  Concurrent process ongoing
  * @retval HAL_ERROR  Operation completed with error
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_CTRL_Transfer_IT(hal_i3c_handle_t *hi3c, const hal_i3c_transfer_ctx_t *p_ctx)
{
  I3C_TypeDef *p_i3cx;
  hal_status_t hal_status = HAL_OK;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_ctx != NULL);
  ASSERT_DBG_PARAM((p_ctx->rx_size_byte == 0U) || (p_ctx->p_rx_data != NULL));
  ASSERT_DBG_PARAM((p_ctx->tx_size_byte == 0U) || (p_ctx->p_tx_data != NULL));
  ASSERT_DBG_PARAM(p_ctx->p_tc_data != NULL);
  ASSERT_DBG_PARAM(p_ctx->tc_size_word != 0U);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_ctx == NULL)
      || ((p_ctx->p_rx_data == NULL) && (p_ctx->rx_size_byte != 0U))
      || ((p_ctx->p_tx_data == NULL) && (p_ctx->tx_size_byte != 0U))
      || (p_ctx->p_tc_data == NULL)
      || (p_ctx->tc_size_word == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_i3cx = I3C_GET_INSTANCE(hi3c);

  if ((LL_I3C_GetTxFIFOThreshold(p_i3cx) == LL_I3C_TXFIFO_THRESHOLD_1_2)
      && (p_ctx->nb_tx_frame > 1U)
      && (((uint32_t)p_ctx->transfer_mode & I3C_OPERATION_TYPE_MASK) == LL_I3C_CONTROLLER_MTYPE_DIRECT))
  {
    return HAL_ERROR;
  }

  HAL_CHECK_UPDATE_STATE(hi3c, global_state, HAL_I3C_STATE_IDLE, HAL_I3C_STATE_TX_RX);

#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
  hi3c->last_error_codes = HAL_I3C_ERROR_NONE;
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */

  if (hi3c->listen == I3C_LISTEN_DISABLED)
  {
    hi3c->p_isr_func = I3C_Ctrl_Multiple_Xfer_ISR;
  }
  else
  {
    hi3c->p_isr_func = I3C_Ctrl_Multiple_Xfer_Listen_Event_ISR;
  }

  /* Check on the deactivation of the arbitration */
  if (((uint32_t)p_ctx->transfer_mode & I3C_ARBITRATION_HEADER_MASK) == I3C_ARBITRATION_HEADER_MASK)
  {
    LL_I3C_DisableArbitrationHeader(p_i3cx);
  }
  else
  {
    LL_I3C_EnableArbitrationHeader(p_i3cx);
  }

  hi3c->p_tc_data = p_ctx->p_tc_data;
  hi3c->p_tx_data = p_ctx->p_tx_data;
  hi3c->p_rx_data = p_ctx->p_rx_data;
  hi3c->tc_count_word = p_ctx->tc_size_word;
  hi3c->tx_count_byte = p_ctx->tx_size_byte;
  hi3c->rx_count_byte = p_ctx->rx_size_byte;

  /* Check on the Tx threshold to know the Tx treatment process: byte or word */
  if (LL_I3C_GetTxFIFOThreshold(p_i3cx) == LL_I3C_TXFIFO_THRESHOLD_1_8)
  {
    hi3c->p_tx_func = &I3C_TransmitByteTreatment_IT;
  }
  else
  {
    hi3c->p_tx_func = &I3C_TransmitWordTreatment_IT;
  }

  /* Check on the Rx threshold to know the Rx treatment process: byte or word */
  if (LL_I3C_GetRxFIFOThreshold(p_i3cx) == LL_I3C_RXFIFO_THRESHOLD_1_8)
  {
    hi3c->p_rx_func = &I3C_ReceiveByteTreatment_IT;
  }
  else
  {
    hi3c->p_rx_func = &I3C_ReceiveWordTreatment_IT;
  }

  LL_I3C_EnableIT(p_i3cx, (LL_I3C_CTRL_TX_IT | LL_I3C_CTRL_RX_IT));

  /* Initiate a Start condition */
  LL_I3C_RequestTransfer(p_i3cx);

  return hal_status;
}

#if defined(USE_HAL_I3C_DMA) && (USE_HAL_I3C_DMA == 1)
/**
  * @brief  Start transfer Direct CCC Command, I3C private or I2C transfer in DMA mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_ctx  Pointer to a hal_i3c_transfer_ctx_t structure. It can be reused to start again the
                   same transfer. This transfer context is filled by @ref HAL_I3C_CTRL_BuildTransferCtxPrivate() or
  *                @ref HAL_I3C_CTRL_BuildTransferCtxCCC().
  * @note   The function @ref HAL_I3C_CTRL_BuildTransferCtxPrivate() must be called before initiate a private transfer
  *         or the function @ref HAL_I3C_CTRL_BuildTransferCtxCCC() must be called before initiate a CCC transfer.
  * @note   The Tx FIFO threshold @ref HAL_I3C_TX_FIFO_THRESHOLD_1_2 is not allowed when the transfer descriptor
  *         contains multiple CCC direct frames.
  * @note   The tx_buf.size_byte must be equal to the sum of all tx_buf.size_byte exist in the descriptor.
  * @note   The rx_buf.size_byte must be equal to the sum of all rx_buf.size_byte exist in the descriptor.
  * @note   This function must be called to transfer read/write private data or a direct read/write CCC command.
  * @note   DMA widths:
  *         - Tc: always words.
  *         - Tx: threshold 1/8 -> bytes; threshold 1/2 -> words.
  *         - Rx: threshold 1/8 -> bytes; threshold 1/2 -> words.
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_BUSY  Concurrent process ongoing
  * @retval HAL_ERROR  Operation completed with error
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_CTRL_Transfer_DMA(hal_i3c_handle_t *hi3c, const hal_i3c_transfer_ctx_t *p_ctx)
{
  I3C_TypeDef *p_i3cx;
  hal_status_t hal_status = HAL_OK;
  hal_status_t control_dma_status;
  hal_status_t tx_dma_status = HAL_OK;
  hal_status_t rx_dma_status = HAL_OK;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_ctx != NULL);
  ASSERT_DBG_PARAM((p_ctx->rx_size_byte == 0U) || (p_ctx->p_rx_data != NULL));
  ASSERT_DBG_PARAM((p_ctx->rx_size_byte == 0U) || (hi3c->hdma_rx != NULL));
  ASSERT_DBG_PARAM((p_ctx->tx_size_byte == 0U) || (p_ctx->p_tx_data != NULL));
  ASSERT_DBG_PARAM((p_ctx->tx_size_byte == 0U) || (hi3c->hdma_tx != NULL));
  ASSERT_DBG_PARAM(p_ctx->p_tc_data != NULL);
  ASSERT_DBG_PARAM(p_ctx->tc_size_word != 0U);
  ASSERT_DBG_PARAM(hi3c->hdma_tc != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_ctx == NULL)
      || (((p_ctx->p_rx_data == NULL) || (hi3c->hdma_rx == NULL)) && (p_ctx->rx_size_byte != 0U))
      || (((p_ctx->p_tx_data == NULL) || (hi3c->hdma_tx == NULL)) && (p_ctx->tx_size_byte != 0U))
      || (p_ctx->p_tc_data == NULL)
      || (hi3c->hdma_tc == NULL)
      || (p_ctx->tc_size_word == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

