MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
  p_i3cx = I3C_GET_INSTANCE(hi3c);

  if ((LL_I3C_GetTxFIFOThreshold(p_i3cx) == LL_I3C_TXFIFO_THRESHOLD_1_2)
      && (p_ctx->nb_tx_frame > 1U)
      && (((uint32_t)p_ctx->transfer_mode & I3C_OPERATION_TYPE_MASK) == LL_I3C_CONTROLLER_MTYPE_DIRECT))
  {
    return HAL_ERROR;
  }

  HAL_CHECK_UPDATE_STATE(hi3c, global_state, HAL_I3C_STATE_IDLE, HAL_I3C_STATE_TX_RX);

#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
  hi3c->last_error_codes = HAL_I3C_ERROR_NONE;
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */
  hi3c->p_isr_func = I3C_Ctrl_Multiple_Xfer_DMA_ISR;

  /* Check on the deactivation of the arbitration */
  if (((uint32_t)p_ctx->transfer_mode & I3C_ARBITRATION_HEADER_MASK) == I3C_ARBITRATION_HEADER_MASK)
  {
    LL_I3C_DisableArbitrationHeader(p_i3cx);
  }
  else
  {
    LL_I3C_EnableArbitrationHeader(p_i3cx);
  }

  /*------------------------------------ I3C DMA channel for Control Data --------------------------------------------*/
  hi3c->hdma_tc->p_xfer_cplt_cb = I3C_DMAControlTransmitCplt;
  hi3c->hdma_tc->p_xfer_error_cb = I3C_DMAError;
  hi3c->hdma_tc->p_xfer_abort_cb = I3C_DMAError;

  control_dma_status = HAL_DMA_StartDirectXfer_IT_Opt(hi3c->hdma_tc, (uint32_t)p_ctx->p_tc_data,
                                                      (uint32_t)&p_i3cx->CR, p_ctx->tc_size_word * 4U,
                                                      HAL_DMA_OPT_IT_NONE);

  /*------------------------------------ I3C DMA channel for the Rx Data ---------------------------------------------*/
  if (hi3c->hdma_rx != NULL)
  {
    hi3c->hdma_rx->p_xfer_abort_cb = I3C_DMAError;
    if (p_ctx->rx_size_byte != 0U)
    {
      hi3c->hdma_rx->p_xfer_cplt_cb = I3C_DMADataReceiveCplt;
      hi3c->hdma_rx->p_xfer_error_cb = I3C_DMAError;

      /* Check on the Rx threshold to know the Rx treatment process: byte or word */
      if (LL_I3C_GetRxFIFOThreshold(p_i3cx) == LL_I3C_RXFIFO_THRESHOLD_1_8)
      {
        rx_dma_status = HAL_DMA_StartDirectXfer_IT_Opt(hi3c->hdma_rx, (uint32_t)&p_i3cx->RDR,
                                                       (uint32_t)p_ctx->p_rx_data, p_ctx->rx_size_byte,
                                                       HAL_DMA_OPT_IT_NONE);
      }
      else
      {
        rx_dma_status = HAL_DMA_StartDirectXfer_IT_Opt(hi3c->hdma_rx, (uint32_t)&p_i3cx->RDWR,
                                                       (uint32_t)p_ctx->p_rx_data, I3C_RoundUp4(p_ctx->rx_size_byte),
                                                       HAL_DMA_OPT_IT_NONE);
      }
    }
  }

  /*------------------------------------ I3C DMA channel for the Tx Data ---------------------------------------------*/
  if (hi3c->hdma_tx != NULL)
  {
    hi3c->hdma_tx->p_xfer_abort_cb = I3C_DMAError;
    if (p_ctx->tx_size_byte != 0U)
    {
      hi3c->hdma_tx->p_xfer_cplt_cb = I3C_DMADataTransmitCplt;
      hi3c->hdma_tx->p_xfer_error_cb = I3C_DMAError;

      /* Check on the Tx threshold to know the Tx treatment process: byte or word */
      if (LL_I3C_GetTxFIFOThreshold(p_i3cx) == LL_I3C_TXFIFO_THRESHOLD_1_8)
      {
        tx_dma_status = HAL_DMA_StartDirectXfer_IT_Opt(hi3c->hdma_tx, (uint32_t)p_ctx->p_tx_data,
                                                       (uint32_t)&p_i3cx->TDR, p_ctx->tx_size_byte,
                                                       HAL_DMA_OPT_IT_NONE);
      }
      else
      {
        tx_dma_status = HAL_DMA_StartDirectXfer_IT_Opt(hi3c->hdma_tx, (uint32_t)p_ctx->p_tx_data,
                                                       (uint32_t)&p_i3cx->TDWR, I3C_RoundUp4(p_ctx->tx_size_byte),
                                                       HAL_DMA_OPT_IT_NONE);
      }
    }
  }

  /* Check if DMA process is well started */
  uint32_t last_error_codes = hi3c->last_error_codes;
  if ((control_dma_status == HAL_OK) && (tx_dma_status == HAL_OK)
      && (rx_dma_status == HAL_OK) && (last_error_codes == HAL_I3C_ERROR_NONE))
  {
    LL_I3C_EnableIT(p_i3cx, LL_I3C_XFER_DMA);
    LL_I3C_EnableDMAReq_Control(p_i3cx);

    if (p_ctx->rx_size_byte != 0U)
    {
      LL_I3C_EnableDMAReq_RX(p_i3cx);
    }

    if (p_ctx->tx_size_byte != 0U)
    {
      LL_I3C_EnableDMAReq_TX(p_i3cx);
    }

    /* Initiate a Start condition */
    LL_I3C_RequestTransfer(p_i3cx);
  }
  else
  {
    /* Set callback to NULL if DMA started */
    if (HAL_DMA_Abort(hi3c->hdma_tc) == HAL_OK)
    {
      hi3c->hdma_tc->p_xfer_cplt_cb = NULL;
      hi3c->hdma_tc->p_xfer_error_cb = NULL;
    }

    /* Set callback to NULL if DMA started */
    if (hi3c->hdma_tx != NULL)
    {
      if (HAL_DMA_Abort(hi3c->hdma_tx) == HAL_OK)
      {
        hi3c->hdma_tx->p_xfer_cplt_cb = NULL;
        hi3c->hdma_tx->p_xfer_error_cb = NULL;
      }
    }

    /* Set callback to NULL if DMA started */
    if (hi3c->hdma_rx != NULL)
    {
      if (HAL_DMA_Abort(hi3c->hdma_rx) == HAL_OK)
      {
        hi3c->hdma_rx->p_xfer_cplt_cb = NULL;
        hi3c->hdma_rx->p_xfer_error_cb = NULL;
      }
    }
#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
    hi3c->last_error_codes = HAL_I3C_ERROR_DMA;
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */
    hal_status = HAL_ERROR;
    I3C_StateIdle(hi3c);
  }

  return hal_status;
}
#endif /* USE_HAL_I3C_DMA */
/**
  * @brief  Controller assigns dynamic addresses (broadcast ENTDAA CCC) in polling mode.
  * ENTDAA is an iterative bus procedure: each target responds in turn with its 48-bit payload,
  * after which the controller application must immediately associate a dynamic address via HAL_I3C_CTRL_SetDynAddr().
  * The hardware then automatically re-issues ENTDAA until "target not detected". This function must be called in loop
  * until p_target_detection_status indicates that no target is detected.
  * @param  hi3c   I3C handle (controller mode required).
  * @param  p_target_payload  Pointer receiving the 48-bit target payload (PID[32] | BCR[8] | DCR[8]).
  * @param  option HAL_I3C_DYN_ADDR_ONLY_ENTDAA or HAL_I3C_DYN_ADDR_RSTDAA_THEN_ENTDAA.
  * @param  p_target_detection_status  Pointer to the target detection status.
  * @param  timeout_ms Timeout in milliseconds for internal flag waits.
  * @note Arbitration header is enabled.
  * @note While (*p_target_detection_status == HAL_I3C_TGT_DETECTED):
  *        - Retrieve the payload.
  *        - Call HAL_I3C_CTRL_SetDynAddr() to assign a dynamic address.
  *        - Call HAL_I3C_CTRL_DynAddrAssign() again to detect the next target.
  *       At the end of the DAA procedure (*p_target_detection_status == HAL_I3C_TGT_NOT_DETECTED):
  *        - Call HAL_I3C_CTRL_SetConfigBusDevices() to register capabilities.
  * @note Option HAL_I3C_DYN_ADDR_RSTDAA_THEN_ENTDAA inserts an initial RSTDAA CCC frame before ENTDAA.
  * @retval HAL_OK       Operation completed successfully. The DAA process is completed if
  *                      (*p_target_detection_status == HAL_I3C_TGT_NOT_DETECTED).
  * @retval HAL_ERROR    Operation completed with error.
  * @retval HAL_TIMEOUT  Operation exceeds user timeout.
  * @retval HAL_BUSY     Concurrent process ongoing.
  */
hal_status_t HAL_I3C_CTRL_DynAddrAssign(hal_i3c_handle_t *hi3c, uint64_t *p_target_payload,
                                        hal_i3c_dyn_addr_opt_t option,
                                        hal_i3c_target_detection_status_t *p_target_detection_status,
                                        uint32_t timeout_ms)
{
  I3C_TypeDef *p_i3cx;
  hal_status_t hal_status = HAL_OK;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_target_payload != NULL);
  ASSERT_DBG_PARAM(IS_I3C_ENTDAA_OPTION(option));
  ASSERT_DBG_PARAM(p_target_detection_status != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_DAA);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_target_payload == NULL) || (p_target_detection_status == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

