MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
  p_i3cx = I3C_GET_INSTANCE(hi3c);

#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
  hi3c->last_error_codes = HAL_I3C_ERROR_NONE;
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */

  *p_target_detection_status = HAL_I3C_TGT_NOT_DETECTED;

  if (hi3c->global_state == HAL_I3C_STATE_IDLE)
  {
    HAL_CHECK_UPDATE_STATE(hi3c, global_state, HAL_I3C_STATE_IDLE, HAL_I3C_STATE_DAA);

    LL_I3C_EnableArbitrationHeader(p_i3cx);

    if (option == HAL_I3C_DYN_ADDR_RSTDAA_THEN_ENTDAA)
    {
      /* Launch a RSTDAA procedure */
      LL_I3C_ControllerHandleCCC(p_i3cx, LL_I3C_BROADCAST_RSTDAA, 0UL, LL_I3C_GENERATE_STOP);

      hal_status = I3C_WaitForFlagSet(hi3c, LL_I3C_EVR_FCF, timeout_ms);
      LL_I3C_ClearFlag_FC(p_i3cx);
    }

    if (hal_status == HAL_OK)
    {
      /* Launch a ENTDAA procedure */
      LL_I3C_ControllerHandleCCC(p_i3cx, LL_I3C_BROADCAST_ENTDAA, 0UL, LL_I3C_GENERATE_STOP);
    }

  }

  if (hal_status == HAL_OK)
  {
#if defined(USE_HAL_CHECK_PROCESS_STATE) && (USE_HAL_CHECK_PROCESS_STATE == 1)
    if (hi3c->global_state != HAL_I3C_STATE_DAA)
    {
      return HAL_BUSY;
    }
#endif /* USE_HAL_CHECK_PROCESS_STATE */

    hal_status = I3C_WaitForFlagSet(hi3c, (LL_I3C_EVR_FCF | I3C_EVR_TXFNFF), timeout_ms);

    /* Check Tx FIFO is not full */
    if (LL_I3C_IsActiveFlag_TXFNF(p_i3cx) != 0U)
    {
      /* Check on the Rx FIFO threshold to know the Rx treatment process: byte or word */
      if (LL_I3C_GetRxFIFOThreshold(p_i3cx) == LL_I3C_RXFIFO_THRESHOLD_1_8)
      {
        for (uint32_t index = 0U; index < 8U; index++)
        {
          *p_target_payload |= (uint64_t)((uint64_t)LL_I3C_ReceiveData8(p_i3cx) << (index * 8U));
        }
      }
      else
      {
        *p_target_payload = (uint64_t)LL_I3C_ReceiveData32(p_i3cx);
        *p_target_payload |= (uint64_t)((uint64_t)LL_I3C_ReceiveData32(p_i3cx) << 32U);
      }

      *p_target_detection_status = HAL_I3C_TGT_DETECTED;
    }
    else
    {
      LL_I3C_ClearFlag_FC(p_i3cx);
    }
  }

  if ((hal_status != HAL_OK) || (*p_target_detection_status == HAL_I3C_TGT_NOT_DETECTED))
  {
    I3C_StateIdle(hi3c);
  }

  return hal_status;
}

/**
  * @brief  Controller assigns dynamic addresses (broadcast ENTDAA CCC) in interrupt mode.
  * ENTDAA is iterative: each target responds with a 48-bit payload (PID + BCR + DCR), after which
  * the controller application must immediately associate a dynamic address via HAL_I3C_CTRL_SetDynAddr().
  * The hardware continues issuing ENTDAA until no further target responds.
  * @param  hi3c   I3C handle (controller mode required).
  * @param  option HAL_I3C_DYN_ADDR_ONLY_ENTDAA or HAL_I3C_DYN_ADDR_RSTDAA_THEN_ENTDAA.
  * @note Option HAL_I3C_DYN_ADDR_RSTDAA_THEN_ENTDAA performs a preliminary RSTDAA CCC frame, then ENTDAA.
  * @note Arbitration header is forced enabled during ENTDAA.
  * @note After completion, call HAL_I3C_CTRL_SetConfigBusDevices() to register capabilities (addresses, IBI, etc.).
  * @retval HAL_OK    ENTDAA sequence accepted and configured; ISR will handle progress.
  * @retval HAL_BUSY  Concurrent process ongoing.
  */
hal_status_t HAL_I3C_CTRL_DynAddrAssign_IT(hal_i3c_handle_t *hi3c, hal_i3c_dyn_addr_opt_t option)
{
  I3C_TypeDef *p_i3cx;
  hal_status_t hal_status = HAL_OK;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(IS_I3C_ENTDAA_OPTION(option));
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  p_i3cx = I3C_GET_INSTANCE(hi3c);

  HAL_CHECK_UPDATE_STATE(hi3c, global_state, HAL_I3C_STATE_IDLE, HAL_I3C_STATE_DAA);

#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
  hi3c->last_error_codes = HAL_I3C_ERROR_NONE;
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */
  hi3c->p_isr_func = I3C_Ctrl_DAA_ISR;

  LL_I3C_EnableIT(p_i3cx, LL_I3C_CTRL_DAA_IT);
  LL_I3C_EnableArbitrationHeader(p_i3cx);

  /* Launch a RSTDAA procedure before launch ENTDAA */
  if (option == HAL_I3C_DYN_ADDR_RSTDAA_THEN_ENTDAA)
  {
    /* Write RSTDAA CCC information in the control register */
    LL_I3C_ControllerHandleCCC(p_i3cx, LL_I3C_BROADCAST_RSTDAA, 0UL, LL_I3C_GENERATE_RESTART);
  }
  else
  {
    /* Write ENTDAA CCC information in the control register */
    LL_I3C_ControllerHandleCCC(p_i3cx, LL_I3C_BROADCAST_ENTDAA, 0UL, LL_I3C_GENERATE_STOP);
  }

  return hal_status;
}

/**
  * @brief  Controller Set dynamic address.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  target_address  Value of the dynamic address to be assigned
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_ERROR  Operation completed with error
  */
hal_status_t HAL_I3C_CTRL_SetDynAddr(const hal_i3c_handle_t *hi3c, uint8_t target_address)
{
  I3C_TypeDef *p_i3cx;
  hal_status_t hal_status = HAL_OK;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_DAA);

  p_i3cx = I3C_GET_INSTANCE(hi3c);

  /* Check if Tx FIFO requests data */
  if (LL_I3C_IsActiveFlag_TXFNF(p_i3cx) != 0U)
  {
    /* Write device address in the TDR register */
    LL_I3C_TransmitData8(p_i3cx, target_address);
  }
  else
  {
    hal_status = HAL_ERROR;
  }

  return hal_status;
}

/**
  * @brief  Check whether an I3C target device is ready.
  * @param  hi3c              Pointer to a @ref hal_i3c_handle_t
  * @param  target_address    Dynamic address of the target device
  * @param  timeout_ms        Polling timeout (in ms)
  * @retval HAL_OK       Frame complete (FCF) detected: target is ready.
  * @retval HAL_TIMEOUT  User timeout elapsed: target not ready
  * @retval HAL_ERROR    Internal failure while waiting for hardware flags
  */
hal_status_t HAL_I3C_CTRL_PoolForDeviceI3cReady(hal_i3c_handle_t *hi3c, uint8_t target_address, uint32_t timeout_ms)
{
  i3c_device_t device;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hi3c, global_state, HAL_I3C_STATE_IDLE, HAL_I3C_STATE_TX);

  device.address = target_address;
  device.message_type = LL_I3C_CONTROLLER_MTYPE_PRIVATE;

  return I3C_Ctrl_PoolForDeviceReady(hi3c, &device, timeout_ms);
}

/**
  * @brief  Check whether an I2C target device is ready.
  * @param  hi3c              Pointer to a @ref hal_i3c_handle_t
  * @param  target_address    Address of the target device
  * @param  timeout_ms        Polling timeout (in ms)
  * @retval HAL_OK       Frame complete (FCF) detected: target is ready.
  * @retval HAL_TIMEOUT  User timeout elapsed: target not ready
  * @retval HAL_ERROR    Internal failure while waiting for hardware flags
  */
hal_status_t HAL_I3C_CTRL_PoolForDeviceI2cReady(hal_i3c_handle_t *hi3c, uint8_t target_address, uint32_t timeout_ms)
{
  i3c_device_t device;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hi3c, global_state, HAL_I3C_STATE_IDLE, HAL_I3C_STATE_TX);

