MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
  device.address = target_address;
  device.message_type = LL_I3C_CONTROLLER_MTYPE_LEGACY_I2C;

  return I3C_Ctrl_PoolForDeviceReady(hi3c, &device, timeout_ms);
}

/**
  * @brief  Controller generates patterns (target reset pattern or HDR exit pattern) with arbitration in polling mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  pattern  The generated pattern.
  * @param  timeout_ms  Timeout duration in ms.
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_TIMEOUT  Operation exceeds user timeout
  * @retval HAL_BUSY  Concurrent process ongoing
  * @retval HAL_ERROR  Operation completed with error
  */
hal_status_t HAL_I3C_CTRL_GeneratePatterns(hal_i3c_handle_t *hi3c, hal_i3c_pattern_opt_t pattern, uint32_t timeout_ms)
{
  I3C_TypeDef *p_i3cx;
  hal_status_t hal_status = HAL_OK;
  __IO uint32_t exit_condition;
  uint32_t tickstart;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(IS_I3C_PATTERN(pattern));
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  p_i3cx = I3C_GET_INSTANCE(hi3c);

  HAL_CHECK_UPDATE_STATE(hi3c, global_state, HAL_I3C_STATE_IDLE, HAL_I3C_STATE_TX);

#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
  hi3c->last_error_codes = HAL_I3C_ERROR_NONE;
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */

  /* The target reset pattern is sent after the issued message header */
  if (pattern == HAL_I3C_PATTERN_TGT_RESET)
  {
    LL_I3C_EnableResetPattern(p_i3cx);
    LL_I3C_DisableExitPattern(p_i3cx);
  }
  /* The HDR exit pattern is sent after the issued message header */
  else
  {
    LL_I3C_DisableResetPattern(p_i3cx);
    LL_I3C_EnableExitPattern(p_i3cx);
  }

  /* Write message control register */
  LL_I3C_ControllerHeaderStop(p_i3cx);

  /* Calculate exit_condition value based on frame complete or error flags */
  exit_condition = LL_I3C_IsActiveFlag(p_i3cx, LL_I3C_EVR_FCF | LL_I3C_EVR_ERRF);

  tickstart = HAL_GetTick();

  while (exit_condition == 0U)
  {
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
      {
        hal_status = HAL_TIMEOUT;
        break;
      }
    }
    /* Calculate exit_condition value based on frame complete or error flags */
    exit_condition = LL_I3C_IsActiveFlag(p_i3cx, LL_I3C_EVR_FCF | LL_I3C_EVR_ERRF);
  }

  if (hal_status == HAL_OK)
  {
    if (LL_I3C_IsActiveFlag_FC(p_i3cx) != 0U)
    {
      LL_I3C_ClearFlag_FC(p_i3cx);
    }
    else
    {
      LL_I3C_ClearFlag_ERR(p_i3cx);
#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
      I3C_GetErrorSources(hi3c);
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */
      hal_status = HAL_ERROR;
    }
  }

  I3C_StateIdle(hi3c);

  return hal_status;
}

/**
  * @brief  Controller generates arbitration (message header {S/Sr + 0x7E addr + W}) in polling mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  timeout_ms  Timeout duration
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_BUSY  Concurrent process ongoing
  * @retval HAL_TIMEOUT  Operation exceeds user timeout
  */
hal_status_t HAL_I3C_CTRL_GenerateArbitration(hal_i3c_handle_t *hi3c, uint32_t timeout_ms)
{
  I3C_TypeDef *p_i3cx;
  hal_status_t hal_status = HAL_OK;
  volatile uint32_t exit_condition;
  uint32_t tickstart;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  p_i3cx = I3C_GET_INSTANCE(hi3c);

  HAL_CHECK_UPDATE_STATE(hi3c, global_state, HAL_I3C_STATE_IDLE, HAL_I3C_STATE_TX);

#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
  hi3c->last_error_codes = HAL_I3C_ERROR_NONE;
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */

  LL_I3C_DisableExitPattern(p_i3cx);
  LL_I3C_DisableResetPattern(p_i3cx);

  /* Write message control register */
  LL_I3C_ControllerHeaderStop(p_i3cx);

  /* Calculate exit_condition value based on frame complete or error flags */
  exit_condition = LL_I3C_IsActiveFlag(p_i3cx, LL_I3C_EVR_FCF | LL_I3C_EVR_ERRF);

  tickstart = HAL_GetTick();

  while (exit_condition == 0U)
  {
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
      {
        hal_status = HAL_TIMEOUT;
        break;
      }
    }
    /* Calculate exit_condition value based on frame complete or error flags */
    exit_condition = LL_I3C_IsActiveFlag(p_i3cx, LL_I3C_EVR_FCF | LL_I3C_EVR_ERRF);
  }

  if (hal_status == HAL_OK)
  {
    if (LL_I3C_IsActiveFlag_FC(p_i3cx) != 0U)
    {
      LL_I3C_ClearFlag_FC(p_i3cx);
    }
    else
    {
      LL_I3C_ClearFlag_ERR(p_i3cx);
#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
      I3C_GetErrorSources(hi3c);
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */
      hal_status = HAL_ERROR;
    }
  }

  I3C_StateIdle(hi3c);

  return hal_status;
}

/**
  * @brief  Recover the stuck SCL in case of CE1 error. It Forces the stop of the SCL clock.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @note   A minimum delay of 150 microseconds is required before emitting another message.
  *         This delay is approximately managed within this function.
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_CTRL_RecoverSCLToIDLE(const hal_i3c_handle_t *hi3c)
{
  hal_status_t hal_status = HAL_OK;
  volatile uint32_t wait_loop_index;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  /* Write message control register */
  LL_I3C_ControllerReleaseStop(I3C_GET_INSTANCE(hi3c));

  /**
    * Wait at least 150 micro seconds
    * Compute number of CPU cycles to wait for, using CMSIS global variable "SystemCoreClock".
    * Delay is approximate (depends on compilation optimization).
    * Computation: variable is divided by 2 to compensate partially CPU processing cycles of wait loop
    * (total shift right of 21 bits, including conversion from frequency in MHz).
    * If system core clock frequency is below 500kHz, delay is fulfilled by few CPU processing cycles.
    */
  wait_loop_index = ((150U * (SystemCoreClock >> 19U)) >> 2U);
  while (wait_loop_index != 0U)
  {
    wait_loop_index--;
  }

  return hal_status;
}
/**
  * @}
  */

/** @addtogroup I3C_Exported_Functions_Group7 Target operational functions
  * @{
A set of functions that manage target I3C operations:
  - HAL_I3C_TGT_Transmit() to transmit private data in polling mode.
  - HAL_I3C_TGT_Transmit_IT() to transmit private data in interrupt mode.
  - HAL_I3C_TGT_Transmit_DMA() to transmit private data in DMA mode.
  - HAL_I3C_TGT_Receive() to receive private data in polling mode.
  - HAL_I3C_TGT_Receive_IT() to receive private data in interrupt mode.
  - HAL_I3C_TGT_Receive_DMA() to receive private data in DMA mode.
  - HAL_I3C_TGT_ControlRoleReq() to send a control-role request in polling mode.
  - HAL_I3C_TGT_ControlRoleReq_IT() to send a control-role request in interrupt mode.
  - HAL_I3C_TGT_HotJoinReq() to send a Hot-Join request in polling mode.
  - HAL_I3C_TGT_HotJoinReq_IT() to send a Hot-Join request in interrupt mode.
  - HAL_I3C_TGT_IBIReq() to send an IBI request in polling mode.
  - HAL_I3C_TGT_IBIReq_IT() to send an IBI request in interrupt mode.
  */

/**
  * @brief  Target transmit private data in polling mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_data  Pointer to the data
  * @param  size_byte  Size of the data in bytes
  * @param  timeout_ms  Timeout duration in milliseconds
  * @note   The dynamic own address must be valid before calling this function.
  *         This function returns HAL_ERROR in these situations:
  *           - Before the ENTDAA (Dynamic Address Assignment) procedure completes.
  *           - Immediately after a RSTDAA (Reset Dynamic Address Assignment) broadcast.
  *           - Before a successful Hot-Join sequence (target not yet assigned a dynamic address).
  * @note   Target FIFO preload data is forced within this API for timing purpose.
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_BUSY  Concurrent process ongoing
  * @retval HAL_TIMEOUT  Operation exceeds user timeout
  * @retval HAL_ERROR  Operation completed with error
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_TGT_Transmit(hal_i3c_handle_t *hi3c, const uint8_t *p_data, uint32_t size_byte,
                                  uint32_t timeout_ms)
{
  I3C_TypeDef *p_i3cx;
  hal_status_t hal_status = HAL_OK;
  uint32_t tickstart;
  uint32_t it_source;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0U);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

