MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
  p_i3cx = I3C_GET_INSTANCE(hi3c);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check the validity of the own dynamic address */
  if (LL_I3C_IsEnabledOwnDynAddress(p_i3cx) == 0U)
  {
    return HAL_ERROR;
  }

  HAL_CHECK_UPDATE_STATE(hi3c, global_state, HAL_I3C_STATE_IDLE, HAL_I3C_STATE_TX);

  /* Disable notification IT */
  it_source =  LL_I3C_GetEnabledIT(p_i3cx);
  LL_I3C_DisableIT(p_i3cx, it_source);

#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
  hi3c->last_error_codes = HAL_I3C_ERROR_NONE;
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */
  hi3c->p_tx_data = p_data;
  hi3c->tx_count_byte = size_byte;

  /* Check on the Tx threshold to know the Tx treatment process: byte or word */
  if (LL_I3C_GetTxFIFOThreshold(p_i3cx) == LL_I3C_TXFIFO_THRESHOLD_1_8)
  {
    hi3c->p_tx_func = &I3C_TransmitByteTreatment;
  }
  else
  {
    hi3c->p_tx_func = &I3C_TransmitWordTreatment;
  }

  /* Set Preload information */
  LL_I3C_ConfigTxPreload(p_i3cx, (uint16_t)hi3c->tx_count_byte);

  /* Init tickstart for timeout management */
  tickstart = HAL_GetTick();

  /* Do while until FC (Frame Complete) is 1U or timeout */
  do
  {
    hi3c->p_tx_func(hi3c);

    /* Check for the timeout_ms */
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
      {
        hal_status = HAL_TIMEOUT;
        break;
      }
    }
    /* Exit loop on Frame complete or error flags */
  } while (LL_I3C_GetFlag(p_i3cx, (LL_I3C_EVR_FCF | I3C_EVR_ERRF)) == 0U);

  LL_I3C_ClearFlag_FC(p_i3cx);

  /* Check if all data bytes are transmitted */
  if ((LL_I3C_GetXferDataCount(p_i3cx) != size_byte) && (hal_status == HAL_OK))
  {
    hal_status = HAL_ERROR;
  }

  if (LL_I3C_IsActiveFlag_ERR(p_i3cx) != 0U)
  {
    LL_I3C_ClearFlag_ERR(p_i3cx);

#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
    I3C_GetErrorSources(hi3c);
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */

    hal_status = HAL_ERROR;
  }

  I3C_StateIdle(hi3c);

  /* Enable notification IT */
  LL_I3C_EnableIT(p_i3cx, it_source);

  return hal_status;
}

/**
  * @brief  Target transmit private data in interrupt mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_data  Pointer to the data
  * @param  size_byte  Size of the data in bytes
  * @note   The dynamic own address must be valid before calling this function.
  *         This function returns HAL_ERROR in these situations:
  *           - Before the ENTDAA (Dynamic Address Assignment) procedure completes.
  *           - Immediately after a RSTDAA (Reset Dynamic Address Assignment) broadcast.
  *           - Before a successful Hot-Join sequence (target not yet assigned a dynamic address).
  * @note   This function returns HAL_ERROR if (DEFIE | RXFNEIE) are set,
  *         HAL_I3C_TGT_ActivateNotification_IT(HAL_I3C_TGT_NOTIFICATION_DEFTGTS) enables these interrupts.
  *         This prevents Rx FIFO contention and mixing CCC payload bytes with private Tx data.
  * @note   This function returns HAL_ERROR if (GRPIE | RXFNEIE) are set,
  *         HAL_I3C_TGT_ActivateNotification_IT(HAL_I3C_TGT_NOTIFICATION_DEFGRPA) enables these interrupts.
  *         This prevents Rx FIFO contention and mixing CCC payload bytes with private Tx data.
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_BUSY  Concurrent process ongoing
  * @retval HAL_ERROR  Operation completed with error
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_TGT_Transmit_IT(hal_i3c_handle_t *hi3c, const uint8_t *p_data, uint32_t size_byte)
{
  I3C_TypeDef *p_i3cx;
  hal_status_t hal_status = HAL_OK;
  uint32_t it_source;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0U);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  p_i3cx = I3C_GET_INSTANCE(hi3c);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Read IER register */
  it_source =  LL_I3C_GetEnabledIT(p_i3cx);

  /* Check if DEF or GRP CCC notifications are enabled */
  if ((I3C_CHECK_IT_SOURCE(it_source, (LL_I3C_IER_DEFIE | LL_I3C_IER_RXFNEIE)) != 0U)
      || (I3C_CHECK_IT_SOURCE(it_source, (LL_I3C_IER_GRPIE | LL_I3C_IER_RXFNEIE)) != 0U))
  {
    return HAL_ERROR;
  }

  /* Check the validity of the own dynamic address */
  if (LL_I3C_IsEnabledOwnDynAddress(p_i3cx) == 0U)
  {
    return HAL_ERROR;
  }

  HAL_CHECK_UPDATE_STATE(hi3c, global_state, HAL_I3C_STATE_IDLE, HAL_I3C_STATE_TX);

#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
  hi3c->last_error_codes = HAL_I3C_ERROR_NONE;
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */
  hi3c->p_tx_data = p_data;
  hi3c->data_size_byte = size_byte;
  hi3c->tx_count_byte = size_byte;
  hi3c->p_isr_func = I3C_Tgt_Tx_ISR;

  /* Check on the Tx threshold to know the Tx treatment process: byte or word */
  if (LL_I3C_GetTxFIFOThreshold(p_i3cx) == LL_I3C_TXFIFO_THRESHOLD_1_8)
  {
    hi3c->p_tx_func = &I3C_TransmitByteTreatment_IT;
  }
  else
  {
    hi3c->p_tx_func = &I3C_TransmitWordTreatment_IT;
  }

  LL_I3C_ConfigTxPreload(p_i3cx, (uint16_t)hi3c->tx_count_byte);
  LL_I3C_EnableIT(p_i3cx, LL_I3C_TGT_TX_IT);

  return hal_status;
}

#if defined(USE_HAL_I3C_DMA) && (USE_HAL_I3C_DMA == 1)
/**
  * @brief  Target transmit private data in DMA mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_data  Pointer to the data
  * @param  size_byte  Size of the data in bytes
  * @note   The dynamic own address must be valid before calling this function.
  *         This function returns HAL_ERROR in these situations:
  *           - Before the ENTDAA (Dynamic Address Assignment) procedure completes.
  *           - Immediately after a RSTDAA (Reset Dynamic Address Assignment) broadcast.
  *           - Before a successful Hot-Join sequence (target not yet assigned a dynamic address).
  * @note   This function returns HAL_ERROR if (DEFIE | RXFNEIE) are set,
  *         HAL_I3C_TGT_ActivateNotification_IT(HAL_I3C_TGT_NOTIFICATION_DEFTGTS) enables these interrupts.
  *         This prevents Rx FIFO contention and mixing CCC payload bytes with private Tx data.
  * @note   This function returns HAL_ERROR if (GRPIE | RXFNEIE) are set,
  *         HAL_I3C_TGT_ActivateNotification_IT(HAL_I3C_TGT_NOTIFICATION_DEFGRPA) enables these interrupts.
  *         This prevents Rx FIFO contention and mixing CCC payload bytes with private Tx data.
  * @note   DMA widths:
  *         - Tx: threshold 1/8 -> bytes; threshold 1/2 -> words.
  *         - Rx: threshold 1/8 -> bytes; threshold 1/2 -> words.
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_BUSY  Concurrent process ongoing
  * @retval HAL_ERROR  Operation completed with error
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_TGT_Transmit_DMA(hal_i3c_handle_t *hi3c, const uint8_t *p_data, uint32_t size_byte)
{
  I3C_TypeDef *p_i3cx;
  hal_status_t hal_status = HAL_OK;
  uint32_t it_source;
  hal_status_t tx_dma_status;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0U);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

