MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
  LL_I3C_ClearFlag_FC(p_i3cx);

  /* Check if all data bytes are received */
  if ((LL_I3C_GetXferDataCount(p_i3cx) != size_byte) && (hal_status == HAL_OK))
  {
    hal_status = HAL_ERROR;
  }

  if (LL_I3C_IsActiveFlag_ERR(p_i3cx) != 0U)
  {
    LL_I3C_ClearFlag_ERR(p_i3cx);

#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
    I3C_GetErrorSources(hi3c);
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */

    hal_status = HAL_ERROR;
  }

  I3C_StateIdle(hi3c);

  /* Enable notification IT */
  LL_I3C_EnableIT(p_i3cx, it_source);

  return hal_status;
}

/**
  * @brief  Target receive private data in interrupt mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_data  Pointer to the data
  * @param  size_byte  Size of the data in bytes
  * @note   The dynamic own address must be valid before calling this function.
  *         This function returns HAL_ERROR in these situations:
  *           - Before the ENTDAA (Dynamic Address Assignment) procedure completes.
  *           - Immediately after a RSTDAA (Reset Dynamic Address Assignment) broadcast.
  *           - Before a successful Hot-Join sequence (target not yet assigned a dynamic address).
  * @note   This function returns HAL_ERROR if (DEFIE | RXFNEIE) are set,
  *         HAL_I3C_TGT_ActivateNotification_IT(HAL_I3C_TGT_NOTIFICATION_DEFTGTS) enables these interrupts.
  *         This prevents Rx FIFO contention and mixing CCC payload bytes with private Tx data.
  * @note   This function returns HAL_ERROR if (GRPIE | RXFNEIE) are set,
  *         HAL_I3C_TGT_ActivateNotification_IT(HAL_I3C_TGT_NOTIFICATION_DEFGRPA) enables these interrupts.
  *         This prevents Rx FIFO contention and mixing CCC payload bytes with private Tx data.
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_BUSY  Concurrent process ongoing
  * @retval HAL_ERROR  Operation completed with error
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_TGT_Receive_IT(hal_i3c_handle_t *hi3c, uint8_t *p_data, uint32_t size_byte)
{
  I3C_TypeDef *p_i3cx;
  hal_status_t hal_status = HAL_OK;
  uint32_t it_source;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0U);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  p_i3cx = I3C_GET_INSTANCE(hi3c);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Read IER register */
  it_source =  LL_I3C_GetEnabledIT(p_i3cx);

  /* Check if DEF or GRP CCC notifications are enabled */
  if ((I3C_CHECK_IT_SOURCE(it_source, (LL_I3C_IER_DEFIE | LL_I3C_IER_RXFNEIE)) != 0U)
      || (I3C_CHECK_IT_SOURCE(it_source, (LL_I3C_IER_GRPIE | LL_I3C_IER_RXFNEIE)) != 0U))
  {
    return HAL_ERROR;
  }

  /* Check the validity of the own dynamic address */
  if (LL_I3C_IsEnabledOwnDynAddress(p_i3cx) == 0U)
  {
    return HAL_ERROR;
  }

  HAL_CHECK_UPDATE_STATE(hi3c, global_state, HAL_I3C_STATE_IDLE, HAL_I3C_STATE_RX);

#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
  hi3c->last_error_codes = HAL_I3C_ERROR_NONE;
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */
  hi3c->p_rx_data = p_data;
  hi3c->data_size_byte = size_byte;
  hi3c->rx_count_byte = size_byte;
  hi3c->p_isr_func = I3C_Tgt_Rx_ISR;

  /* Check on the Rx threshold to know the Rx treatment process: byte or word */
  if (LL_I3C_GetRxFIFOThreshold(p_i3cx) == LL_I3C_RXFIFO_THRESHOLD_1_8)
  {
    hi3c->p_rx_func = &I3C_ReceiveByteTreatment_IT;
  }
  else
  {
    hi3c->p_rx_func = &I3C_ReceiveWordTreatment_IT;
  }

  LL_I3C_EnableIT(p_i3cx, LL_I3C_TGT_RX_IT);

  return hal_status;
}

#if defined(USE_HAL_I3C_DMA) && (USE_HAL_I3C_DMA == 1)
/**
  * @brief  Target receive private data in DMA mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_data  Pointer to the data
  * @param  size_byte  Size of the data in bytes
  * @note   The dynamic own address must be valid before calling this function.
  *         This function returns HAL_ERROR in these situations:
  *           - Before the ENTDAA (Dynamic Address Assignment) procedure completes.
  *           - Immediately after a RSTDAA (Reset Dynamic Address Assignment) broadcast.
  *           - Before a successful Hot-Join sequence (target not yet assigned a dynamic address).
  * @note   This function returns HAL_ERROR if (DEFIE | RXFNEIE) are set,
  *         HAL_I3C_TGT_ActivateNotification_IT(HAL_I3C_TGT_NOTIFICATION_DEFTGTS) enables these interrupts.
  *         This prevents Rx FIFO contention and mixing CCC payload bytes with private Tx data.
  * @note   This function returns HAL_ERROR if (GRPIE | RXFNEIE) are set,
  *         HAL_I3C_TGT_ActivateNotification_IT(HAL_I3C_TGT_NOTIFICATION_DEFGRPA) enables these interrupts.
  *         This prevents Rx FIFO contention and mixing CCC payload bytes with private Tx data.
  * @note   DMA widths:
  *         - Tx: threshold 1/8 -> bytes; threshold 1/2 -> words.
  *         - Rx: threshold 1/8 -> bytes; threshold 1/2 -> words.
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_BUSY  Concurrent process ongoing
  * @retval HAL_ERROR  Operation completed with error
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_TGT_Receive_DMA(hal_i3c_handle_t *hi3c, uint8_t *p_data, uint32_t size_byte)
{
  I3C_TypeDef *p_i3cx;
  hal_status_t hal_status = HAL_OK;
  uint32_t it_source;
  hal_status_t rx_dma_status;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0U);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  p_i3cx = I3C_GET_INSTANCE(hi3c);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Read IER register */
  it_source =  LL_I3C_GetEnabledIT(p_i3cx);

  /* Check if DEF or GRP CCC notifications are enabled */
  if ((I3C_CHECK_IT_SOURCE(it_source, (LL_I3C_IER_DEFIE | LL_I3C_IER_RXFNEIE)) != 0U)
      || (I3C_CHECK_IT_SOURCE(it_source, (LL_I3C_IER_GRPIE | LL_I3C_IER_RXFNEIE)) != 0U))
  {
    return HAL_ERROR;
  }

  /* Check the validity of the own dynamic address */
  if (LL_I3C_IsEnabledOwnDynAddress(p_i3cx) == 0U)
  {
    return HAL_ERROR;
  }

  HAL_CHECK_UPDATE_STATE(hi3c, global_state, HAL_I3C_STATE_IDLE, HAL_I3C_STATE_RX);

#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
  hi3c->last_error_codes = HAL_I3C_ERROR_NONE;
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */
  hi3c->p_rx_data = p_data;
  hi3c->rx_count_byte = size_byte;
  hi3c->p_isr_func = I3C_Tgt_Rx_DMA_ISR;

  /*------------------------------------ I3C DMA channel for the Rx Data ---------------------------------------------*/
  hi3c->hdma_rx->p_xfer_cplt_cb = I3C_DMADataReceiveCplt;
  hi3c->hdma_rx->p_xfer_error_cb = I3C_DMAError;
  hi3c->hdma_rx->p_xfer_abort_cb = I3C_DMAError;
  hi3c->hdma_tx->p_xfer_abort_cb = I3C_DMAError;

  /* Check on the Rx threshold to know the Rx treatment process: byte or word */
  if (LL_I3C_GetRxFIFOThreshold(p_i3cx) == LL_I3C_RXFIFO_THRESHOLD_1_8)
  {
    rx_dma_status = HAL_DMA_StartDirectXfer_IT(hi3c->hdma_rx, (uint32_t)&p_i3cx->RDR, (uint32_t)hi3c->p_rx_data,
                                               hi3c->rx_count_byte);
  }
  else
  {
    rx_dma_status = HAL_DMA_StartDirectXfer_IT(hi3c->hdma_rx, (uint32_t)&p_i3cx->RDWR, (uint32_t)hi3c->p_rx_data,
                                               I3C_RoundUp4(hi3c->rx_count_byte));
  }

  if (rx_dma_status == HAL_OK)
  {
    LL_I3C_EnableIT(p_i3cx, LL_I3C_XFER_DMA);
    hi3c->rx_count_byte = 0U;
    LL_I3C_EnableDMAReq_RX(p_i3cx);
  }
  else
  {
    hi3c->hdma_rx->p_xfer_cplt_cb = NULL;
    hi3c->hdma_rx->p_xfer_error_cb = NULL;
#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
    hi3c->last_error_codes = HAL_I3C_ERROR_DMA;
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */
    hal_status = HAL_ERROR;
    I3C_StateIdle(hi3c);
  }

  return hal_status;
}
#endif /* USE_HAL_I3C_DMA */

/**
  * @brief  Target sends Controller-Role request in polling mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  timeout_ms    Timeout duration in milliseconds
  * @note   After receiving the controller's response to the Controller-Role request, the application must configure
  *         the I3C as a controller using the HAL_I3C_CTRL_SetConfig() function.
  * @note   The dynamic own address must be valid before calling this function.
  *         This function returns HAL_ERROR in these situations:
  *           - Before the ENTDAA (Dynamic Address Assignment) procedure completes.
  *           - Immediately after a RSTDAA (Reset Dynamic Address Assignment) broadcast.
  *           - Before a successful Hot-Join sequence (target not yet assigned a dynamic address).
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_BUSY  Concurrent process ongoing
  * @retval HAL_TIMEOUT  Operation exceeds user timeout
  * @retval HAL_ERROR  Operation completed with error
  */
hal_status_t HAL_I3C_TGT_ControlRoleReq(hal_i3c_handle_t *hi3c, uint32_t timeout_ms)
{
  I3C_TypeDef *p_i3cx;
  hal_status_t hal_status;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

