MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
  p_i3cx = I3C_GET_INSTANCE(hi3c);

  /* Check the validity of the own dynamic address */
  if (LL_I3C_IsEnabledOwnDynAddress(p_i3cx) == 0U)
  {
    return HAL_ERROR;
  }

  if (LL_I3C_IsEnabledControllerRoleReq(p_i3cx) == 0U)
  {
    return HAL_ERROR;
  }

  HAL_CHECK_UPDATE_STATE(hi3c, global_state, HAL_I3C_STATE_IDLE, HAL_I3C_STATE_TGT_REQ);

#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
  hi3c->last_error_codes = HAL_I3C_ERROR_NONE;
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */

  /* Request Controller-Role */
  LL_I3C_TargetHandleMessage(p_i3cx, LL_I3C_TARGET_MTYPE_CONTROLLER_ROLE_REQ, 0UL);

  /* Wait Controller-Role completion confirmation flag */
  hal_status = I3C_WaitForFlagSet(hi3c, LL_I3C_EVR_CRUPDF, timeout_ms);

  if (hal_status == HAL_OK)
  {
    LL_I3C_ClearFlag_CRUPD(p_i3cx);
  }

  I3C_StateIdle(hi3c);

  return hal_status;
}

/**
  * @brief  Target sends Controller-Role request in interrupt mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @note   After receiving the controller's response to the Controller-Role request, the application must configure
  *         the I3C as a controller using the HAL_I3C_CTRL_SetConfig() function.
  * @note   The dynamic own address must be valid before calling this function.
  *         This function returns HAL_ERROR in these situations:
  *           - Before the ENTDAA (Dynamic Address Assignment) procedure completes.
  *           - Immediately after a RSTDAA (Reset Dynamic Address Assignment) broadcast.
  *           - Before a successful Hot-Join sequence (target not yet assigned a dynamic address).
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_BUSY  Concurrent process ongoing
  * @retval HAL_ERROR  Operation completed with error
  */
hal_status_t HAL_I3C_TGT_ControlRoleReq_IT(hal_i3c_handle_t *hi3c)
{
  I3C_TypeDef *p_i3cx;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  p_i3cx = I3C_GET_INSTANCE(hi3c);

  /* Check the validity of the own dynamic address */
  if (LL_I3C_IsEnabledOwnDynAddress(p_i3cx) == 0U)
  {
    return HAL_ERROR;
  }

  if (LL_I3C_IsEnabledControllerRoleReq(p_i3cx) == 0U)
  {
    return HAL_ERROR;
  }

  HAL_CHECK_UPDATE_STATE(hi3c, global_state, HAL_I3C_STATE_IDLE, HAL_I3C_STATE_TGT_REQ);

#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
  hi3c->last_error_codes = HAL_I3C_ERROR_NONE;
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */
  hi3c->p_isr_func = I3C_Tgt_CtrlRole_ISR;

  LL_I3C_EnableIT(p_i3cx, LL_I3C_TGT_CTRLROLE_IT);

  /* Request Controller-Role */
  LL_I3C_TargetHandleMessage(p_i3cx, LL_I3C_TARGET_MTYPE_CONTROLLER_ROLE_REQ, 0UL);

  return HAL_OK;
}

/**
  * @brief  Target sends Hot-Join request in polling mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_own_dynamic_address  Pointer to the target own dynamic address assigned by the controller.
  * @param  timeout_ms  Timeout duration in milliseconds
  * @note   The dynamic own address must be valid before calling this function.
  *         This function returns HAL_ERROR in these situations:
  *           - Before the ENTDAA (Dynamic Address Assignment) procedure completes.
  *           - Immediately after a RSTDAA (Reset Dynamic Address Assignment) broadcast.
  *           - Before a successful Hot-Join sequence (target not yet assigned a dynamic address).
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_TIMEOUT  Operation exceeds user timeout
  * @retval HAL_BUSY  Concurrent process ongoing
  * @retval HAL_ERROR  Operation completed with error
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_TGT_HotJoinReq(hal_i3c_handle_t *hi3c, uint8_t *p_own_dynamic_address, uint32_t timeout_ms)
{
  I3C_TypeDef *p_i3cx;
  hal_status_t hal_status;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_own_dynamic_address != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_own_dynamic_address == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
  p_i3cx = I3C_GET_INSTANCE(hi3c);

  if (LL_I3C_IsEnabledHotJoin(p_i3cx) == 0U)
  {
    return HAL_ERROR;
  }

  HAL_CHECK_UPDATE_STATE(hi3c, global_state, HAL_I3C_STATE_IDLE, HAL_I3C_STATE_TGT_REQ);

#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
  hi3c->last_error_codes = HAL_I3C_ERROR_NONE;
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */

  /* Request Hot-Join */
  LL_I3C_TargetHandleMessage(p_i3cx, LL_I3C_TARGET_MTYPE_HOT_JOIN, 0UL);

  /* Wait Hot-Join completion confirmation flag */
  hal_status = I3C_WaitForFlagSet(hi3c, LL_I3C_EVR_DAUPDF, timeout_ms);

  if (hal_status == HAL_OK)
  {
    /* Clear dynamic address update flag */
    LL_I3C_ClearFlag_DAUPD(p_i3cx);
  }

  /* Check the validity of the own dynamic address */
  if (LL_I3C_IsEnabledOwnDynAddress(p_i3cx) == 0U)
  {
#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
    hi3c->last_error_codes |= HAL_I3C_ERROR_DYNAMIC_ADDR;
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */
    hal_status = HAL_ERROR;
  }
  else
  {
    *p_own_dynamic_address = LL_I3C_GetOwnDynamicAddress(p_i3cx);
  }

  I3C_StateIdle(hi3c);

  return hal_status;
}

/**
  * @brief  Target sends Hot-Join request in interrupt mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_BUSY  Concurrent process ongoing
  * @retval HAL_ERROR  Operation completed with error
  */
hal_status_t HAL_I3C_TGT_HotJoinReq_IT(hal_i3c_handle_t *hi3c)
{
  I3C_TypeDef *p_i3cx;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  p_i3cx = I3C_GET_INSTANCE(hi3c);

  /* Check on the Hot-Join request feature */
  if (LL_I3C_IsEnabledHotJoin(p_i3cx) == 0U)
  {
    return HAL_ERROR;
  }

  HAL_CHECK_UPDATE_STATE(hi3c, global_state, HAL_I3C_STATE_IDLE, HAL_I3C_STATE_TGT_REQ);

#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
  hi3c->last_error_codes = HAL_I3C_ERROR_NONE;
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */
  hi3c->p_isr_func = I3C_Tgt_HotJoin_ISR;

  LL_I3C_EnableIT(p_i3cx, LL_I3C_TGT_HOTJOIN_IT);

