MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
  /* Request Hot-Join */
  LL_I3C_TargetHandleMessage(p_i3cx, LL_I3C_TARGET_MTYPE_HOT_JOIN, 0UL);

  return HAL_OK;
}

/**
  * @brief  Target sends IBI request in polling mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_payload     Pointer to the buffer contains the payload data
  * @param  payload_size_byte  Payload buffer size in bytes
  * @param  timeout_ms    Timeout duration in milliseconds
  * @note   The dynamic own address must be valid before calling this function.
  *         This function returns HAL_ERROR in these situations:
  *           - Before the ENTDAA (Dynamic Address Assignment) procedure completes.
  *           - Immediately after a RSTDAA (Reset Dynamic Address Assignment) broadcast.
  *           - Before a successful Hot-Join sequence (target not yet assigned a dynamic address).
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_BUSY  Concurrent process ongoing
  * @retval HAL_TIMEOUT  Operation exceeds user timeout
  * @retval HAL_ERROR  Operation completed with error
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_TGT_IBIReq(hal_i3c_handle_t *hi3c,
                                const uint8_t *p_payload,
                                uint32_t payload_size_byte,
                                uint32_t timeout_ms)
{
  I3C_TypeDef *p_i3cx;
  hal_status_t hal_status;
  uint32_t payload_value = 0U;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  p_i3cx = I3C_GET_INSTANCE(hi3c);

  /* Check the validity of the own dynamic address */
  if (LL_I3C_IsEnabledOwnDynAddress(p_i3cx) == 0U)
  {
    return HAL_ERROR;
  }

  if (LL_I3C_IsEnabledIBI(p_i3cx) == 0U)
  {
    return HAL_ERROR;
  }

  /* Update handle parameters */
  HAL_CHECK_UPDATE_STATE(hi3c, global_state, HAL_I3C_STATE_IDLE, HAL_I3C_STATE_TGT_REQ);

#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
  hi3c->last_error_codes = HAL_I3C_ERROR_NONE;
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */

  /* Check on the IBI additional data */
  if (LL_I3C_GetDeviceIBIPayload(p_i3cx) == LL_I3C_IBI_ADDITIONAL_DATA)
  {
    ASSERT_DBG_PARAM(p_payload != NULL);
    ASSERT_DBG_PARAM(payload_size_byte != 0U);
#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
    /* Check on the p_payload and payload_size values */
    if ((p_payload == NULL) || (payload_size_byte == 0U))
    {
      I3C_StateIdle(hi3c);
      return HAL_INVALID_PARAM;
    }
#endif /* USE_HAL_CHECK_PARAM */

    /* For loop to calculate the payload value */
    for (uint32_t index = 0U; index < payload_size_byte; index++)
    {
      payload_value |= ((uint32_t)p_payload[index] << (index * 8U));
    }

    /* Load IBI payload data */
    LL_I3C_SetIBIPayload(p_i3cx, payload_value);
  }

  /* Request IBI */
  LL_I3C_TargetHandleMessage(p_i3cx, LL_I3C_TARGET_MTYPE_IBI, payload_size_byte);

  /* Wait IBI completion confirmation flag */
  hal_status = I3C_WaitForFlagSet(hi3c, LL_I3C_EVR_IBIENDF, timeout_ms);

  if (hal_status == HAL_OK)
  {
    /* Clear IBI end process flag */
    LL_I3C_ClearFlag_IBIEND(p_i3cx);
  }

  I3C_StateIdle(hi3c);

  return hal_status;
}

/**
  * @brief  Target sends IBI request in interrupt mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_payload     Pointer to the buffer contains the payload data
  * @param  payload_size_byte  Payload buffer size in bytes
  * @note   The dynamic own address must be valid before calling this function.
  *         This function returns HAL_ERROR in these situations:
  *           - Before the ENTDAA (Dynamic Address Assignment) procedure completes.
  *           - Immediately after a RSTDAA (Reset Dynamic Address Assignment) broadcast.
  *           - Before a successful Hot-Join sequence (target not yet assigned a dynamic address).
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_BUSY  Concurrent process ongoing
  * @retval HAL_ERROR  Operation completed with error
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_TGT_IBIReq_IT(hal_i3c_handle_t *hi3c, const uint8_t *p_payload, uint32_t payload_size_byte)
{
  I3C_TypeDef *p_i3cx;
  hal_status_t hal_status = HAL_OK;
  uint32_t payload_value = 0U;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE);

  p_i3cx = I3C_GET_INSTANCE(hi3c);

  if (LL_I3C_IsEnabledOwnDynAddress(p_i3cx) == 0U)
  {
    return HAL_ERROR;
  }

  if (LL_I3C_IsEnabledIBI(p_i3cx) == 0U)
  {
    return HAL_ERROR;
  }

  HAL_CHECK_UPDATE_STATE(hi3c, global_state, HAL_I3C_STATE_IDLE, HAL_I3C_STATE_TGT_REQ);

#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
  hi3c->last_error_codes = HAL_I3C_ERROR_NONE;
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */
  hi3c->p_isr_func = I3C_Tgt_IBI_ISR;

  /* Check on the IBI additional data */
  if (LL_I3C_GetDeviceIBIPayload(p_i3cx) == LL_I3C_IBI_ADDITIONAL_DATA)
  {
    ASSERT_DBG_PARAM(p_payload != NULL);
    ASSERT_DBG_PARAM(payload_size_byte != 0U);
#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
    /* Check on the p_payload and payload_size values */
    if ((p_payload == NULL) || (payload_size_byte == 0U))
    {
      I3C_StateIdle(hi3c);
      return HAL_INVALID_PARAM;
    }
#endif /* USE_HAL_CHECK_PARAM */
    /* For loop to calculate the payload value */
    for (uint32_t index = 0U; index < payload_size_byte; index++)
    {
      payload_value |= ((uint32_t)p_payload[index] << (index * 8U));
    }

    /* Load IBI payload data */
    LL_I3C_SetIBIPayload(p_i3cx, payload_value);
  }

  LL_I3C_EnableIT(p_i3cx, LL_I3C_TGT_IBI_IT);

  /* Request IBI */
  LL_I3C_TargetHandleMessage(p_i3cx, LL_I3C_TARGET_MTYPE_IBI, payload_size_byte);

  return hal_status;
}

/**
  * @}
  */

/** @addtogroup I3C_Exported_Functions_Group8 Weak callback functions
  * @{
A set of Weak functions (or default callback functions if USE_HAL_I3C_REGISTER_CALLBACKS is set to 1) are used
to asynchronously inform the application in non-blocking modes (interrupt and DMA):
 - HAL_I3C_CTRL_TransferCpltCallback()     : Controller multiple transfer completed callback.
 - HAL_I3C_CTRL_DAACpltCallback()          : Controller Dynamic Address Assignment complete callback.
 - HAL_I3C_CTRL_TgtReqDynAddrCallback()    : Target request Dynamic Address callback.
 - HAL_I3C_TGT_TxCpltCallback()            : Target transmission complete callback.
 - HAL_I3C_TGT_RxCpltCallback()            : Target reception complete callback.
 - HAL_I3C_TGT_HotJoinCallback()           : Target Hot-Join process complete callback.
 - HAL_I3C_NotifyCallback()                : Target/Controller notification event callback.
 - HAL_I3C_ErrorCallback()                 : Target/Controller error callback.
 - HAL_I3C_AbortCpltCallback()             : Target/Controller abort callback.
  */

/**
  * @brief  Controller Multiple transfer completed callback.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_I3C_CTRL_TransferCpltCallback(hal_i3c_handle_t *hi3c)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi3c);

