MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
  /* WARNING: This function must not be modified, when the callback is needed,
     the HAL_I3C_CTRL_TransferCpltCallback must be implemented in the user file
  */
}

/**
  * @brief  Controller dynamic address assignment complete callback.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_I3C_CTRL_DAACpltCallback(hal_i3c_handle_t *hi3c)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi3c);

  /* WARNING: This function must not be modified, when the callback is needed,
     the HAL_I3C_CTRL_DAACpltCallback must be implemented in the user file
  */
}

/**
  * @brief  Target Request Dynamic Address callback.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  target_payload  Parameter indicates the target payload
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_I3C_CTRL_TgtReqDynAddrCallback(hal_i3c_handle_t *hi3c, uint64_t target_payload)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi3c);
  STM32_UNUSED(target_payload);

  /* WARNING: This function must not be modified, when the callback is needed,
     the HAL_I3C_CTRL_TgtReqDynAddrCallback must be implemented in the user file
  */
}

/**
  * @brief  Target Transmission complete callback.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_I3C_TGT_TxCpltCallback(hal_i3c_handle_t *hi3c)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi3c);

  /* WARNING: This function must not be modified, when the callback is needed,
     the HAL_I3C_TGT_TxCpltCallback must be implemented in the user file
  */
}

/**
  * @brief  Target Reception complete callback.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_I3C_TGT_RxCpltCallback(hal_i3c_handle_t *hi3c)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi3c);

  /** NOTE: This function must not be modified, when the callback is needed,
    * the HAL_I3C_TGT_RxCpltCallback must be implemented in the user file
    */
}

/**
  * @brief  Target Hot-Join process complete callback.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  dynamic_address The returned dynamic address value after the Hot-Join process
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_I3C_TGT_HotJoinCallback(hal_i3c_handle_t *hi3c, uint8_t dynamic_address)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi3c);
  STM32_UNUSED(dynamic_address);

  /** NOTE: This function must not be modified, when the callback is needed,
    * the HAL_I3C_TGT_HotJoinCallback must be implemented in the user file
    */
}

/**
  * @brief  Target/Controller Notification event callback.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  notifications  Parameter indicates which notification is signaled
  *                            It can be a combination value of @ref I3C_CTRL_NOTIFICATION or @ref I3C_TGT_NOTIFICATION.
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_I3C_NotifyCallback(hal_i3c_handle_t *hi3c, uint32_t notifications)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi3c);
  STM32_UNUSED(notifications);

  /**  NOTE: This function must not be modified, when the callback is needed,
    *  the HAL_I3C_NotifyCallback must be implemented in the user file
    */
}

/**
  * @brief  Error callback.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_I3C_ErrorCallback(hal_i3c_handle_t *hi3c)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi3c);

  /**  NOTE: This function must not be modified, when the callback is needed,
    *  the HAL_I3C_ErrorCallback must be implemented in the user file
    */
}

/**
  * @brief  Abort complete callback.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_I3C_AbortCpltCallback(hal_i3c_handle_t *hi3c)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi3c);

  /**  NOTE: This function must not be modified, when the callback is needed,
    *  the HAL_I3C_AbortCpltCallback must be implemented in the user file
    */
}

/**
  * @}
  */

/** @addtogroup I3C_Exported_Functions_Group9 Generic and common functions
  * @{
A set of functions that abort transfers or retrieve the runtime status of the peripheral:
  - HAL_I3C_Abort_IT() to abort the current transfer either in DMA or IT.
  - HAL_I3C_GetState() to get the I3C handle state.
  - HAL_I3C_GetMode() to get the I3C handle mode.
  - HAL_I3C_GetLastErrorCodes() to get the last error code.
  - HAL_I3C_GetClockFreq() to get the kernel clock frequency
  - HAL_I3C_CTRL_GetENTDAA_PayloadInfo() to get BCR, DCR and PID information after ENTDAA.
  - HAL_I3C_GetCCCInfo() to retrieve some specific associated CCC event data.
  - HAL_I3C_GetDataCounter() to get the counter data.
  */

/**
  * @brief  Abort an I3C IT or DMA process communication with Interrupt.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval HAL_OK  Operation completed successfully
  */
hal_status_t HAL_I3C_Abort_IT(hal_i3c_handle_t *hi3c)
{
  I3C_TypeDef *p_i3cx;
  uint32_t flush_mask;
  uint32_t it_source;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

