MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
  p_i3cx = I3C_GET_INSTANCE(hi3c);

  if (hi3c->global_state != HAL_I3C_STATE_ABORT)
  {
    hi3c->global_state = HAL_I3C_STATE_ABORT;
#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
    hi3c->last_error_codes = HAL_I3C_ERROR_NONE;
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */

    LL_I3C_DisableIT_ERR(p_i3cx);
    hi3c->p_isr_func = I3C_Abort_ISR;

    /* Flush the different Fifos to generate an automatic stop mode link to underflow or overflow detection timeout */
    flush_mask = (I3C_CFGR_TXFLUSH | I3C_CFGR_RXFLUSH);

    if (hi3c->mode == HAL_I3C_MODE_CTRL)
    {
      flush_mask |= (I3C_CFGR_SFLUSH | I3C_CFGR_CFLUSH);
    }

    LL_I3C_RequestFifosFlush(p_i3cx, flush_mask);

#if defined(USE_HAL_I3C_DMA) && (USE_HAL_I3C_DMA == 1)
    /* Disable all DMA Requests */
    LL_I3C_DisableAllDMARequests(p_i3cx);
#endif /* USE_HAL_I3C_DMA */

    if (hi3c->mode == HAL_I3C_MODE_CTRL)
    {
      it_source = (LL_I3C_CTRL_RX_IT | LL_I3C_CTRL_TX_IT);
    }
    else
    {
      it_source = LL_I3C_TGT_RX_IT;
    }
    LL_I3C_EnableIT(p_i3cx, it_source);
  }

  return HAL_OK;
}

/**
  * @brief  Return the I3C handle state.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval global_state:
  *  - HAL_I3C_STATE_RESET    Not yet Initialized
  *  - HAL_I3C_STATE_INIT     I3C is initialized but not yet configured
  *  - HAL_I3C_STATE_IDLE     I3C initialized and a global config applied
  *  - HAL_I3C_STATE_TX       Data Transmission process is ongoing
  *  - HAL_I3C_STATE_RX       Data Reception process is ongoing
  *  - HAL_I3C_STATE_TX_RX    Data Multiple Transfer process is ongoing
  *  - HAL_I3C_STATE_DAA      Dynamic address assignment process is ongoing
  *  - HAL_I3C_STATE_TGT_REQ  Target request process is ongoing
  *  - HAL_I3C_STATE_ABORT    Abort user request ongoing
  */
hal_i3c_state_t HAL_I3C_GetState(const hal_i3c_handle_t *hi3c)
{
  return hi3c->global_state;
}

/**
  * @brief  Returns the I3C mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval Mode:
  *  - HAL_I3C_MODE_NONE  No I3C communication on going
  *  - HAL_I3C_MODE_CTRL  I3C communication is in controller mode
  *  - HAL_I3C_MODE_TGT   I3C communication is in target mode
  */
hal_i3c_mode_t HAL_I3C_GetMode(const hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);
  return hi3c->mode;
}
#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
/**
  * @brief  Returns errors limited to the last process.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @return uint32_t last error code. It can be HAL_I3C_ERROR_NONE or a combination of the following values:
  * Controller protocol / parity / address phase errors:
  *   - HAL_I3C_CTRL_ERROR_0  : Illegally formatted CCC
  *   - HAL_I3C_CTRL_ERROR_1  : Transmitted data differs from expected
  *   - HAL_I3C_CTRL_ERROR_2  : Broadcast address 0x7E not acknowledged
  *   - HAL_I3C_CTRL_ERROR_3  : New controller did not drive the bus after controller-role hand-off
  * Target protocol / parity / address phase errors:
  *   - HAL_I3C_TGT_ERROR_0   : Invalid broadcast address 0x7E + W
  *   - HAL_I3C_TGT_ERROR_1   : Parity error on a CCC code
  *   - HAL_I3C_TGT_ERROR_2   : Parity error on a write data byte
  *   - HAL_I3C_TGT_ERROR_3   : Parity error on the assigned address during dynamic address arbitration
  *   - HAL_I3C_TGT_ERROR_4   : Missing 0x7E + R after Sr during dynamic address arbitration
  *   - HAL_I3C_TGT_ERROR_5   : Illegally formatted CCC
  *   - HAL_I3C_TGT_ERROR_6   : Transmitted data differs from expected
  * Common data / flow errors:
  *   - HAL_I3C_ERROR_DATA_HAND_OFF  : Data error during Controller-Role hand-off; active controller keeps role
  *   - HAL_I3C_ERROR_DATA_NACK      : Data not acknowledged
  *   - HAL_I3C_ERROR_ADDRESS_NACK   : Address not acknowledged
  *   - HAL_I3C_ERROR_COVR           : Status FIFO over-run or Control FIFO under-run
  *   - HAL_I3C_ERROR_DOVR           : Rx FIFO over-run or Tx FIFO under-run
  *   - HAL_I3C_TGT_ERROR_STALL      : SCL held stable > timeout during SDR data read
  *   - HAL_I3C_ERROR_DMA            : DMA transfer error
  *   - HAL_I3C_ERROR_DYNAMIC_ADDR   : Dynamic address error
  */
uint32_t HAL_I3C_GetLastErrorCodes(const hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  return hi3c->last_error_codes;
}
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */

/**
  * @brief  Get the data counter according to the current usecase (tgt/ctrl, transfer or not).
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @return data counter:
  *    - During the Dynamic Address Assignment process (ENTDAA CCC):
  *        - When the I3C acts as controller: number of targets detected.
  *        - When the I3C acts as target: number of transmitted bytes.
  *    - During the transfer:
  *        - Whatever the I3C acts as controller or target: number of data bytes read from or transmitted
             on the I3C bus during the message.
  */
uint32_t HAL_I3C_GetDataCounter(hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX | HAL_I3C_STATE_TX_RX \
                   | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  return LL_I3C_GetXferDataCount(I3C_GET_INSTANCE(hi3c));
}

/**
  * @brief  Target/Controller get the Common Command Code (CCC) information updated after notifications.
  *
  *  | CCC Notification                    | Updated fields in p_ccc_info                         |
  *  |-------------------------------------|:----------------------------------------------------:|
  *  | HAL_I3C_TGT_NOTIFICATION_DAU        | dynamic_addr, dynamic_addr_valid                     |
  *  | HAL_I3C_TGT_NOTIFICATION_SETMWL     | max_write_data_size_byte                             |
  *  | HAL_I3C_TGT_NOTIFICATION_SETMRL     | max_read_data_size_byte                              |
  *  | HAL_I3C_TGT_NOTIFICATION_RSTACT     | reset_action                                         |
  *  | HAL_I3C_TGT_NOTIFICATION_ENTAS_X    | activity_state                                       |
  *  | HAL_I3C_TGT_NOTIFICATION_ENEC_DISEC | hot_join_allowed, in_band_allowed, ctrl_role_allowed |
  *  | HAL_I3C_CTRL_NOTIFICATION_IBI       | ibi_cr_tgt_addr, ibi_tgt_nb_payload, ibi_tgt_payload |
  *  | HAL_I3C_CTRL_NOTIFICATION_CR        | ibi_cr_tgt_addr                                      |
  *
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  notifications  Notification. It can be a combination value of @ref I3C_CTRL_NOTIFICATION
                               or @ref I3C_TGT_NOTIFICATION
  * @param  p_ccc_info  Pointer to an I3C_CCCInfoTypeDef structure that contains the CCC information
  *                     updated after CCC event.
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_GetCCCInfo(const hal_i3c_handle_t *hi3c, uint32_t notifications,
                                hal_i3c_ccc_info_t *p_ccc_info)
{
  I3C_TypeDef *p_i3cx;
  hal_status_t hal_status = HAL_OK;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_PARAM(p_ccc_info != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX \
                   | HAL_I3C_STATE_TX_RX | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

