MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
  p_i3cx = I3C_GET_INSTANCE(hi3c);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_ccc_info == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Retrieve Target Dynamic Address value and Validity (target/controller) */
  if ((notifications & HAL_I3C_TGT_NOTIFICATION_DAU) == HAL_I3C_TGT_NOTIFICATION_DAU)
  {
    p_ccc_info->dynamic_addr_valid = LL_I3C_IsEnabledOwnDynAddress(p_i3cx);
    p_ccc_info->dynamic_addr = LL_I3C_GetOwnDynamicAddress(p_i3cx);
  }

  /* Retrieve Maximum Write Data Length (target) */
  if ((notifications & HAL_I3C_TGT_NOTIFICATION_SETMWL) == HAL_I3C_TGT_NOTIFICATION_SETMWL)
  {
    p_ccc_info->max_write_data_size_byte = LL_I3C_GetMaxWriteLength(p_i3cx);
  }

  /* Retrieve Maximum Read Data Length (target) */
  if ((notifications & HAL_I3C_TGT_NOTIFICATION_SETMRL) == HAL_I3C_TGT_NOTIFICATION_SETMRL)
  {
    p_ccc_info->max_read_data_size_byte = LL_I3C_GetMaxReadLength(p_i3cx);
  }

  /* RetrieveResetAction/Level on receivedResetpattern (target) */
  if ((notifications & HAL_I3C_TGT_NOTIFICATION_RSTACT) == HAL_I3C_TGT_NOTIFICATION_RSTACT)
  {
    p_ccc_info->reset_action = (hal_i3c_reset_action_t) LL_I3C_GetResetAction(p_i3cx);
  }

  /* Retrieve Activity State (target) */
  if ((notifications & HAL_I3C_TGT_NOTIFICATION_ENTAS_X) == HAL_I3C_TGT_NOTIFICATION_ENTAS_X)
  {
    p_ccc_info->activity_state = (hal_i3c_activity_state_t) LL_I3C_GetActivityState(p_i3cx);
  }

  /* Retrieve Interrupt allowed status (target) */
  if ((notifications & HAL_I3C_TGT_NOTIFICATION_ENEC_DISEC) == HAL_I3C_TGT_NOTIFICATION_ENEC_DISEC)
  {
    p_ccc_info->hot_join_allowed = LL_I3C_IsEnabledHotJoin(p_i3cx);
    p_ccc_info->in_band_allowed = LL_I3C_IsEnabledIBI(p_i3cx);
    p_ccc_info->ctrl_role_allowed = LL_I3C_IsEnabledControllerRoleReq(p_i3cx);
  }

  /* Retrieve In Band Interrupt information (controller) */
  if ((notifications & HAL_I3C_CTRL_NOTIFICATION_IBI) == HAL_I3C_CTRL_NOTIFICATION_IBI)
  {
    p_ccc_info->ibi_cr_tgt_addr = LL_I3C_GetIBITargetAddr(p_i3cx);
    p_ccc_info->ibi_tgt_nb_payload = LL_I3C_GetNbIBIAddData(p_i3cx);
    p_ccc_info->ibi_tgt_payload = LL_I3C_GetIBIPayload(p_i3cx);
  }

  /* Retrieve Controller-Role request Interrupt information (controller) */
  if ((notifications & HAL_I3C_CTRL_NOTIFICATION_CR) == HAL_I3C_CTRL_NOTIFICATION_CR)
  {
    p_ccc_info->ibi_cr_tgt_addr = LL_I3C_GetIBITargetAddr(p_i3cx);
  }

  return hal_status;
}

/** @brief  Return the peripheral clock frequency for I3C.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval uint32_t Frequency in Hz.
  *                  0 if the source clock of the I3C is not configured or not ready.
  */
uint32_t HAL_I3C_GetClockFreq(const hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX \
                   | HAL_I3C_STATE_TX_RX | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  return HAL_RCC_I3C_GetKernelClkFreq(I3C_GET_INSTANCE(hi3c));
}

/**
  * @brief  Get BCR, DCR and PID information after ENTDAA.
  * @param  entdaa_payload   Payload received after ENTDAA
  * @param  p_entdaa_payload Pointer to an I3C_ENTDAAPayloadTypeDef structure that contains the BCR, DCR and PID
  *                          information.
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_INVALID_PARAM  Invalid parameter
  */
hal_status_t HAL_I3C_CTRL_GetENTDAA_PayloadInfo(uint64_t entdaa_payload,
                                                hal_i3c_entdaa_payload_t *p_entdaa_payload)
{
  hal_status_t hal_status = HAL_OK;
  uint32_t bcr;
  uint64_t pid;

  ASSERT_DBG_PARAM(p_entdaa_payload != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_entdaa_payload == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Get bus characterics */
  bcr = HAL_I3C_GET_BCR(entdaa_payload);

  /* Retrieve BCR information */
  p_entdaa_payload->bcr.ibi_payload = HAL_I3C_GET_IBI_PAYLOAD(bcr);
  p_entdaa_payload->bcr.ibi_request_capable = HAL_I3C_GET_IBI_CAPABLE(bcr);
  p_entdaa_payload->bcr.ctrl_role = HAL_I3C_GET_CTRL_ROLE_CAPABLE(bcr);
  p_entdaa_payload->bcr.advanced_capabilities = HAL_I3C_GET_ADVANCED_CAPABLE(bcr);
  p_entdaa_payload->bcr.offline_capable = HAL_I3C_GET_OFFLINE_CAPABLE(bcr);
  p_entdaa_payload->bcr.virtual_target_support = HAL_I3C_GET_VIRTUAL_TGT(bcr);
  p_entdaa_payload->bcr.max_data_speed_limitation = HAL_I3C_GET_MAX_DATA_SPEED_LIMIT(bcr);

  /* Get device characterics */
  p_entdaa_payload->dcr = HAL_I3C_GET_DCR(entdaa_payload);

  /* Get provisioned ID */
  pid = HAL_I3C_GET_PID(entdaa_payload);

  /* Change PID from big endian to litlle endian */
  pid = (uint64_t)((((uint64_t)HAL_I3C_BIG_TO_LITTLE_ENDIAN((uint32_t) pid) << 32) |
                    ((uint64_t)HAL_I3C_BIG_TO_LITTLE_ENDIAN((uint32_t)(pid >> 32)))) >> 16);

  /* Retrieve PID information */
  p_entdaa_payload->pid.mipi_manuf_id = HAL_I3C_GET_MIPIMID(pid);
  p_entdaa_payload->pid.id_type_sel = HAL_I3C_GET_IDTSEL(pid);
  p_entdaa_payload->pid.part_id = HAL_I3C_GET_PART_ID(pid);
  p_entdaa_payload->pid.mipi_id = HAL_I3C_GET_MIPIID(pid);

  return hal_status;
}

/**
  * @}
  */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
/** @defgroup I3C_Exported_Functions_Group10 Acquire/release the bus
  * @{
A set of functions that acquire or release the bus based on the HAL OS abstraction layer (stm32_hal_os.c/.h osal):
 - HAL_I3C_AcquireBus() acquires the I3C bus.
 - HAL_I3C_ReleaseBus() releases the I3C bus.
  */

/**
  * @brief  Acquire the I3C bus thanks to the HAL OS abstraction layer (stm32_hal_os.c/.h osal).
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  timeout_ms  Timeout duration in milliseconds
  * @note   The HAL_I3C_AcquireBus() must be called from thread mode only (not from handler mode i.e from ISR).
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_ERROR Operation completed with error
  */
hal_status_t HAL_I3C_AcquireBus(hal_i3c_handle_t *hi3c, uint32_t timeout_ms)
{
  hal_status_t hal_status = HAL_ERROR;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX \
                   | HAL_I3C_STATE_TX_RX | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  if (HAL_OS_SemaphoreTake(&hi3c->semaphore, timeout_ms) == HAL_OS_OK)
  {
    hal_status = HAL_OK;
  }

  return hal_status;
}

/**
  * @brief  Release the I3C bus thanks to the HAL OS abstraction layer (stm32_hal_os.c/.h osal).
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @note   The HAL_I3C_ReleaseBus() must be called from thread mode only (not from handler mode i.e from ISR).
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_ERROR Operation completed with error
  */
hal_status_t HAL_I3C_ReleaseBus(hal_i3c_handle_t *hi3c)
{
  hal_status_t hal_status = HAL_ERROR;

  ASSERT_DBG_PARAM(hi3c != NULL);
  ASSERT_DBG_STATE(hi3c->global_state, HAL_I3C_STATE_INIT | HAL_I3C_STATE_IDLE | HAL_I3C_STATE_TX | HAL_I3C_STATE_RX \
                   | HAL_I3C_STATE_TX_RX | HAL_I3C_STATE_DAA | HAL_I3C_STATE_TGT_REQ | HAL_I3C_STATE_ABORT);

  if (HAL_OS_SemaphoreRelease(&hi3c->semaphore) == HAL_OS_OK)
  {
    hal_status = HAL_OK;
  }

  return hal_status;
}

/**
  * @}
  */
#endif /* USE_HAL_MUTEX */

#if defined(USE_HAL_I3C_USER_DATA) && (USE_HAL_I3C_USER_DATA == 1)
/** @defgroup I3C_Exported_Functions_Group11 Set/get user data
  * @{
A set of functions that manage a user data pointer stored in the I3C handle:
 - HAL_I3C_SetUserData() set the user data into the handle
 - HAL_I3C_GetUserData() get the user data from the handle
  */

/**
  * @brief  Set the user data pointer into the handle.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  p_user_data  Pointer to the user data
  */
void HAL_I3C_SetUserData(hal_i3c_handle_t *hi3c, const void *p_user_data)
{
  ASSERT_DBG_PARAM(hi3c != NULL);

  hi3c->p_user_data = p_user_data;
}

/**
  * @brief  Get the user data pointer from the handle.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @retval void*  Pointer to the user data
  */
const void *HAL_I3C_GetUserData(const hal_i3c_handle_t *hi3c)
{
  ASSERT_DBG_PARAM(hi3c != NULL);

  return (hi3c->p_user_data);
}

/**
  * @}
  */
#endif /* USE_HAL_I3C_USER_DATA */

/**
  * @}
  */

/* Private functions -------------------------------------------------------------------------------------------------*/
/** @addtogroup I3C_Private_Functions I3C Private Functions
  * @{
  */

/**
  * @brief  Interrupt Sub-Routine which handles target received events.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  it_masks  Flag Interrupt Masks flags to handle
  * @retval HAL_OK  Operation completed successfully
  */
static hal_status_t I3C_Tgt_Event_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks)
{
  uint32_t event = 0U;
  I3C_TypeDef *p_i3cx = I3C_GET_INSTANCE(hi3c);

  /* I3C Rx FIFO not empty interrupt Check */
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_RXFNEMIS) != 0U)
  {
    hi3c->p_rx_func(hi3c);
  }

  /* I3C target complete Controller-Role hand-off procedure (direct GETACCR CCC) event management --------------------*/
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_CRUPDMIS) != 0U)
  {
    LL_I3C_ClearFlag_CRUPD(p_i3cx);
    event |= HAL_I3C_TGT_NOTIFICATION_GETACCCR;
  }

