MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
  /* I3C target receive any direct GETxxx CCC event management -------------------------------------------------------*/
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_GETMIS) != 0U)
  {
    LL_I3C_ClearFlag_GET(p_i3cx);
    event |= HAL_I3C_TGT_NOTIFICATION_GET_X;
  }

  /* I3C target receive get status command (direct GETSTATUS CCC) event management -----------------------------------*/
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_STAMIS) != 0U)
  {
    LL_I3C_ClearFlag_STA(p_i3cx);
    event |= HAL_I3C_TGT_NOTIFICATION_GET_STATUS;
  }

  /* I3C target receive a dynamic address update (ENTDAA/RSTDAA/SETNEWDA CCC) event management -----------------------*/
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_DAUPDMIS) != 0U)
  {
    LL_I3C_ClearFlag_DAUPD(p_i3cx);
    event |= HAL_I3C_TGT_NOTIFICATION_DAU;
  }

  /* I3C target receive maximum write length update (direct SETMWL CCC) event management -----------------------------*/
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_MWLUPDMIS) != 0U)
  {
    LL_I3C_ClearFlag_MWLUPD(p_i3cx);
    event |= HAL_I3C_TGT_NOTIFICATION_SETMWL;
  }

  /* I3C target receive maximum read length update(direct SETMRL CCC) event management -------------------------------*/
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_MRLUPDMIS) != 0U)
  {
    LL_I3C_ClearFlag_MRLUPD(p_i3cx);
    event |= HAL_I3C_TGT_NOTIFICATION_SETMRL;
  }

  /* I3C target detectResetpattern (broadcast or direct RSTACT CCC) event management -------------------------------*/
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_RSTMIS) != 0U)
  {
    LL_I3C_ClearFlag_RST(p_i3cx);
    event |= HAL_I3C_TGT_NOTIFICATION_RSTACT;
  }

  /* I3C target receive activity state update (direct or broadcast ENTASx) CCC event management ----------------------*/
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_ASUPDMIS) != 0U)
  {
    LL_I3C_ClearFlag_ASUPD(p_i3cx);
    event |= HAL_I3C_TGT_NOTIFICATION_ENTAS_X;
  }

  /* I3C target receive a direct or broadcast ENEC/DISEC CCC event management ----------------------------------------*/
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_INTUPDMIS) != 0U)
  {
    LL_I3C_ClearFlag_INTUPD(p_i3cx);
    event |= HAL_I3C_TGT_NOTIFICATION_ENEC_DISEC;
  }

  /* I3C target receive a broadcast DEFTGTS CCC event management -----------------------------------------------------*/
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_DEFMIS) != 0U)
  {
    LL_I3C_ClearFlag_DEF(p_i3cx);
    event |= HAL_I3C_TGT_NOTIFICATION_DEFTGTS;
  }

  /* I3C target receive a group addressing (broadcast DEFGRPA CCC) event management ----------------------------------*/
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_GRPMIS) != 0U)
  {
    LL_I3C_ClearFlag_GRP(p_i3cx);
    event |= HAL_I3C_TGT_NOTIFICATION_DEFGRPA;
  }

  /* I3C target wakeup event management ----------------------------------*/
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_WKPMIS) != 0U)
  {
    LL_I3C_ClearFlag_WKP(p_i3cx);
    event |= HAL_I3C_TGT_NOTIFICATION_WKP;
  }

  if (event != 0U)
  {
#if (USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
    hi3c->p_notify_cb(hi3c, event);
#else
    HAL_I3C_NotifyCallback(hi3c, event);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
  }

  return HAL_OK;
}

/**
  * @brief  Interrupt Sub-Routine which handles Controller received events.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  it_masks  Flag Interrupt Masks flags to handle
  * @retval HAL_OK  Operation completed successfully
  */
static hal_status_t I3C_Ctrl_Event_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks)
{
  I3C_TypeDef *p_i3cx;

  p_i3cx = I3C_GET_INSTANCE(hi3c);

  /* I3C controller receive IBI event management ---------------------------------------------------------------------*/
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_IBIMIS) != 0U)
  {
    /* Clear IBI request flag */
    LL_I3C_ClearFlag_IBI(p_i3cx);
#if (USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
    hi3c->p_notify_cb(hi3c, HAL_I3C_CTRL_NOTIFICATION_IBI);
#else
    HAL_I3C_NotifyCallback(hi3c, HAL_I3C_CTRL_NOTIFICATION_IBI);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
  }

  /* I3C controller Controller-Role request event management ---------------------------------------------------------*/
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_CRMIS) != 0U)
  {
    /* Clear Controller-Role request flag */
    LL_I3C_ClearFlag_CR(p_i3cx);

#if (USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
    hi3c->p_notify_cb(hi3c, HAL_I3C_CTRL_NOTIFICATION_CR);
#else
    HAL_I3C_NotifyCallback(hi3c, HAL_I3C_CTRL_NOTIFICATION_CR);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
  }

  /* I3C controller Hot-Join event management ------------------------------------------------------------------------*/
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_HJMIS) != 0U)
  {
    /* Clear Hot-Join flag */
    LL_I3C_ClearFlag_HJ(p_i3cx);

#if (USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
    hi3c->p_notify_cb(hi3c, HAL_I3C_CTRL_NOTIFICATION_HJ);
#else
    HAL_I3C_NotifyCallback(hi3c, HAL_I3C_CTRL_NOTIFICATION_HJ);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
  }

  return HAL_OK;
}

/**
  * @brief  Interrupt Sub-Routine which handles target Hot-Join event.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  it_masks  Flag Interrupt Masks flags to handle
  * @retval HAL_OK  Operation completed successfully
  */
static hal_status_t I3C_Tgt_HotJoin_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks)
{
  I3C_TypeDef *p_i3cx;

  p_i3cx = I3C_GET_INSTANCE(hi3c);

  /* I3C target receive a dynamic address update event management */
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_DAUPDMIS) != 0U)
  {
    LL_I3C_ClearFlag_DAUPD(p_i3cx);
    LL_I3C_DisableIT(p_i3cx, LL_I3C_TGT_HOTJOIN_IT);

    /* Check the validity of the own dynamic address */
    if (LL_I3C_IsEnabledOwnDynAddress(p_i3cx) != 0U)
    {
      I3C_StateIdle(hi3c);
#if (USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
      hi3c->p_tgt_hot_join_cb(hi3c, (uint8_t)LL_I3C_GetOwnDynamicAddress(p_i3cx));
#else
      HAL_I3C_TGT_HotJoinCallback(hi3c, (uint8_t)LL_I3C_GetOwnDynamicAddress(p_i3cx));
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
    }
    else
    {
#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
      hi3c->last_error_codes |= HAL_I3C_ERROR_DYNAMIC_ADDR;
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */

