MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
      I3C_ErrorTreatment(hi3c);
    }
  }
  return HAL_OK;
}

/**
  * @brief  Interrupt Sub-Routine which handles target Controller-Role event.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  it_masks  Flag Interrupt Masks flags to handle
  * @retval HAL_OK  Operation completed successfully
  */
static hal_status_t I3C_Tgt_CtrlRole_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks)
{
  I3C_TypeDef *p_i3cx;

  p_i3cx = I3C_GET_INSTANCE(hi3c);

  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_CRUPDMIS) != 0U)
  {
    LL_I3C_ClearFlag_CRUPD(p_i3cx);
    LL_I3C_DisableIT(p_i3cx, LL_I3C_TGT_CTRLROLE_IT);
    I3C_StateIdle(hi3c);
#if (USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
    hi3c->p_notify_cb(hi3c, HAL_I3C_TGT_NOTIFICATION_GETACCCR);
#else
    HAL_I3C_NotifyCallback(hi3c, HAL_I3C_TGT_NOTIFICATION_GETACCCR);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
  }
  return HAL_OK;
}

/**
  * @brief  Interrupt Sub-Routine which handles target IBI event.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  it_masks  Flag Interrupt Masks flags to handle
  * @retval HAL_OK  Operation completed successfully
  */
static hal_status_t I3C_Tgt_IBI_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks)
{
  I3C_TypeDef *p_i3cx;

  p_i3cx = I3C_GET_INSTANCE(hi3c);

  /* I3C target IBI end process event management ---------------------------------------------------------------------*/
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_IBIENDMIS) != 0U)
  {
    LL_I3C_ClearFlag_IBIEND(p_i3cx);
    LL_I3C_DisableIT(p_i3cx, LL_I3C_TGT_IBI_IT);
    I3C_StateIdle(hi3c);
#if (USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
    hi3c->p_notify_cb(hi3c, HAL_I3C_TGT_NOTIFICATION_IBIEND);
#else
    HAL_I3C_NotifyCallback(hi3c, HAL_I3C_TGT_NOTIFICATION_IBIEND);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
  }
  return HAL_OK;
}

/**
  * @brief  Interrupt Sub-Routine which handles target transmit data in Interrupt mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  it_masks  Flag Interrupt Masks flags to handle
  * @retval HAL_OK  Operation completed successfully
  */
static hal_status_t I3C_Tgt_Tx_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks)
{
  I3C_TypeDef *p_i3cx;

  p_i3cx = I3C_GET_INSTANCE(hi3c);

  /* I3C Tx FIFO not full interrupt Check */
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_TXFNFMIS) != 0U)
  {
    if (hi3c->tx_count_byte > 0U)
    {
      hi3c->p_tx_func(hi3c);
    }
  }

  /* I3C target frame complete event Check */
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_FCMIS) != 0U)
  {
    LL_I3C_ClearFlag_FC(p_i3cx);

    /* Check if all data bytes are transmitted */
    if (LL_I3C_GetXferDataCount(p_i3cx) == hi3c->data_size_byte)
    {
      LL_I3C_DisableIT(p_i3cx, LL_I3C_TGT_TX_IT);
      I3C_StateIdle(hi3c);
#if (USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
      hi3c->p_tgt_tx_cplt_cb(hi3c);
#else
      HAL_I3C_TGT_TxCpltCallback(hi3c);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
    }
    else
    {
      I3C_ErrorTreatment(hi3c);
    }
  }

  /* I3C target wakeup event management ----------------------------------*/
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_WKPMIS) != 0U)
  {
    /* Clear WKP flag */
    LL_I3C_ClearFlag_WKP(p_i3cx);

#if (USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
    hi3c->p_notify_cb(hi3c, HAL_I3C_TGT_NOTIFICATION_WKP);
#else
    HAL_I3C_NotifyCallback(hi3c, HAL_I3C_TGT_NOTIFICATION_WKP);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
  }

  return HAL_OK;
}

/**
  * @brief  Interrupt Sub-Routine which handles target receive data in Interrupt mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  it_masks  Flag Interrupt Masks flags to handle
  * @retval HAL_OK  Operation completed successfully
  */
static hal_status_t I3C_Tgt_Rx_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks)
{
  I3C_TypeDef *p_i3cx;

  p_i3cx = I3C_GET_INSTANCE(hi3c);

  /* I3C Rx FIFO not empty interrupt Check */
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_RXFNEMIS) != 0U)
  {
    if (hi3c->rx_count_byte > 0U)
    {
      hi3c->p_rx_func(hi3c);
    }
  }

  /* I3C target frame complete event Check */
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_FCMIS) != 0U)
  {
    LL_I3C_ClearFlag_FC(p_i3cx);

    /* Check if all data bytes are received */
    if (LL_I3C_GetXferDataCount(p_i3cx) == hi3c->data_size_byte)
    {
      LL_I3C_DisableIT(p_i3cx, LL_I3C_TGT_RX_IT);
      I3C_StateIdle(hi3c);
#if (USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
      hi3c->p_tgt_rx_cplt_cb(hi3c);
#else
      HAL_I3C_TGT_RxCpltCallback(hi3c);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
    }
    else
    {
      I3C_ErrorTreatment(hi3c);
    }
  }

  /* I3C target wakeup event management ----------------------------------*/
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_WKPMIS) != 0U)
  {
    /* Clear WKP flag */
    LL_I3C_ClearFlag_WKP(p_i3cx);

#if (USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
    hi3c->p_notify_cb(hi3c, HAL_I3C_TGT_NOTIFICATION_WKP);
#else
    HAL_I3C_NotifyCallback(hi3c, HAL_I3C_TGT_NOTIFICATION_WKP);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
  }

  return HAL_OK;
}

#if defined(USE_HAL_I3C_DMA) && (USE_HAL_I3C_DMA == 1)
/**
  * @brief  Interrupt Sub-Routine which handles target transmit data in DMA mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  it_masks  Flag Interrupt Masks flags to handle
  * @retval HAL_OK  Operation completed successfully
  */
static hal_status_t I3C_Tgt_Tx_DMA_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks)
{
  I3C_TypeDef *p_i3cx;

  p_i3cx = I3C_GET_INSTANCE(hi3c);

  /* I3C target frame complete event Check */
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_FCMIS) != 0U)
  {
    LL_I3C_ClearFlag_FC(p_i3cx);

    /* Check if all data bytes are transmitted */
    if (HAL_DMA_GetDirectXferRemainingDataByte(hi3c->hdma_tx) == 0U)
    {
      LL_I3C_DisableIT(p_i3cx, LL_I3C_XFER_DMA);
      hi3c->tx_count_byte = 0U;
      I3C_StateIdle(hi3c);
#if (USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
      hi3c->p_tgt_tx_cplt_cb(hi3c);
#else
      HAL_I3C_TGT_TxCpltCallback(hi3c);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
    }
    else
    {
      I3C_ErrorTreatment(hi3c);
    }
  }

  /* I3C target wakeup event management ----------------------------------*/
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_WKPMIS) != 0U)
  {
    /* Clear WKP flag */
    LL_I3C_ClearFlag_WKP(p_i3cx);

#if (USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
    hi3c->p_notify_cb(hi3c, HAL_I3C_TGT_NOTIFICATION_WKP);
#else
    HAL_I3C_NotifyCallback(hi3c, HAL_I3C_TGT_NOTIFICATION_WKP);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
  }

  return HAL_OK;
}

/**
  * @brief  Interrupt Sub-Routine which handles target receive data in DMA mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  it_masks  Flag Interrupt Masks flags to handle
  * @retval HAL_OK  Operation completed successfully
  */
static hal_status_t I3C_Tgt_Rx_DMA_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks)
{
  I3C_TypeDef *p_i3cx = I3C_GET_INSTANCE(hi3c);

