MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
  /* I3C target frame complete event Check */
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_FCMIS) != 0U)
  {
    LL_I3C_ClearFlag_FC(p_i3cx);

    /* Check if all data bytes are received */
    if (HAL_DMA_GetDirectXferRemainingDataByte(hi3c->hdma_rx) == 0U)
    {
      LL_I3C_DisableIT(p_i3cx, LL_I3C_XFER_DMA);
      hi3c->rx_count_byte = 0U;
      I3C_StateIdle(hi3c);
#if (USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
      hi3c->p_tgt_rx_cplt_cb(hi3c);
#else
      HAL_I3C_TGT_RxCpltCallback(hi3c);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
    }
    else
    {
      I3C_ErrorTreatment(hi3c);
    }
  }

  /* I3C target wakeup event management ----------------------------------*/
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_WKPMIS) != 0U)
  {
    /* Clear WKP flag */
    LL_I3C_ClearFlag_WKP(p_i3cx);

#if (USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
    hi3c->p_notify_cb(hi3c, HAL_I3C_TGT_NOTIFICATION_WKP);
#else
    HAL_I3C_NotifyCallback(hi3c, HAL_I3C_TGT_NOTIFICATION_WKP);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
  }

  return HAL_OK;
}
#endif /* USE_HAL_I3C_DMA */

/**
  * @brief  Interrupt Sub-Routine which handles controller multiple transmission/reception in interrupt mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  it_masks  Flag Interrupt Masks flags to handle
  * @retval HAL_OK  Operation completed successfully
  */
static hal_status_t I3C_Ctrl_Multiple_Xfer_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks)
{
  I3C_TypeDef *p_i3cx;

  p_i3cx = I3C_GET_INSTANCE(hi3c);

  /* Check if Control FIFO requests data */
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_CFNFMIS) != 0U)
  {
    if (hi3c->tc_count_word > 0U)
    {
      I3C_ControlDataTreatment(hi3c);
    }
  }

  /* I3C Tx FIFO not full interrupt Check */
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_TXFNFMIS) != 0U)
  {
    if (hi3c->tx_count_byte > 0U)
    {
      hi3c->p_tx_func(hi3c);
    }
  }

  /* I3C Rx FIFO not empty interrupt Check */
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_RXFNEMIS) != 0U)
  {
    if (hi3c->rx_count_byte > 0U)
    {
      hi3c->p_rx_func(hi3c);
    }
  }

  /* I3C target frame complete event Check */
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_FCMIS) != 0U)
  {
    LL_I3C_ClearFlag_FC(p_i3cx);

    if (hi3c->tc_count_word == 0U)
    {
      LL_I3C_DisableIT(p_i3cx, LL_I3C_CTRL_TX_IT | LL_I3C_CTRL_RX_IT);
      I3C_StateIdle(hi3c);
#if (USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
      hi3c->p_ctrl_transfer_cplt_cb(hi3c);
#else
      HAL_I3C_CTRL_TransferCpltCallback(hi3c);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
    }
    else
    {
      /* Then Initiate a Start condition */
      LL_I3C_RequestTransfer(p_i3cx);
    }
  }

  return HAL_OK;
}

/**
  * @brief  Interrupt Sub-Routine which handles controller multiple transmission/reception and controller received
  *         events in interrupt mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  it_masks  Flag Interrupt Masks flags to handle
  * @retval HAL_OK  Operation completed successfully
  */
static hal_status_t I3C_Ctrl_Multiple_Xfer_Listen_Event_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks)
{
  I3C_TypeDef *p_i3cx;

  p_i3cx = I3C_GET_INSTANCE(hi3c);

  /* I3C controller receive IBI event management ---------------------------------------------------------------------*/
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_IBIMIS) != 0U)
  {
    /* Clear IBI request flag */
    LL_I3C_ClearFlag_IBI(p_i3cx);

#if (USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
    hi3c->p_notify_cb(hi3c, HAL_I3C_CTRL_NOTIFICATION_IBI);
#else
    HAL_I3C_NotifyCallback(hi3c, HAL_I3C_CTRL_NOTIFICATION_IBI);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
  }

  /* I3C controller Controller-Role request event management ---------------------------------------------------------*/
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_CRMIS) != 0U)
  {
    /* Clear Controller-Role request flag */
    LL_I3C_ClearFlag_CR(p_i3cx);

#if (USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
    hi3c->p_notify_cb(hi3c, HAL_I3C_CTRL_NOTIFICATION_CR);
#else
    HAL_I3C_NotifyCallback(hi3c, HAL_I3C_CTRL_NOTIFICATION_CR);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
  }

  /* I3C controller Hot-Join event management ------------------------------------------------------------------------*/
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_HJMIS) != 0U)
  {
    /* Clear Hot-Join flag */
    LL_I3C_ClearFlag_HJ(p_i3cx);

#if (USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
    hi3c->p_notify_cb(hi3c, HAL_I3C_CTRL_NOTIFICATION_HJ);
#else
    HAL_I3C_NotifyCallback(hi3c, HAL_I3C_CTRL_NOTIFICATION_HJ);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
  }

  /* ISR controller transmission/reception */
  return (I3C_Ctrl_Multiple_Xfer_ISR(hi3c, it_masks));
}
/**
  * @brief  Interrupt Sub-Routine which handles controller CCC Dynamic Address Assignment command in interrupt mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  it_masks  Flag Interrupt Masks flags to handle
  * @retval HAL_OK  Operation completed successfully
  */
static hal_status_t I3C_Ctrl_DAA_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks)
{
  I3C_TypeDef *p_i3cx;

  p_i3cx = I3C_GET_INSTANCE(hi3c);

  uint64_t target_payload = 0U;

  /* I3C Control FIFO not full interrupt Check */
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_CFNFMIS) != 0U)
  {
    /* Write ENTDAA CCC information in the control register */
    LL_I3C_ControllerHandleCCC(p_i3cx, LL_I3C_BROADCAST_ENTDAA, 0UL, LL_I3C_GENERATE_STOP);
  }

  /* I3C Tx FIFO not full interrupt Check */
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_TXFNFMIS) != 0U)
  {
    /* Check on the Rx FIFO threshold to know the Dynamic Address Assignment treatment process: byte or word */
    if (LL_I3C_GetRxFIFOThreshold(p_i3cx) == LL_I3C_RXFIFO_THRESHOLD_1_8)
    {
      /* For loop to get target payload */
      for (uint32_t index = 0U; index < 8U; index++)
      {
        /* Retrieve payload byte by byte */
        target_payload |= (uint64_t)((uint64_t)LL_I3C_ReceiveData8(p_i3cx) << (index * 8U));
      }
    }
    else
    {
      /* Retrieve first 32 bits payload */
      target_payload = (uint64_t)LL_I3C_ReceiveData32(p_i3cx);

      /* Retrieve second 32 bits payload */
      target_payload |= (uint64_t)((uint64_t)LL_I3C_ReceiveData32(p_i3cx) << 32U);
    }

#if (USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
    hi3c->p_ctrl_tgt_req_dyn_addr_cb(hi3c, target_payload);
#else
    HAL_I3C_CTRL_TgtReqDynAddrCallback(hi3c, target_payload);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
  }

  /* I3C frame complete event Check */
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_FCMIS) != 0U)
  {
    LL_I3C_ClearFlag_FC(p_i3cx);
    LL_I3C_DisableIT(p_i3cx, LL_I3C_CTRL_DAA_IT);
    I3C_StateIdle(hi3c);
#if (USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
    hi3c->p_ctrl_daa_cplt_cb(hi3c);
#else
    HAL_I3C_CTRL_DAACpltCallback(hi3c);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
  }

  return HAL_OK;
}

#if defined(USE_HAL_I3C_DMA) && (USE_HAL_I3C_DMA == 1)
/**
  * @brief  Interrupt Sub-Routine which handles controller multiple receive and transmit data in DMA mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  it_masks  Flag Interrupt Masks flags to handle
  * @retval HAL_OK  Operation completed successfully
  */
static hal_status_t I3C_Ctrl_Multiple_Xfer_DMA_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks)
{
  I3C_TypeDef *p_i3cx;

