MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
  p_i3cx = I3C_GET_INSTANCE(hi3c);

  /* I3C target frame complete event Check */
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_FCMIS) != 0U)
  {
    LL_I3C_ClearFlag_FC(p_i3cx);

    if (HAL_DMA_GetDirectXferRemainingDataByte(hi3c->hdma_tc) == 0U)
    {
      LL_I3C_DisableIT(p_i3cx, LL_I3C_XFER_DMA);
      I3C_StateIdle(hi3c);
#if (USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
      hi3c->p_ctrl_transfer_cplt_cb(hi3c);
#else
      HAL_I3C_CTRL_TransferCpltCallback(hi3c);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
    }
    else
    {
      /* Then Initiate a Start condition */
      LL_I3C_RequestTransfer(p_i3cx);
    }
  }
  return HAL_OK;
}
#endif /* USE_HAL_I3C_DMA */

/**
  * @brief  Interrupt Sub-Routine which handles abort process in interrupt mode.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  it_masks  Flag Interrupt Masks flags to handle
  * @retval HAL_OK  Operation completed successfully
  */
static hal_status_t I3C_Abort_ISR(hal_i3c_handle_t *hi3c, uint32_t it_masks)
{
  I3C_TypeDef *p_i3cx;

  p_i3cx = I3C_GET_INSTANCE(hi3c);

  /* I3C Rx FIFO not empty interrupt Check */
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_RXFNEMIS) != 0U)
  {
    if (LL_I3C_IsActiveFlag_DOVR(p_i3cx) != 0U)
    {
      /* Flush remaining Rx data */
      LL_I3C_RequestRxFIFOFlush(p_i3cx);
    }
  }

  /** I3C Abort frame complete event Check
    * Even if abort is called, the Frame completion can arrive if abort is requested at the end of the process
    * Even if completion occurs, treat this end of process as abort completion process
    */
  if (I3C_CHECK_FLAG(it_masks, LL_I3C_MISR_FCMIS) != 0U)
  {
    /* Clear frame complete flag */
    LL_I3C_ClearFlag_FC(p_i3cx);

    I3C_ErrorTreatment(hi3c);
  }

  return HAL_OK;
}

#if defined(USE_HAL_I3C_DMA) && (USE_HAL_I3C_DMA == 1)
/**
  * @brief  DMA I3C control transmit process complete callback.
  * @param  hdma  Pointer to a hal_dma_handle_t structure that contains the configuration information
  *               for the specified DMA channel
  */
static void I3C_DMAControlTransmitCplt(hal_dma_handle_t *hdma)
{
  hal_i3c_handle_t *hi3c = (hal_i3c_handle_t *)(((hal_dma_handle_t *)hdma)->p_parent);
  LL_I3C_DisableDMAReq_Control(I3C_GET_INSTANCE(hi3c));
}

/**
  * @brief  DMA I3C transmit data process complete callback.
  * @param  hdma  Pointer to a hal_dma_handle_t structure that contains the configuration information
  *               for the specified DMA channel
  */
static void I3C_DMADataTransmitCplt(hal_dma_handle_t *hdma)
{
  hal_i3c_handle_t *hi3c = (hal_i3c_handle_t *)(((hal_dma_handle_t *)hdma)->p_parent);
  LL_I3C_DisableDMAReq_TX(I3C_GET_INSTANCE(hi3c));
}

/**
  * @brief  DMA I3C receive data process complete callback.
  * @param  hdma  Pointer to a hal_dma_handle_t structure that contains the configuration information
  *               for the specified DMA channel
  */
static void I3C_DMADataReceiveCplt(hal_dma_handle_t *hdma)
{
  hal_i3c_handle_t *hi3c = (hal_i3c_handle_t *)(((hal_dma_handle_t *)hdma)->p_parent);
  LL_I3C_DisableDMAReq_RX(I3C_GET_INSTANCE(hi3c));
}

/**
  * @brief  DMA I3C communication error callback.
  * @param  hdma  Pointer to a hal_dma_handle_t structure that contains the configuration information
  *               for the specified DMA channel
  */
static void I3C_DMAError(hal_dma_handle_t *hdma)
{
  hal_i3c_handle_t *hi3c = (hal_i3c_handle_t *)(((hal_dma_handle_t *)hdma)->p_parent);
  hi3c->last_error_codes |= HAL_I3C_ERROR_DMA;
}

/**
  * @brief  DMA I3C communication abort callback to be called at end of DMA Abort procedure.
  * @param  hdma  Pointer to a hal_dma_handle_t structure that contains the configuration information
  *               for the specified DMA channel
  */
static void I3C_DMAAbort(hal_dma_handle_t *hdma)
{
  hal_i3c_handle_t *hi3c = (hal_i3c_handle_t *)(((hal_dma_handle_t *)hdma)->p_parent);
  hal_dma_channel_t dma_instance = hdma->instance;
  uint32_t no_callback = 0U;

  if (hi3c->hdma_tx != NULL)
  {
    if (hi3c->hdma_tx->instance == dma_instance)
    {
      hi3c->hdma_tx->p_xfer_abort_cb = I3C_DMAError;
    }
    else if (hi3c->hdma_tx->p_xfer_abort_cb != I3C_DMAError)
    {
      no_callback++;
    }
    else
    {
      /* nothing to do */
    }
  }

  if (hi3c->hdma_rx != NULL)
  {
    if (hi3c->hdma_rx->instance == dma_instance)
    {
      hi3c->hdma_rx->p_xfer_abort_cb = I3C_DMAError;
    }
    else if (hi3c->hdma_rx->p_xfer_abort_cb != I3C_DMAError)
    {
      no_callback++;
    }
    else
    {
      /* nothing to do */
    }
  }

  if (hi3c->hdma_tc != NULL)
  {
    if (hi3c->hdma_tc->instance == dma_instance)
    {
      hi3c->hdma_tc->p_xfer_abort_cb = I3C_DMAError;
    }
    else if (hi3c->hdma_tc->p_xfer_abort_cb != I3C_DMAError)
    {
      no_callback++;
    }
    else
    {
      /* nothing to do */
    }
  }

  if (no_callback == 0U)
  {
    I3C_TreatErrorCallback(hi3c);
  }
}

/**
  * @brief Round up size to a multiple of 4.
  * @param size_byte Size in bytes.
  * @return Size rounded up to a multiple of 4.
  * @note If size_byte is already a multiple of 4 it is returned unchanged.
  * @par Examples
  *  - 3 -> 4
  *  - 4 -> 4
  *  - 6 -> 8
  *  - 12 -> 12
  */
static uint32_t I3C_RoundUp4(uint32_t size_byte)
{
  return (size_byte + 3U) & ~3U;
}
#endif /* USE_HAL_I3C_DMA */

/**
  * @brief  Wait on flag set until timeout.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  * @param  flag  Flag to check.
  * @param  timeout_ms  Timeout duration in milliseconds
  * @retval HAL_OK  Operation completed successfully
  * @retval HAL_TIMEOUT  Operation exceeds user timeout
  * @retval HAL_ERROR  Operation completed with error
  */
static hal_status_t I3C_WaitForFlagSet(hal_i3c_handle_t *hi3c, uint32_t flag, uint32_t timeout_ms)
{
  hal_status_t hal_status = HAL_OK;
  I3C_TypeDef *p_i3cx = I3C_GET_INSTANCE(hi3c);
  uint32_t tickstart = HAL_GetTick();

  do
  {
    /* Check if an error occurs during Flag waiting */
    if (LL_I3C_IsActiveFlag_ERR(p_i3cx) != 0U)
    {
      LL_I3C_ClearFlag_ERR(p_i3cx);
#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
      I3C_GetErrorSources(hi3c);
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */
      hal_status = HAL_ERROR;
    }
    /* Check for the timeout */
    else if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
      {
        if (LL_I3C_IsActiveFlag(p_i3cx, flag) == 0U)
        {
          hal_status = HAL_TIMEOUT;
        }
      }
    }
    else
    {
      /* do nothing */
    }
  } while ((LL_I3C_IsActiveFlag(p_i3cx, flag) == 0U) && (hal_status == HAL_OK));

  return hal_status;
}

/**
  * @brief  I3C transmit by byte.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  */
static void I3C_TransmitByteTreatment(hal_i3c_handle_t *hi3c)
{
  I3C_TypeDef *p_i3cx = I3C_GET_INSTANCE(hi3c);

