MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
  /* Check TX FIFO not full flag */
  while ((LL_I3C_IsActiveFlag_TXFNF(p_i3cx) != 0U) && (hi3c->tx_count_byte > 0U))
  {
    LL_I3C_TransmitData8(p_i3cx, *hi3c->p_tx_data);
    hi3c->p_tx_data++;
    hi3c->tx_count_byte--;
  }
}

/**
  * @brief  I3C transmit by byte, at most I3C_TRANSFER_MAX_BYTE.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  */
static void I3C_TransmitByteTreatment_IT(hal_i3c_handle_t *hi3c)
{
  I3C_TypeDef *p_i3cx = I3C_GET_INSTANCE(hi3c);
  uint32_t transfer_count = hi3c->tx_count_byte;
  if (transfer_count > I3C_TRANSFER_MAX_BYTE)
  {
    transfer_count = I3C_TRANSFER_MAX_BYTE;
  }

  /* Transmit transfer_count words while TX FIFO not full */
  while ((LL_I3C_IsActiveFlag_TXFNF(p_i3cx) != 0U) && (transfer_count != 0U))
  {
    LL_I3C_TransmitData8(p_i3cx, *hi3c->p_tx_data);
    hi3c->p_tx_data++;
    hi3c->tx_count_byte--;
    transfer_count--;
  }
}

/**
  * @brief  I3C transmit by word.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  */
static void I3C_TransmitWordTreatment(hal_i3c_handle_t *hi3c)
{
  I3C_TypeDef *p_i3cx = I3C_GET_INSTANCE(hi3c);

  /* Check TX FIFO not full flag */
  while (LL_I3C_IsActiveFlag_TXFNF(p_i3cx) != 0U)
  {
    LL_I3C_TransmitData32(p_i3cx, *((uint32_t *)(uint32_t)hi3c->p_tx_data));
    hi3c->p_tx_data += 4U;

    if (hi3c->tx_count_byte > 4U)
    {
      hi3c->tx_count_byte -= 4U;
    }
    else
    {
      hi3c->tx_count_byte = 0U;
    }
  }
}

/**
  * @brief  I3C transmit by word, at most I3C_TRANSFER_MAX_WORD.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  */
static void I3C_TransmitWordTreatment_IT(hal_i3c_handle_t *hi3c)
{
  I3C_TypeDef *p_i3cx = I3C_GET_INSTANCE(hi3c);
  uint32_t transfer_count = (hi3c->tx_count_byte + 3U) / 4U;
  if (transfer_count > I3C_TRANSFER_MAX_WORD)
  {
    transfer_count = I3C_TRANSFER_MAX_WORD;
  }

  /* Transmit transfer_count while TX FIFO not full */
  while ((LL_I3C_IsActiveFlag_TXFNF(p_i3cx) != 0U) && (transfer_count != 0U))
  {
    LL_I3C_TransmitData32(p_i3cx, *((uint32_t *)(uint32_t)hi3c->p_tx_data));
    hi3c->p_tx_data += 4U;
    if (hi3c->tx_count_byte > 4U)
    {
      hi3c->tx_count_byte -= 4U;
    }
    else
    {
      hi3c->tx_count_byte = 0U;
    }
    transfer_count--;
  }
}

/**
  * @brief  I3C receive by byte.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  */
static void I3C_ReceiveByteTreatment(hal_i3c_handle_t *hi3c)
{
  I3C_TypeDef *p_i3cx = I3C_GET_INSTANCE(hi3c);

  /* Check RX FIFO not empty flag */
  while (LL_I3C_IsActiveFlag_RXFNE(p_i3cx) != 0U)
  {
    *hi3c->p_rx_data = LL_I3C_ReceiveData8(p_i3cx);
    hi3c->p_rx_data++;
    hi3c->rx_count_byte--;
  }
}

/**
  * @brief  I3C receive by byte, at most I3C_TRANSFER_MAX_BYTE.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  */
static void I3C_ReceiveByteTreatment_IT(hal_i3c_handle_t *hi3c)
{
  I3C_TypeDef *p_i3cx = I3C_GET_INSTANCE(hi3c);
  uint32_t transfer_count = hi3c->rx_count_byte;
  if (transfer_count > I3C_TRANSFER_MAX_BYTE)
  {
    transfer_count = I3C_TRANSFER_MAX_BYTE;
  }

  /* Receive transfer_count while RX FIFO not empty */
  while ((LL_I3C_IsActiveFlag_RXFNE(p_i3cx) != 0U) && (transfer_count != 0U))
  {
    *hi3c->p_rx_data = LL_I3C_ReceiveData8(p_i3cx);
    hi3c->p_rx_data++;
    hi3c->rx_count_byte--;
    transfer_count--;
  }
}

/**
  * @brief  I3C receive by word.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  */
static void I3C_ReceiveWordTreatment(hal_i3c_handle_t *hi3c)
{
  I3C_TypeDef *p_i3cx = I3C_GET_INSTANCE(hi3c);

  /* Check RX FIFO not empty flag */
  while (LL_I3C_IsActiveFlag_RXFNE(p_i3cx) != 0U)
  {
    *((uint32_t *)(uint32_t)hi3c->p_rx_data) = LL_I3C_ReceiveData32(p_i3cx);
    hi3c->p_rx_data += sizeof(uint32_t);
    if (hi3c->rx_count_byte > 4U)
    {
      hi3c->rx_count_byte -= 4U;
    }
    else
    {
      hi3c->rx_count_byte = 0U;
    }
  }
}

/**
  * @brief  I3C receive by word, at most I3C_TRANSFER_MAX_WORD.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  */
static void I3C_ReceiveWordTreatment_IT(hal_i3c_handle_t *hi3c)
{
  I3C_TypeDef *p_i3cx = I3C_GET_INSTANCE(hi3c);
  uint32_t transfer_count = (hi3c->rx_count_byte + 3U) / 4U;
  if (transfer_count > I3C_TRANSFER_MAX_WORD)
  {
    transfer_count = I3C_TRANSFER_MAX_WORD;
  }

  /* Receive transfer_count while RX FIFO not empty */
  while ((LL_I3C_IsActiveFlag_RXFNE(p_i3cx) != 0U) && (transfer_count != 0U))
  {
    *((uint32_t *)(uint32_t)hi3c->p_rx_data) = LL_I3C_ReceiveData32(p_i3cx);
    hi3c->p_rx_data += 4U;
    if (hi3c->rx_count_byte > 4U)
    {
      hi3c->rx_count_byte -= 4U;
    }
    else
    {
      hi3c->rx_count_byte = 0U;
    }
    transfer_count++;
  }
}

/**
  * @brief  I3C Control data treatment.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  */
static void I3C_ControlDataTreatment(hal_i3c_handle_t *hi3c)
{
  I3C_TypeDef *p_i3cx = I3C_GET_INSTANCE(hi3c);

  /* Check if Control FIFO requests data */
  if (LL_I3C_IsActiveFlag_CFNF(p_i3cx) != 0U)
  {
    LL_I3C_WriteControlWord(p_i3cx, *hi3c->p_tc_data);
    hi3c->p_tc_data++;
    hi3c->tc_count_word--;
  }
}

/**
  * @brief  I3C state change to HAL_I3C_STATE_IDLE and must be called at
  *         the very end of a process to avoid state issue.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  */
static void I3C_StateIdle(hal_i3c_handle_t *hi3c)
{
  if (hi3c->listen == I3C_LISTEN_ENABLED)
  {
    if (hi3c->mode == HAL_I3C_MODE_TGT)
    {
      hi3c->p_isr_func = I3C_Tgt_Event_ISR;
    }
    else
    {
      hi3c->p_isr_func = I3C_Ctrl_Event_ISR;
    }
  }
  else
  {
    hi3c->p_isr_func = NULL;
  }

  hi3c->global_state = HAL_I3C_STATE_IDLE;
}

#if defined(USE_HAL_I3C_GET_LAST_ERRORS) && (USE_HAL_I3C_GET_LAST_ERRORS == 1)
/**
  * @brief  I3C get error source.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  */
static void I3C_GetErrorSources(hal_i3c_handle_t *hi3c)
{
  hi3c->last_error_codes |= LL_I3C_GetRegister_SER(I3C_GET_INSTANCE(hi3c));
}
#endif /* USE_HAL_I3C_GET_LAST_ERRORS */

/**
  * @brief  Check if the target device is ready.
  * @param  hi3c        Pointer to a @ref hal_i3c_handle_t
  * @param  p_device    Structure with device address and message type
  * @param  timeout_ms  Polling timeout (in ms)
  * @note   This function uses a polling strategy: repeatedly issues START + address
  *         and waits for hardware flags. It returns at the first successful frame
  *         complete or when the user timeout elapses
  * @retval HAL_OK       Frame complete (FCF) detected: device is ready
  * @retval HAL_TIMEOUT  User timeout elapsed: device not ready in time
  * @retval HAL_ERROR    Internal failure while waiting for hardware flags
  */
static hal_status_t I3C_Ctrl_PoolForDeviceReady(hal_i3c_handle_t *hi3c,
                                                const i3c_device_t *p_device,
                                                uint32_t timeout_ms)
{
  hal_status_t hal_status = HAL_OK;
  uint32_t cr_tmp;
  uint32_t arbitration_previous_state;
  uint32_t tickstart = HAL_GetTick();
  I3C_TypeDef *p_i3cx;

