MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i3c.c
  p_i3cx = I3C_GET_INSTANCE(hi3c);

  arbitration_previous_state = LL_I3C_IsEnabledArbitrationHeader(p_i3cx);
  LL_I3C_DisableArbitrationHeader(p_i3cx);

  /* HAL_I3C_DIRECTION_WRITE = 0 */
  cr_tmp = (((uint32_t)p_device->address << I3C_CR_ADD_Pos) |
            p_device->message_type | LL_I3C_GENERATE_STOP);

  /** Retry strategy: attempt start + address until either:
    *  - FCF detected (device ready -> HAL_OK),
    *  - User timeout elapses (device not ready -> HAL_TIMEOUT), or
    *  - Internal wait exceeds I3C_DEFAULT_TIMEOUT_MS (internal failure -> HAL_ERROR).
    */
  while (hal_status == HAL_OK)
  {
    /* Initiate a start condition by writing in the CR register */
    LL_I3C_SetRegister_CR(p_i3cx, cr_tmp);
    uint32_t tickstart_hw = HAL_GetTick();

    while (LL_I3C_IsActiveFlag(p_i3cx, LL_I3C_EVR_FCF | LL_I3C_EVR_ERRF) == 0U)
    {
      if ((HAL_GetTick() - tickstart_hw) > I3C_DEFAULT_TIMEOUT_MS)
      {
        /* Internal failure */
        hal_status = HAL_ERROR;
        break;
      }
    }

    if (hal_status == HAL_OK)
    {
      if (LL_I3C_IsActiveFlag_FC(p_i3cx) != 0U)
      {
        LL_I3C_ClearFlag_FC(p_i3cx);
        /* Device is ready, break the loop and return HAL_OK */
        break;
      }
      else
      {
        /* Address is nack, device is not detected, let's try again */
        LL_I3C_ClearFlag_ERR(p_i3cx);
      }

      if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
      {
        hal_status = HAL_TIMEOUT;
      }
    }
  }

  I3C_StateIdle(hi3c);

  if (arbitration_previous_state != 0U)
  {
    LL_I3C_EnableArbitrationHeader(p_i3cx);
  }

  return hal_status;
}

/**
  * @brief  I3C error treatment.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  */
static void I3C_ErrorTreatment(hal_i3c_handle_t *hi3c)
{
  uint32_t flush_mask;
#if defined(USE_HAL_I3C_DMA) && (USE_HAL_I3C_DMA == 1)
  uint32_t dma_abort_ctrl = 0U;
  uint32_t dma_abort_rx = 0U;
  uint32_t dma_abort_tx = 0U;
  uint32_t dma_abort_it = 0U;
#endif /* USE_HAL_I3C_DMA */
  I3C_TypeDef *p_i3cx = I3C_GET_INSTANCE(hi3c);

  if (hi3c->global_state == HAL_I3C_STATE_TGT_REQ)
  {
    I3C_StateIdle(hi3c);
    LL_I3C_DisableIT(p_i3cx, (LL_I3C_TGT_IBI_IT | LL_I3C_TGT_HOTJOIN_IT | LL_I3C_TGT_CTRLROLE_IT));
  }
  else
  {
    LL_I3C_DisableIT(p_i3cx, LL_I3C_CTRL_RX_IT | LL_I3C_CTRL_TX_IT);
    hi3c->tx_count_byte = 0U;
    hi3c->rx_count_byte = 0U;
    hi3c->tc_count_word = 0U;
    hi3c->p_tx_func = NULL;
    hi3c->p_rx_func = NULL;

    /* Flush the different Fifos to generate an automatic stop mode link to underflow or overflow detection timeout */
    flush_mask = (I3C_CFGR_TXFLUSH | I3C_CFGR_RXFLUSH);

    if (hi3c->mode == HAL_I3C_MODE_CTRL)
    {
      flush_mask |= (I3C_CFGR_SFLUSH | I3C_CFGR_CFLUSH);
    }

    LL_I3C_RequestFifosFlush(p_i3cx, flush_mask);

#if defined(USE_HAL_I3C_DMA) && (USE_HAL_I3C_DMA == 1)
    /* Prepare abort DMA transfer if any */
    if (hi3c->hdma_tc != NULL)
    {
      LL_I3C_DisableDMAReq_Control(p_i3cx);

      if (HAL_DMA_GetState(hi3c->hdma_tc) != HAL_DMA_STATE_IDLE)
      {
        hi3c->hdma_tc->p_xfer_abort_cb = I3C_DMAAbort;
        dma_abort_ctrl = 1U;
      }
    }

    if (hi3c->hdma_rx != NULL)
    {
      LL_I3C_DisableDMAReq_RX(p_i3cx);

      if (HAL_DMA_GetState(hi3c->hdma_rx) != HAL_DMA_STATE_IDLE)
      {
        hi3c->hdma_rx->p_xfer_abort_cb = I3C_DMAAbort;
        dma_abort_rx = 1U;
      }
    }

    if (hi3c->hdma_tx != NULL)
    {
      LL_I3C_DisableDMAReq_TX(p_i3cx);

      if (HAL_DMA_GetState(hi3c->hdma_tx) != HAL_DMA_STATE_IDLE)
      {
        hi3c->hdma_tx->p_xfer_abort_cb = I3C_DMAAbort;
        dma_abort_tx = 1U;
      }
    }

    /* Abort control DMA transfer if any */
    if (dma_abort_ctrl != 0U)
    {
      dma_abort_it++;
      if (HAL_DMA_Abort_IT(hi3c->hdma_tc) != HAL_OK)
      {
        /* Call Directly XferAbortCallback function in case of error */
        hi3c->hdma_tc->p_xfer_abort_cb(hi3c->hdma_tc);
      }
    }

    if (dma_abort_rx != 0U)
    {
      dma_abort_it++;
      if (HAL_DMA_Abort_IT(hi3c->hdma_rx) != HAL_OK)
      {
        /* Call Directly XferAbortCallback function in case of error */
        hi3c->hdma_rx->p_xfer_abort_cb(hi3c->hdma_rx);
      }
    }

    if (dma_abort_tx != 0U)
    {
      dma_abort_it++;
      if (HAL_DMA_Abort_IT(hi3c->hdma_tx) != HAL_OK)
      {
        /* Call Directly XferAbortCallback function in case of error */
        hi3c->hdma_tx->p_xfer_abort_cb(hi3c->hdma_tx);
      }
    }

    if (dma_abort_it == 0U)
    {
      I3C_TreatErrorCallback(hi3c);
    }
#else /* USE_HAL_I3C_DMA */
    I3C_TreatErrorCallback(hi3c);
#endif /* USE_HAL_I3C_DMA */
  }
}

/**
  * @brief  I3C Error callback treatment.
  * @param  hi3c  Pointer to a @ref hal_i3c_handle_t
  */
static void I3C_TreatErrorCallback(hal_i3c_handle_t *hi3c)
{
  if (hi3c->global_state == HAL_I3C_STATE_ABORT)
  {
    I3C_StateIdle(hi3c);

#if (USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
    hi3c->p_abort_cplt_cb(hi3c);
#else
    HAL_I3C_AbortCpltCallback(hi3c);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
  }
  else
  {
    I3C_StateIdle(hi3c);

#if (USE_HAL_I3C_REGISTER_CALLBACKS) && (USE_HAL_I3C_REGISTER_CALLBACKS == 1)
    hi3c->p_error_cb(hi3c);
#else
    HAL_I3C_ErrorCallback(hi3c);
#endif /* USE_HAL_I3C_REGISTER_CALLBACKS */
  }
}

/**
  * @}
  */

#endif /* USE_HAL_I3C_MODULE */
#endif /* I3C1 */

/**
  * @}
  */

/**
  * @}
  */
